<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Function id="_1796" name="_IO_ftrylockfile" returns="_168" throw="" context="_1" location="f46:447" file="f46" line="447" extern="1">
    <Argument type="_2082" location="f46:447" file="f46" line="447"/>
  </Function>
  <Variable id="_1797" name="_ZTI18btConstraintSolver" type="_2030c" context="_1" location="f121:40" file="f121" line="40" extern="1" artificial="1"/>
  <Typedef id="_1798" name="__int32_t" type="_168" context="_1" location="f20:40" file="f20" line="40"/>
  <Function id="_1799" name="abs" returns="_168" throw="" context="_1" location="f13:775" file="f13" line="775" extern="1" attributes="nothrow const __warn_unused_result__">
    <Argument name="__x" type="_168" location="f13:775" file="f13" line="775"/>
  </Function>
  <Typedef id="_1800" name="__io_write_fn" type="_396" context="_1" location="f46:347" file="f46" line="347"/>
  <Struct id="_1801" name="btOverlapFilterCallback" context="_1" abstract="1" mangled="23btOverlapFilterCallback" demangled="btOverlapFilterCallback" location="f14:39" file="f14" line="39" artificial="1" size="64" align="64" members="_8816 _8817 _8818 _8819 _8820 " bases=""/>
  <Variable id="_1802" name="_ZTI12btSerializer" type="_2030c" context="_1" location="f30:69" file="f30" line="69" extern="1" artificial="1"/>
  <Class id="_1803" name="btBU_Simplex1to4" context="_1" mangled="16btBU_Simplex1to4" demangled="btBU_Simplex1to4" location="f122:26" file="f122" line="26" artificial="1" size="1408" align="64" members="_8821 _8822 _8823 _8824 _8825 _8826 _8827 _8828 _8829 _8830 _8831 _8832 _8833 _8834 _8835 _8836 _8837 _8838 _8839 _8840 _8841 _8842 _8843 _8844 _8845 _8846 _8847 _8848 _8849 _8850 " bases="_1026 ">
    <Base type="_1026" access="public" virtual="0" offset="0"/>
  </Class>
  <Typedef id="_1804" name="__caddr_t" type="_1071" context="_1" location="f20:183" file="f20" line="183"/>
  <Class id="_1805" name="bad_exception" context="_2" mangled="St13bad_exception" demangled="std::bad_exception" location="f58:74" file="f58" line="74" artificial="1" size="64" align="64" members="_8851 _8852 _8853 _8854 _8855 " bases="_1819 ">
    <Base type="_1819" access="public" virtual="0" offset="0"/>
  </Class>
  <Function id="_1806" name="set_unexpected" returns="_1809" throw="" context="_2" mangled="_ZSt14set_unexpectedPFvvE" demangled="std::set_unexpected(void (*)())" location="f58:105" file="f58" line="105" extern="1">
    <Argument type="_1809" location="f58:105" file="f58" line="105"/>
  </Function>
  <Function id="_1807" name="terminate" returns="_635" throw="" context="_2" mangled="_ZSt9terminatev" demangled="std::terminate()" location="f58:102" file="f58" line="102" extern="1" attributes="__noreturn__"/>
  <PointerType id="_1808" type="_8856" size="64" align="64"/>
  <Typedef id="_1809" name="unexpected_handler" type="_1808" context="_2" location="f58:90" file="f58" line="90"/>
  <Variable id="_1810" name="nothrow" type="_1814c" context="_2" mangled="_ZSt7nothrow" demangled="std::nothrow" location="f43:101" file="f43" line="101" extern="1"/>
  <Typedef id="_1811" name="new_handler" type="_1808" context="_2" location="f43:105" file="f43" line="105"/>
  <Function id="_1812" name="unexpected" returns="_635" context="_2" mangled="_ZSt10unexpectedv" demangled="std::unexpected()" location="f58:114" file="f58" line="114" extern="1" attributes="__noreturn__"/>
  <Typedef id="_1813" name="ptrdiff_t" type="_22" context="_2" location="f131:189" file="f131" line="189"/>
  <Struct id="_1814" name="nothrow_t" context="_2" mangled="St9nothrow_t" demangled="std::nothrow_t" location="f43:99" file="f43" line="99" artificial="1" size="8" align="8" members="_8858 _8859 _8860 _8861 " bases=""/>
  <Function id="_1815" name="set_new_handler" returns="_1811" throw="" context="_2" mangled="_ZSt15set_new_handlerPFvvE" demangled="std::set_new_handler(void (*)())" location="f43:109" file="f43" line="109" extern="1">
    <Argument type="_1811" location="f43:109" file="f43" line="109"/>
  </Function>
  <Typedef id="_1816" name="size_t" type="_153" context="_2" location="f131:188" file="f131" line="188"/>
  <Class id="_1817" name="bad_array_length" context="_2" mangled="St16bad_array_length" demangled="std::bad_array_length" location="f43:86" file="f43" line="86" artificial="1" size="64" align="64" members="_8862 _8863 _8864 _8865 _8866 " bases="_1818 ">
    <Base type="_1818" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_1818" name="bad_alloc" context="_2" mangled="St9bad_alloc" demangled="std::bad_alloc" location="f43:55" file="f43" line="55" artificial="1" size="64" align="64" members="_8867 _8868 _8869 _8870 _8871 " bases="_1819 ">
    <Base type="_1819" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_1819" name="exception" context="_2" mangled="St9exception" demangled="std::exception" location="f58:61" file="f58" line="61" artificial="1" size="64" align="64" members="_8872 _8873 _8874 _8875 _8876 " bases=""/>
  <Function id="_1820" name="uncaught_exception" returns="_1834" throw="" context="_2" mangled="_ZSt18uncaught_exceptionv" demangled="std::uncaught_exception()" location="f58:127" file="f58" line="127" extern="1" attributes="__pure__"/>
  <Function id="_1821" name="set_terminate" returns="_1822" throw="" context="_2" mangled="_ZSt13set_terminatePFvvE" demangled="std::set_terminate(void (*)())" location="f58:93" file="f58" line="93" extern="1">
    <Argument type="_1822" location="f58:93" file="f58" line="93"/>
  </Function>
  <Typedef id="_1822" name="terminate_handler" type="_1808" context="_2" location="f58:87" file="f58" line="87"/>
  <PointerType id="_1823" type="_6031c" size="64" align="64"/>
  <ReferenceType id="_1824" type="_193c" size="64" align="64"/>
  <FundamentalType id="_1825" name="long double" size="128" align="128"/>
  <Struct id="_1826" name="__si_class_type_info_pseudo" context="_1" mangled="27__si_class_type_info_pseudo" demangled="__si_class_type_info_pseudo" location="f132:0" file="f132" line="0" size="192" align="64" members=""/>
  <CvQualifiedType id="_1826c" type="_1826" const="1"/>
  <Field id="_1828" name="tv_sec" type="_1023" offset="0" context="_14" access="public" location="f5:32" file="f5" line="32"/>
  <Field id="_1829" name="tv_usec" type="_201" offset="64" context="_14" access="public" location="f5:33" file="f5" line="33"/>
  <Destructor id="_1830" name="timeval" artificial="1" throw="" context="_14" access="public" mangled="_ZN7timevalD1Ev *INTERNAL* " demangled="timeval::~timeval()" location="f5:31" file="f5" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_1831" name="=" returns="_8879" artificial="1" throw="" context="_14" access="public" mangled="_ZN7timevalaSERKS_" demangled="timeval::operator=(timeval const&amp;)" location="f5:31" file="f5" line="31" endline="31" inline="1">
    <Argument type="_8880" location="f5:31" file="f5" line="31"/>
  </OperatorMethod>
  <Constructor id="_1832" name="timeval" artificial="1" throw="" context="_14" access="public" mangled="_ZN7timevalC1ERKS_ *INTERNAL* " demangled="timeval::timeval(timeval const&amp;)" location="f5:31" file="f5" line="31" endline="31" inline="1">
    <Argument type="_8880" location="f5:31" file="f5" line="31"/>
  </Constructor>
  <Constructor id="_1833" name="timeval" artificial="1" throw="" context="_14" access="public" mangled="_ZN7timevalC1Ev *INTERNAL* " demangled="timeval::timeval()" location="f5:31" file="f5" line="31" inline="1"/>
  <FundamentalType id="_1834" name="bool" size="8" align="8"/>
  <Field id="_1835" name="m_convexInternalShapeData" type="_1344" offset="0" context="_16" access="public" location="f7:160" file="f7" line="160"/>
  <Field id="_1836" name="m_upAxis" type="_168" offset="448" context="_16" access="public" location="f7:162" file="f7" line="162"/>
  <Field id="_1837" name="m_padding" type="_8881" offset="480" context="_16" access="public" location="f7:164" file="f7" line="164"/>
  <Destructor id="_1838" name="btCapsuleShapeData" artificial="1" throw="" context="_16" access="public" mangled="_ZN18btCapsuleShapeDataD1Ev *INTERNAL* " demangled="btCapsuleShapeData::~btCapsuleShapeData()" location="f7:159" file="f7" line="159" endline="159" inline="1">
  </Destructor>
  <OperatorMethod id="_1839" name="=" returns="_8882" artificial="1" throw="" context="_16" access="public" mangled="_ZN18btCapsuleShapeDataaSERKS_" demangled="btCapsuleShapeData::operator=(btCapsuleShapeData const&amp;)" location="f7:159" file="f7" line="159" endline="159" inline="1">
    <Argument type="_8883" location="f7:159" file="f7" line="159"/>
  </OperatorMethod>
  <Constructor id="_1840" name="btCapsuleShapeData" artificial="1" throw="" context="_16" access="public" mangled="_ZN18btCapsuleShapeDataC1ERKS_ *INTERNAL* " demangled="btCapsuleShapeData::btCapsuleShapeData(btCapsuleShapeData const&amp;)" location="f7:159" file="f7" line="159" endline="159" inline="1">
    <Argument type="_8883" location="f7:159" file="f7" line="159"/>
  </Constructor>
  <Constructor id="_1841" name="btCapsuleShapeData" artificial="1" throw="" context="_16" access="public" mangled="_ZN18btCapsuleShapeDataC1Ev *INTERNAL* " demangled="btCapsuleShapeData::btCapsuleShapeData()" location="f7:159" file="f7" line="159" inline="1"/>
  <Field id="_1842" name="m_convexEpsilon" type="_362" offset="1088" context="_17" access="public" location="f8:60" file="f8" line="60"/>
  <Field id="_1843" name="m_planarEpsilon" type="_362" offset="1120" context="_17" access="public" location="f8:61" file="f8" line="61"/>
  <Field id="_1844" name="m_equalVertexThreshold" type="_362" offset="1152" context="_17" access="public" location="f8:62" file="f8" line="62"/>
  <Field id="_1845" name="m_edgeDistanceThreshold" type="_362" offset="1184" context="_17" access="public" location="f8:63" file="f8" line="63"/>
  <Field id="_1846" name="m_maxEdgeAngleThreshold" type="_362" offset="1216" context="_17" access="public" location="f8:64" file="f8" line="64"/>
  <Field id="_1847" name="m_zeroAreaThreshold" type="_362" offset="1248" context="_17" access="public" location="f8:65" file="f8" line="65"/>
  <OperatorMethod id="_1848" name="=" returns="_8884" artificial="1" context="_17" access="public" mangled="_ZN17btTriangleInfoMapaSERKS_" demangled="btTriangleInfoMap::operator=(btTriangleInfoMap const&amp;)" location="f8:59" file="f8" line="59" endline="59" inline="1">
    <Argument type="_8885" location="f8:59" file="f8" line="59"/>
  </OperatorMethod>
  <Constructor id="_1849" name="btTriangleInfoMap" artificial="1" context="_17" access="public" mangled="_ZN17btTriangleInfoMapC1ERKS_ *INTERNAL* " demangled="btTriangleInfoMap::btTriangleInfoMap(btTriangleInfoMap const&amp;)" location="f8:59" file="f8" line="59" endline="59" inline="1">
    <Argument type="_8885" location="f8:59" file="f8" line="59"/>
  </Constructor>
  <Constructor id="_1850" name="btTriangleInfoMap" explicit="1" context="_17" access="public" mangled="_ZN17btTriangleInfoMapC1Ev *INTERNAL* " demangled="btTriangleInfoMap::btTriangleInfoMap()" location="f8:68" file="f8" line="68" endline="76" inline="1"/>
  <Destructor id="_1851" name="btTriangleInfoMap" virtual="1" overrides="" context="_17" access="public" mangled="_ZN17btTriangleInfoMapD1Ev *INTERNAL* " demangled="btTriangleInfoMap::~btTriangleInfoMap()" location="f8:77" file="f8" line="77" endline="77" inline="1">
  </Destructor>
  <Method id="_1852" name="calculateSerializeBufferSize" returns="_168" const="1" virtual="1" overrides="" context="_17" access="public" mangled="_ZNK17btTriangleInfoMap28calculateSerializeBufferSizeEv" demangled="btTriangleInfoMap::calculateSerializeBufferSize() const" location="f8:117" file="f8" line="117" endline="119" inline="1"/>
  <Method id="_1853" name="serialize" returns="_1823" const="1" virtual="1" overrides="" context="_17" access="public" mangled="_ZNK17btTriangleInfoMap9serializeEPvP12btSerializer" demangled="btTriangleInfoMap::serialize(void*, btSerializer*) const" location="f8:123" file="f8" line="123" endline="198" inline="1">
    <Argument name="dataBuffer" type="_1077" location="f8:123" file="f8" line="123"/>
    <Argument name="serializer" type="_8886" location="f8:123" file="f8" line="123"/>
  </Method>
  <Method id="_1854" name="deSerialize" returns="_635" context="_17" access="public" mangled="_ZN17btTriangleInfoMap11deSerializeER21btTriangleInfoMapData" demangled="btTriangleInfoMap::deSerialize(btTriangleInfoMapData&amp;)" location="f8:204" file="f8" line="204" inline="1">
    <Argument name="tmapData" type="_8887" location="f8:204" file="f8" line="204"/>
  </Method>
  <Field id="_1855" name="m_el" type="_8888" offset="0" context="_18" access="public" location="f9:1329" file="f9" line="1329"/>
  <Destructor id="_1856" name="btMatrix3x3DoubleData" artificial="1" throw="" context="_18" access="public" mangled="_ZN21btMatrix3x3DoubleDataD1Ev *INTERNAL* " demangled="btMatrix3x3DoubleData::~btMatrix3x3DoubleData()" location="f9:1328" file="f9" line="1328" endline="1328" inline="1">
  </Destructor>
  <OperatorMethod id="_1857" name="=" returns="_8889" artificial="1" throw="" context="_18" access="public" mangled="_ZN21btMatrix3x3DoubleDataaSERKS_" demangled="btMatrix3x3DoubleData::operator=(btMatrix3x3DoubleData const&amp;)" location="f9:1328" file="f9" line="1328" endline="1328" inline="1">
    <Argument type="_8890" location="f9:1328" file="f9" line="1328"/>
  </OperatorMethod>
  <Constructor id="_1858" name="btMatrix3x3DoubleData" artificial="1" throw="" context="_18" access="public" mangled="_ZN21btMatrix3x3DoubleDataC1ERKS_ *INTERNAL* " demangled="btMatrix3x3DoubleData::btMatrix3x3DoubleData(btMatrix3x3DoubleData const&amp;)" location="f9:1328" file="f9" line="1328" endline="1328" inline="1">
    <Argument type="_8890" location="f9:1328" file="f9" line="1328"/>
  </Constructor>
  <Constructor id="_1859" name="btMatrix3x3DoubleData" artificial="1" throw="" context="_18" access="public" mangled="_ZN21btMatrix3x3DoubleDataC1Ev *INTERNAL* " demangled="btMatrix3x3DoubleData::btMatrix3x3DoubleData()" location="f9:1328" file="f9" line="1328" inline="1"/>
  <Field id="_1860" name="m_userConstraintType" type="_168" offset="96" context="_19" access="private" location="f10:78" file="f10" line="78"/>
  <Field id="_1861" name="" type="_1871" offset="128" context="_19" access="private" location="f10:84" file="f10" line="84"/>
  <Field id="_1862" name="m_breakingImpulseThreshold" type="_362" offset="192" context="_19" access="private" location="f10:86" file="f10" line="86"/>
  <Field id="_1863" name="m_isEnabled" type="_1834" offset="224" context="_19" access="private" location="f10:87" file="f10" line="87"/>
  <Field id="_1864" name="m_needsFeedback" type="_1834" offset="232" context="_19" access="private" location="f10:88" file="f10" line="88"/>
  <Field id="_1865" name="m_overrideNumSolverIterations" type="_168" offset="256" context="_19" access="private" location="f10:89" file="f10" line="89"/>
  <Field id="_1866" name="m_rbA" type="_8891" offset="320" context="_19" access="protected" location="f10:100" file="f10" line="100"/>
  <Field id="_1867" name="m_rbB" type="_8891" offset="384" context="_19" access="protected" location="f10:101" file="f10" line="101"/>
  <Field id="_1868" name="m_appliedImpulse" type="_362" offset="448" context="_19" access="protected" location="f10:102" file="f10" line="102"/>
  <Field id="_1869" name="m_dbgDrawSize" type="_362" offset="480" context="_19" access="protected" location="f10:103" file="f10" line="103"/>
  <Field id="_1870" name="m_jointFeedback" type="_8892" offset="512" context="_19" access="protected" location="f10:104" file="f10" line="104"/>
  <Union id="_1871" context="_19" access="private" mangled="N17btTypedConstraint4._36E" demangled="btTypedConstraint::._36" location="f10:81" file="f10" line="81" artificial="1" size="64" align="64" members="_8893 _8894 " bases=""/>
  <Struct id="_1872" name="btConstraintInfo1" context="_19" access="public" mangled="N17btTypedConstraint17btConstraintInfo1E" demangled="btTypedConstraint::btConstraintInfo1" location="f10:118" file="f10" line="118" artificial="1" size="64" align="32" members="_8895 _8896 _8897 _8898 _8899 _8900 " bases=""/>
  <Struct id="_1873" name="btConstraintInfo2" context="_19" access="public" mangled="N17btTypedConstraint17btConstraintInfo2E" demangled="btTypedConstraint::btConstraintInfo2" location="f10:124" file="f10" line="124" artificial="1" size="768" align="64" members="_8901 _8902 _8903 _8904 _8905 _8906 _8907 _8908 _8909 _8910 _8911 _8912 _8913 _8914 _8915 _8916 _8917 _8918 " bases=""/>
  <Constructor id="_1874" name="btTypedConstraint" artificial="1" throw="" context="_19" access="public" mangled="_ZN17btTypedConstraintC1ERKS_ *INTERNAL* " demangled="btTypedConstraint::btTypedConstraint(btTypedConstraint const&amp;)" location="f10:77" file="f10" line="77" endline="77" inline="1">
    <Argument type="_8919" location="f10:77" file="f10" line="77"/>
  </Constructor>
  <OperatorMethod id="_1875" name="=" returns="_8920" context="_19" access="private" mangled="_ZN17btTypedConstraintaSERS_" demangled="btTypedConstraint::operator=(btTypedConstraint&amp;)" location="f10:92" file="f10" line="92" endline="96" inline="1">
    <Argument name="other" type="_8920" location="f10:92" file="f10" line="92"/>
  </OperatorMethod>
  <Method id="_1876" name="getMotorFactor" returns="_362" context="_19" access="protected" mangled="_ZN17btTypedConstraint14getMotorFactorEfffff" demangled="btTypedConstraint::getMotorFactor(float, float, float, float, float)" location="f10:107" file="f10" line="107" extern="1">
    <Argument name="pos" type="_362" location="f10:107" file="f10" line="107"/>
    <Argument name="lowLim" type="_362" location="f10:107" file="f10" line="107"/>
    <Argument name="uppLim" type="_362" location="f10:107" file="f10" line="107"/>
    <Argument name="vel" type="_362" location="f10:107" file="f10" line="107"/>
    <Argument name="timeFact" type="_362" location="f10:107" file="f10" line="107"/>
  </Method>
  <OperatorMethod id="_1877" name="new" returns="_1077" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintnwEm" demangled="btTypedConstraint::operator new(unsigned long)" location="f10:112" file="f10" line="112" endline="112" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f10:112" file="f10" line="112"/>
  </OperatorMethod>
  <OperatorMethod id="_1878" name="delete" returns="_635" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintdlEPv" demangled="btTypedConstraint::operator delete(void*)" location="f10:112" file="f10" line="112" endline="112" inline="1">
    <Argument name="ptr" type="_1077" location="f10:112" file="f10" line="112"/>
  </OperatorMethod>
  <OperatorMethod id="_1879" name="new" returns="_1077" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintnwEmPv" demangled="btTypedConstraint::operator new(unsigned long, void*)" location="f10:112" file="f10" line="112" endline="112" inline="1">
    <Argument type="_1165" location="f10:112" file="f10" line="112"/>
    <Argument name="ptr" type="_1077" location="f10:112" file="f10" line="112"/>
  </OperatorMethod>
  <OperatorMethod id="_1880" name="delete" returns="_635" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintdlEPvS0_" demangled="btTypedConstraint::operator delete(void*, void*)" location="f10:112" file="f10" line="112" inline="1">
    <Argument type="_1077" location="f10:112" file="f10" line="112"/>
    <Argument type="_1077" location="f10:112" file="f10" line="112"/>
  </OperatorMethod>
  <OperatorMethod id="_1881" name="new []" returns="_1077" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintnaEm" demangled="btTypedConstraint::operator new[](unsigned long)" location="f10:112" file="f10" line="112" endline="112" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f10:112" file="f10" line="112"/>
  </OperatorMethod>
  <OperatorMethod id="_1882" name="delete []" returns="_635" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintdaEPv" demangled="btTypedConstraint::operator delete[](void*)" location="f10:112" file="f10" line="112" endline="112" inline="1">
    <Argument name="ptr" type="_1077" location="f10:112" file="f10" line="112"/>
  </OperatorMethod>
  <OperatorMethod id="_1883" name="new []" returns="_1077" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintnaEmPv" demangled="btTypedConstraint::operator new[](unsigned long, void*)" location="f10:112" file="f10" line="112" endline="112" inline="1">
    <Argument type="_1165" location="f10:112" file="f10" line="112"/>
    <Argument name="ptr" type="_1077" location="f10:112" file="f10" line="112"/>
  </OperatorMethod>
  <OperatorMethod id="_1884" name="delete []" returns="_635" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintdaEPvS0_" demangled="btTypedConstraint::operator delete[](void*, void*)" location="f10:112" file="f10" line="112" inline="1">
    <Argument type="_1077" location="f10:112" file="f10" line="112"/>
    <Argument type="_1077" location="f10:112" file="f10" line="112"/>
  </OperatorMethod>
  <Destructor id="_1885" name="btTypedConstraint" virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraintD1Ev *INTERNAL* " demangled="btTypedConstraint::~btTypedConstraint()" location="f10:114" file="f10" line="114" endline="114" inline="1">
  </Destructor>
  <Constructor id="_1886" name="btTypedConstraint" explicit="1" context="_19" access="public" mangled="_ZN17btTypedConstraintC1E21btTypedConstraintTypeR11btRigidBody *INTERNAL* " demangled="btTypedConstraint::btTypedConstraint(btTypedConstraintType, btRigidBody&amp;)" location="f10:115" file="f10" line="115" extern="1">
    <Argument name="type" type="_889" location="f10:115" file="f10" line="115"/>
    <Argument name="rbA" type="_8891" location="f10:115" file="f10" line="115"/>
  </Constructor>
  <Constructor id="_1887" name="btTypedConstraint" explicit="1" context="_19" access="public" mangled="_ZN17btTypedConstraintC1E21btTypedConstraintTypeR11btRigidBodyS2_ *INTERNAL* " demangled="btTypedConstraint::btTypedConstraint(btTypedConstraintType, btRigidBody&amp;, btRigidBody&amp;)" location="f10:116" file="f10" line="116" extern="1">
    <Argument name="type" type="_889" location="f10:116" file="f10" line="116"/>
    <Argument name="rbA" type="_8891" location="f10:116" file="f10" line="116"/>
    <Argument name="rbB" type="_8891" location="f10:116" file="f10" line="116"/>
  </Constructor>
  <Method id="_1888" name="getFixedBody" returns="_8891" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraint12getFixedBodyEv" demangled="btTypedConstraint::getFixedBody()" location="f10:122" file="f10" line="122" extern="1"/>
  <Method id="_1889" name="getOverrideNumSolverIterations" returns="_168" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint30getOverrideNumSolverIterationsEv" demangled="btTypedConstraint::getOverrideNumSolverIterations() const" location="f10:158" file="f10" line="158" endline="160" inline="1"/>
  <Method id="_1890" name="setOverrideNumSolverIterations" returns="_635" context="_19" access="public" mangled="_ZN17btTypedConstraint30setOverrideNumSolverIterationsEi" demangled="btTypedConstraint::setOverrideNumSolverIterations(int)" location="f10:165" file="f10" line="165" endline="167" inline="1">
    <Argument name="overideNumIterations" type="_168" location="f10:165" file="f10" line="165"/>
  </Method>
  <Method id="_1891" name="buildJacobian" returns="_635" virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraint13buildJacobianEv" demangled="btTypedConstraint::buildJacobian()" location="f10:171" file="f10" line="171" inline="1"/>
  <Method id="_1892" name="setupSolverConstraint" returns="_635" virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraint21setupSolverConstraintER20btAlignedObjectArrayI18btSolverConstraintEiif" demangled="btTypedConstraint::setupSolverConstraint(btAlignedObjectArray&lt;btSolverConstraint&gt;&amp;, int, int, float)" location="f10:174" file="f10" line="174" inline="1">
    <Argument name="ca" type="_8921" location="f10:174" file="f10" line="174"/>
    <Argument name="solverBodyA" type="_168" location="f10:174" file="f10" line="174"/>
    <Argument name="solverBodyB" type="_168" location="f10:174" file="f10" line="174"/>
    <Argument name="timeStep" type="_362" location="f10:174" file="f10" line="174"/>
  </Method>
  <Method id="_1893" name="getInfo1" returns="_635" virtual="1" pure_virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraint8getInfo1EPNS_17btConstraintInfo1E" demangled="btTypedConstraint::getInfo1(btTypedConstraint::btConstraintInfo1*)" location="f10:183" file="f10" line="183" extern="1">
    <Argument name="info" type="_3699" location="f10:183" file="f10" line="183"/>
  </Method>
  <Method id="_1894" name="getInfo2" returns="_635" virtual="1" pure_virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraint8getInfo2EPNS_17btConstraintInfo2E" demangled="btTypedConstraint::getInfo2(btTypedConstraint::btConstraintInfo2*)" location="f10:186" file="f10" line="186" extern="1">
    <Argument name="info" type="_8922" location="f10:186" file="f10" line="186"/>
  </Method>
  <Method id="_1895" name="internalSetAppliedImpulse" returns="_635" context="_19" access="public" mangled="_ZN17btTypedConstraint25internalSetAppliedImpulseEf" demangled="btTypedConstraint::internalSetAppliedImpulse(float)" location="f10:189" file="f10" line="189" endline="191" inline="1">
    <Argument name="appliedImpulse" type="_362" location="f10:189" file="f10" line="189"/>
  </Method>
  <Method id="_1896" name="internalGetAppliedImpulse" returns="_362" context="_19" access="public" mangled="_ZN17btTypedConstraint25internalGetAppliedImpulseEv" demangled="btTypedConstraint::internalGetAppliedImpulse()" location="f10:194" file="f10" line="194" endline="196" inline="1"/>
  <Method id="_1897" name="getBreakingImpulseThreshold" returns="_362" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint27getBreakingImpulseThresholdEv" demangled="btTypedConstraint::getBreakingImpulseThreshold() const" location="f10:200" file="f10" line="200" endline="202" inline="1"/>
  <Method id="_1898" name="setBreakingImpulseThreshold" returns="_635" context="_19" access="public" mangled="_ZN17btTypedConstraint27setBreakingImpulseThresholdEf" demangled="btTypedConstraint::setBreakingImpulseThreshold(float)" location="f10:205" file="f10" line="205" endline="207" inline="1">
    <Argument name="threshold" type="_362" location="f10:205" file="f10" line="205"/>
  </Method>
  <Method id="_1899" name="isEnabled" returns="_1834" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint9isEnabledEv" demangled="btTypedConstraint::isEnabled() const" location="f10:210" file="f10" line="210" endline="212" inline="1"/>
  <Method id="_1900" name="setEnabled" returns="_635" context="_19" access="public" mangled="_ZN17btTypedConstraint10setEnabledEb" demangled="btTypedConstraint::setEnabled(bool)" location="f10:215" file="f10" line="215" endline="217" inline="1">
    <Argument name="enabled" type="_1834" location="f10:215" file="f10" line="215"/>
  </Method>
  <Method id="_1901" name="solveConstraintObsolete" returns="_635" virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraint23solveConstraintObsoleteER12btSolverBodyS1_f" demangled="btTypedConstraint::solveConstraintObsolete(btSolverBody&amp;, btSolverBody&amp;, float)" location="f10:222" file="f10" line="222" inline="1">
    <Argument type="_3720" location="f10:222" file="f10" line="222"/>
    <Argument type="_3720" location="f10:222" file="f10" line="222"/>
    <Argument type="_362" location="f10:222" file="f10" line="222"/>
  </Method>
  <Method id="_1902" name="getRigidBodyA" returns="_8923" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint13getRigidBodyAEv" demangled="btTypedConstraint::getRigidBodyA() const" location="f10:225" file="f10" line="225" endline="227" inline="1"/>
  <Method id="_1903" name="getRigidBodyB" returns="_8923" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint13getRigidBodyBEv" demangled="btTypedConstraint::getRigidBodyB() const" location="f10:229" file="f10" line="229" endline="231" inline="1"/>
  <Method id="_1904" name="getRigidBodyA" returns="_8891" context="_19" access="public" mangled="_ZN17btTypedConstraint13getRigidBodyAEv" demangled="btTypedConstraint::getRigidBodyA()" location="f10:234" file="f10" line="234" endline="236" inline="1"/>
  <Method id="_1905" name="getRigidBodyB" returns="_8891" context="_19" access="public" mangled="_ZN17btTypedConstraint13getRigidBodyBEv" demangled="btTypedConstraint::getRigidBodyB()" location="f10:238" file="f10" line="238" endline="240" inline="1"/>
  <Method id="_1906" name="getUserConstraintType" returns="_168" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint21getUserConstraintTypeEv" demangled="btTypedConstraint::getUserConstraintType() const" location="f10:243" file="f10" line="243" endline="245" inline="1"/>
  <Method id="_1907" name="setUserConstraintType" returns="_635" context="_19" access="public" mangled="_ZN17btTypedConstraint21setUserConstraintTypeEi" demangled="btTypedConstraint::setUserConstraintType(int)" location="f10:248" file="f10" line="248" endline="250" inline="1">
    <Argument name="userConstraintType" type="_168" location="f10:248" file="f10" line="248"/>
  </Method>
  <Method id="_1908" name="setUserConstraintId" returns="_635" context="_19" access="public" mangled="_ZN17btTypedConstraint19setUserConstraintIdEi" demangled="btTypedConstraint::setUserConstraintId(int)" location="f10:253" file="f10" line="253" endline="255" inline="1">
    <Argument name="uid" type="_168" location="f10:253" file="f10" line="253"/>
  </Method>
  <Method id="_1909" name="getUserConstraintId" returns="_168" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint19getUserConstraintIdEv" demangled="btTypedConstraint::getUserConstraintId() const" location="f10:258" file="f10" line="258" endline="260" inline="1"/>
  <Method id="_1910" name="setUserConstraintPtr" returns="_635" context="_19" access="public" mangled="_ZN17btTypedConstraint20setUserConstraintPtrEPv" demangled="btTypedConstraint::setUserConstraintPtr(void*)" location="f10:263" file="f10" line="263" endline="265" inline="1">
    <Argument name="ptr" type="_1077" location="f10:263" file="f10" line="263"/>
  </Method>
  <Method id="_1911" name="getUserConstraintPtr" returns="_1077" context="_19" access="public" mangled="_ZN17btTypedConstraint20getUserConstraintPtrEv" demangled="btTypedConstraint::getUserConstraintPtr()" location="f10:268" file="f10" line="268" endline="270" inline="1"/>
  <Method id="_1912" name="setJointFeedback" returns="_635" context="_19" access="public" mangled="_ZN17btTypedConstraint16setJointFeedbackEP15btJointFeedback" demangled="btTypedConstraint::setJointFeedback(btJointFeedback*)" location="f10:273" file="f10" line="273" endline="275" inline="1">
    <Argument name="jointFeedback" type="_8892" location="f10:273" file="f10" line="273"/>
  </Method>
  <Method id="_1913" name="getJointFeedback" returns="_8924" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint16getJointFeedbackEv" demangled="btTypedConstraint::getJointFeedback() const" location="f10:278" file="f10" line="278" endline="280" inline="1"/>
  <Method id="_1914" name="getJointFeedback" returns="_8892" context="_19" access="public" mangled="_ZN17btTypedConstraint16getJointFeedbackEv" demangled="btTypedConstraint::getJointFeedback()" location="f10:283" file="f10" line="283" endline="285" inline="1"/>
  <Method id="_1915" name="getUid" returns="_168" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint6getUidEv" demangled="btTypedConstraint::getUid() const" location="f10:289" file="f10" line="289" endline="291" inline="1"/>
  <Method id="_1916" name="needsFeedback" returns="_1834" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint13needsFeedbackEv" demangled="btTypedConstraint::needsFeedback() const" location="f10:294" file="f10" line="294" endline="296" inline="1"/>
  <Method id="_1917" name="enableFeedback" returns="_635" context="_19" access="public" mangled="_ZN17btTypedConstraint14enableFeedbackEb" demangled="btTypedConstraint::enableFeedback(bool)" location="f10:301" file="f10" line="301" endline="303" inline="1">
    <Argument name="needsFeedback" type="_1834" location="f10:301" file="f10" line="301"/>
  </Method>
  <Method id="_1918" name="getAppliedImpulse" returns="_362" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint17getAppliedImpulseEv" demangled="btTypedConstraint::getAppliedImpulse() const" location="f10:308" file="f10" line="308" endline="311" inline="1"/>
  <Method id="_1919" name="getConstraintType" returns="_889" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint17getConstraintTypeEv" demangled="btTypedConstraint::getConstraintType() const" location="f10:314" file="f10" line="314" endline="316" inline="1"/>
  <Method id="_1920" name="setDbgDrawSize" returns="_635" context="_19" access="public" mangled="_ZN17btTypedConstraint14setDbgDrawSizeEf" demangled="btTypedConstraint::setDbgDrawSize(float)" location="f10:319" file="f10" line="319" endline="321" inline="1">
    <Argument name="dbgDrawSize" type="_362" location="f10:319" file="f10" line="319"/>
  </Method>
  <Method id="_1921" name="getDbgDrawSize" returns="_362" context="_19" access="public" mangled="_ZN17btTypedConstraint14getDbgDrawSizeEv" demangled="btTypedConstraint::getDbgDrawSize()" location="f10:323" file="f10" line="323" endline="325" inline="1"/>
  <Method id="_1922" name="setParam" returns="_635" virtual="1" pure_virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraint8setParamEifi" demangled="btTypedConstraint::setParam(int, float, int)" location="f10:330" file="f10" line="330" extern="1">
    <Argument name="num" type="_168" location="f10:330" file="f10" line="330"/>
    <Argument name="value" type="_362" location="f10:330" file="f10" line="330"/>
    <Argument name="axis" type="_168" location="f10:330" file="f10" line="330" default="-0x00000000000000001"/>
  </Method>
  <Method id="_1923" name="getParam" returns="_362" const="1" virtual="1" pure_virtual="1" overrides="" context="_19" access="public" mangled="_ZNK17btTypedConstraint8getParamEii" demangled="btTypedConstraint::getParam(int, int) const" location="f10:333" file="f10" line="333" extern="1">
    <Argument name="num" type="_168" location="f10:333" file="f10" line="333"/>
    <Argument name="axis" type="_168" location="f10:333" file="f10" line="333" default="-0x00000000000000001"/>
  </Method>
  <Method id="_1924" name="calculateSerializeBufferSize" returns="_168" const="1" virtual="1" overrides="" context="_19" access="public" mangled="_ZNK17btTypedConstraint28calculateSerializeBufferSizeEv" demangled="btTypedConstraint::calculateSerializeBufferSize() const" location="f10:443" file="f10" line="443" endline="445" inline="1"/>
  <Method id="_1925" name="serialize" returns="_1823" const="1" virtual="1" overrides="" context="_19" access="public" mangled="_ZNK17btTypedConstraint9serializeEPvP12btSerializer" demangled="btTypedConstraint::serialize(void*, btSerializer*) const" location="f10:338" file="f10" line="338" extern="1">
    <Argument name="dataBuffer" type="_1077" location="f10:338" file="f10" line="338"/>
    <Argument name="serializer" type="_8886" location="f10:338" file="f10" line="338"/>
  </Method>
  <PointerType id="_1926" type="_978" size="64" align="64"/>
  <Field id="_1927" name="m_overlappingPairArray" type="_827" offset="64" context="_25" access="private" location="f14:390" file="f14" line="390"/>
  <OperatorMethod id="_1928" name="=" returns="_8925" artificial="1" context="_25" access="public" mangled="_ZN15btNullPairCacheaSERKS_" demangled="btNullPairCache::operator=(btNullPairCache const&amp;)" location="f14:388" file="f14" line="388" endline="388" inline="1">
    <Argument type="_8926" location="f14:388" file="f14" line="388"/>
  </OperatorMethod>
  <Constructor id="_1929" name="btNullPairCache" artificial="1" context="_25" access="public" mangled="_ZN15btNullPairCacheC1ERKS_ *INTERNAL* " demangled="btNullPairCache::btNullPairCache(btNullPairCache const&amp;)" location="f14:388" file="f14" line="388" endline="388" inline="1">
    <Argument type="_8926" location="f14:388" file="f14" line="388"/>
  </Constructor>
  <Constructor id="_1930" name="btNullPairCache" artificial="1" context="_25" access="public" mangled="_ZN15btNullPairCacheC1Ev *INTERNAL* " demangled="btNullPairCache::btNullPairCache()" location="f14:388" file="f14" line="388" endline="388" inline="1"/>
  <Method id="_1931" name="getOverlappingPairArrayPtr" returns="_4385" virtual="1" overrides="_5668 " context="_25" access="public" mangled="_ZN15btNullPairCache26getOverlappingPairArrayPtrEv" demangled="btNullPairCache::getOverlappingPairArrayPtr()" location="f14:394" file="f14" line="394" endline="396" inline="1"/>
  <Method id="_1932" name="getOverlappingPairArrayPtr" returns="_4381" const="1" virtual="1" overrides="_5669 " context="_25" access="public" mangled="_ZNK15btNullPairCache26getOverlappingPairArrayPtrEv" demangled="btNullPairCache::getOverlappingPairArrayPtr() const" location="f14:398" file="f14" line="398" endline="400" inline="1"/>
  <Method id="_1933" name="getOverlappingPairArray" returns="_8927" virtual="1" overrides="_5670 " context="_25" access="public" mangled="_ZN15btNullPairCache23getOverlappingPairArrayEv" demangled="btNullPairCache::getOverlappingPairArray()" location="f14:402" file="f14" line="402" endline="404" inline="1"/>
  <Method id="_1934" name="cleanOverlappingPair" returns="_635" virtual="1" overrides="_5671 " context="_25" access="public" mangled="_ZN15btNullPairCache20cleanOverlappingPairER16btBroadphasePairP12btDispatcher" demangled="btNullPairCache::cleanOverlappingPair(btBroadphasePair&amp;, btDispatcher*)" location="f14:407" file="f14" line="407" inline="1">
    <Argument type="_4387" location="f14:407" file="f14" line="407"/>
    <Argument type="_8928" location="f14:407" file="f14" line="407"/>
  </Method>
  <Method id="_1935" name="getNumOverlappingPairs" returns="_168" const="1" virtual="1" overrides="_5672 " context="_25" access="public" mangled="_ZNK15btNullPairCache22getNumOverlappingPairsEv" demangled="btNullPairCache::getNumOverlappingPairs() const" location="f14:412" file="f14" line="412" endline="414" inline="1"/>
  <Method id="_1936" name="cleanProxyFromPairs" returns="_635" virtual="1" overrides="_5673 " context="_25" access="public" mangled="_ZN15btNullPairCache19cleanProxyFromPairsEP17btBroadphaseProxyP12btDispatcher" demangled="btNullPairCache::cleanProxyFromPairs(btBroadphaseProxy*, btDispatcher*)" location="f14:417" file="f14" line="417" inline="1">
    <Argument type="_8929" location="f14:417" file="f14" line="417"/>
    <Argument type="_8928" location="f14:417" file="f14" line="417"/>
  </Method>
  <Method id="_1937" name="setOverlapFilterCallback" returns="_635" virtual="1" overrides="_5674 " context="_25" access="public" mangled="_ZN15btNullPairCache24setOverlapFilterCallbackEP23btOverlapFilterCallback" demangled="btNullPairCache::setOverlapFilterCallback(btOverlapFilterCallback*)" location="f14:422" file="f14" line="422" inline="1">
    <Argument type="_8930" location="f14:422" file="f14" line="422"/>
  </Method>
  <Method id="_1938" name="processAllOverlappingPairs" returns="_635" virtual="1" overrides="_5675 " context="_25" access="public" mangled="_ZN15btNullPairCache26processAllOverlappingPairsEP17btOverlapCallbackP12btDispatcher" demangled="btNullPairCache::processAllOverlappingPairs(btOverlapCallback*, btDispatcher*)" location="f14:426" file="f14" line="426" inline="1">
    <Argument type="_8931" location="f14:426" file="f14" line="426"/>
    <Argument type="_8928" location="f14:426" file="f14" line="426"/>
  </Method>
  <Method id="_1939" name="findPair" returns="_4385" virtual="1" overrides="_5676 " context="_25" access="public" mangled="_ZN15btNullPairCache8findPairEP17btBroadphaseProxyS1_" demangled="btNullPairCache::findPair(btBroadphaseProxy*, btBroadphaseProxy*)" location="f14:430" file="f14" line="430" endline="432" inline="1">
    <Argument type="_8929" location="f14:430" file="f14" line="430"/>
    <Argument type="_8929" location="f14:430" file="f14" line="430"/>
  </Method>
  <Method id="_1940" name="hasDeferredRemoval" returns="_1834" virtual="1" overrides="_5677 " context="_25" access="public" mangled="_ZN15btNullPairCache18hasDeferredRemovalEv" demangled="btNullPairCache::hasDeferredRemoval()" location="f14:435" file="f14" line="435" endline="437" inline="1"/>
  <Method id="_1941" name="setInternalGhostPairCallback" returns="_635" virtual="1" overrides="_5678 " context="_25" access="public" mangled="_ZN15btNullPairCache28setInternalGhostPairCallbackEP25btOverlappingPairCallback" demangled="btNullPairCache::setInternalGhostPairCallback(btOverlappingPairCallback*)" location="f14:440" file="f14" line="440" inline="1">
    <Argument type="_8932" location="f14:440" file="f14" line="440"/>
  </Method>
  <Method id="_1942" name="addOverlappingPair" returns="_4385" virtual="1" overrides="_6897 " context="_25" access="public" mangled="_ZN15btNullPairCache18addOverlappingPairEP17btBroadphaseProxyS1_" demangled="btNullPairCache::addOverlappingPair(btBroadphaseProxy*, btBroadphaseProxy*)" location="f14:445" file="f14" line="445" endline="447" inline="1">
    <Argument type="_8929" location="f14:445" file="f14" line="445"/>
    <Argument type="_8929" location="f14:445" file="f14" line="445"/>
  </Method>
  <Method id="_1943" name="removeOverlappingPair" returns="_1077" virtual="1" overrides="_6898 " context="_25" access="public" mangled="_ZN15btNullPairCache21removeOverlappingPairEP17btBroadphaseProxyS1_P12btDispatcher" demangled="btNullPairCache::removeOverlappingPair(btBroadphaseProxy*, btBroadphaseProxy*, btDispatcher*)" location="f14:450" file="f14" line="450" endline="452" inline="1">
    <Argument type="_8929" location="f14:450" file="f14" line="450"/>
    <Argument type="_8929" location="f14:450" file="f14" line="450"/>
    <Argument type="_8928" location="f14:450" file="f14" line="450"/>
  </Method>
  <Method id="_1944" name="removeOverlappingPairsContainingProxy" returns="_635" virtual="1" overrides="_6899 " context="_25" access="public" mangled="_ZN15btNullPairCache37removeOverlappingPairsContainingProxyEP17btBroadphaseProxyP12btDispatcher" demangled="btNullPairCache::removeOverlappingPairsContainingProxy(btBroadphaseProxy*, btDispatcher*)" location="f14:455" file="f14" line="455" inline="1">
    <Argument type="_8929" location="f14:455" file="f14" line="455"/>
    <Argument type="_8928" location="f14:455" file="f14" line="455"/>
  </Method>
  <Method id="_1945" name="sortOverlappingPairs" returns="_635" virtual="1" overrides="_5679 " context="_25" access="public" mangled="_ZN15btNullPairCache20sortOverlappingPairsEP12btDispatcher" demangled="btNullPairCache::sortOverlappingPairs(btDispatcher*)" location="f14:459" file="f14" line="459" inline="1">
    <Argument name="dispatcher" type="_8928" location="f14:459" file="f14" line="459"/>
  </Method>
  <Destructor id="_1946" name="btNullPairCache" virtual="1" overrides="_5667 " artificial="1" context="_25" access="public" mangled="_ZN15btNullPairCacheD1Ev *INTERNAL* " demangled="btNullPairCache::~btNullPairCache()" location="f14:388" file="f14" line="388" endline="388" inline="1">
  </Destructor>
  <Field id="_1948" name="m_transform" type="_1468" offset="0" context="_29" access="public" location="f16:181" file="f16" line="181"/>
  <Field id="_1949" name="m_childShape" type="_8933" offset="512" context="_29" access="public" location="f16:182" file="f16" line="182"/>
  <Field id="_1950" name="m_childShapeType" type="_168" offset="576" context="_29" access="public" location="f16:183" file="f16" line="183"/>
  <Field id="_1951" name="m_childMargin" type="_361" offset="608" context="_29" access="public" location="f16:184" file="f16" line="184"/>
  <Destructor id="_1952" name="btCompoundShapeChildData" artificial="1" throw="" context="_29" access="public" mangled="_ZN24btCompoundShapeChildDataD1Ev *INTERNAL* " demangled="btCompoundShapeChildData::~btCompoundShapeChildData()" location="f16:180" file="f16" line="180" endline="180" inline="1">
  </Destructor>
  <OperatorMethod id="_1953" name="=" returns="_8934" artificial="1" throw="" context="_29" access="public" mangled="_ZN24btCompoundShapeChildDataaSERKS_" demangled="btCompoundShapeChildData::operator=(btCompoundShapeChildData const&amp;)" location="f16:180" file="f16" line="180" endline="180" inline="1">
    <Argument type="_8935" location="f16:180" file="f16" line="180"/>
  </OperatorMethod>
  <Constructor id="_1954" name="btCompoundShapeChildData" artificial="1" throw="" context="_29" access="public" mangled="_ZN24btCompoundShapeChildDataC1ERKS_ *INTERNAL* " demangled="btCompoundShapeChildData::btCompoundShapeChildData(btCompoundShapeChildData const&amp;)" location="f16:180" file="f16" line="180" endline="180" inline="1">
    <Argument type="_8935" location="f16:180" file="f16" line="180"/>
  </Constructor>
  <Constructor id="_1955" name="btCompoundShapeChildData" artificial="1" throw="" context="_29" access="public" mangled="_ZN24btCompoundShapeChildDataC1Ev *INTERNAL* " demangled="btCompoundShapeChildData::btCompoundShapeChildData()" location="f16:180" file="f16" line="180" inline="1"/>
  <CvQualifiedType id="_1823r" type="_1823" restrict="1"/>
  <PointerType id="_1957" type="_3466" size="64" align="64"/>
  <Field id="_1958" name="fptr" type="_5878" offset="0" context="_31" access="public" location="f13:345" file="f13" line="345"/>
  <Field id="_1959" name="rptr" type="_5878" offset="64" context="_31" access="public" location="f13:346" file="f13" line="346"/>
  <Field id="_1960" name="state" type="_5878" offset="128" context="_31" access="public" location="f13:347" file="f13" line="347"/>
  <Field id="_1961" name="rand_type" type="_168" offset="192" context="_31" access="public" location="f13:348" file="f13" line="348"/>
  <Field id="_1962" name="rand_deg" type="_168" offset="224" context="_31" access="public" location="f13:349" file="f13" line="349"/>
  <Field id="_1963" name="rand_sep" type="_168" offset="256" context="_31" access="public" location="f13:350" file="f13" line="350"/>
  <Field id="_1964" name="end_ptr" type="_5878" offset="320" context="_31" access="public" location="f13:351" file="f13" line="351"/>
  <Destructor id="_1965" name="random_data" artificial="1" throw="" context="_31" access="public" mangled="_ZN11random_dataD1Ev *INTERNAL* " demangled="random_data::~random_data()" location="f13:344" file="f13" line="344" endline="344" inline="1">
  </Destructor>
  <OperatorMethod id="_1966" name="=" returns="_8936" artificial="1" throw="" context="_31" access="public" mangled="_ZN11random_dataaSERKS_" demangled="random_data::operator=(random_data const&amp;)" location="f13:344" file="f13" line="344" endline="344" inline="1">
    <Argument type="_8937" location="f13:344" file="f13" line="344"/>
  </OperatorMethod>
  <Constructor id="_1967" name="random_data" artificial="1" throw="" context="_31" access="public" mangled="_ZN11random_dataC1ERKS_ *INTERNAL* " demangled="random_data::random_data(random_data const&amp;)" location="f13:344" file="f13" line="344" endline="344" inline="1">
    <Argument type="_8937" location="f13:344" file="f13" line="344"/>
  </Constructor>
  <Constructor id="_1968" name="random_data" artificial="1" throw="" context="_31" access="public" mangled="_ZN11random_dataC1Ev *INTERNAL* " demangled="random_data::random_data()" location="f13:344" file="f13" line="344" inline="1"/>
  <FundamentalType id="_1969" name="wchar_t" size="32" align="32"/>
  <PointerType id="_1970" type="_168" size="64" align="64"/>
  <FundamentalType id="_1971" name="long long int" size="64" align="64"/>
  <PointerType id="_1972" type="_1071" size="64" align="64"/>
  <CvQualifiedType id="_1972r" type="_1972" restrict="1"/>
  <FundamentalType id="_1974" name="complex float" size="64" align="32"/>
  <FundamentalType id="_1975" name="complex long double" size="256" align="128"/>
  <OperatorMethod id="_1976" name="=" returns="_8938" artificial="1" throw="" context="_44" access="public" mangled="_ZN17bt32BitAxisSweep3aSERKS_" demangled="bt32BitAxisSweep3::operator=(bt32BitAxisSweep3 const&amp;)" location="f21:1043" file="f21" line="1043" endline="1043" inline="1">
    <Argument type="_8939" location="f21:1043" file="f21" line="1043"/>
  </OperatorMethod>
  <Constructor id="_1977" name="bt32BitAxisSweep3" artificial="1" throw="" context="_44" access="public" mangled="_ZN17bt32BitAxisSweep3C1ERKS_ *INTERNAL* " demangled="bt32BitAxisSweep3::bt32BitAxisSweep3(bt32BitAxisSweep3 const&amp;)" location="f21:1043" file="f21" line="1043" endline="1043" inline="1">
    <Argument type="_8939" location="f21:1043" file="f21" line="1043"/>
  </Constructor>
  <Constructor id="_1978" name="bt32BitAxisSweep3" explicit="1" context="_44" access="public" mangled="_ZN17bt32BitAxisSweep3C1ERK9btVector3S2_jP22btOverlappingPairCacheb *INTERNAL* " demangled="bt32BitAxisSweep3::bt32BitAxisSweep3(btVector3 const&amp;, btVector3 const&amp;, unsigned int, btOverlappingPairCache*, bool)" location="f21:1046" file="f21" line="1046" extern="1">
    <Argument name="worldAabbMin" type="_1824" location="f21:1046" file="f21" line="1046"/>
    <Argument name="worldAabbMax" type="_1824" location="f21:1046" file="f21" line="1046"/>
    <Argument name="maxHandles" type="_85" location="f21:1046" file="f21" line="1046" default="1500000"/>
    <Argument name="pairCache" type="_8940" location="f21:1046" file="f21" line="1046" default="0"/>
    <Argument name="disableRaycastAccelerator" type="_1834" location="f21:1046" file="f21" line="1046" default="false"/>
  </Constructor>
  <Destructor id="_1979" name="bt32BitAxisSweep3" virtual="1" overrides="_8611 " artificial="1" context="_44" access="public" mangled="_ZN17bt32BitAxisSweep3D1Ev *INTERNAL* " demangled="bt32BitAxisSweep3::~bt32BitAxisSweep3()" location="f21:1043" file="f21" line="1043" endline="1043" inline="1">
  </Destructor>
  <CvQualifiedType id="_1071r" type="_1071" restrict="1"/>
  <Field id="_1981" name="__size" type="_8881" offset="0" context="_50" access="public" location="f22:157" file="f22" line="157"/>
  <Field id="_1982" name="__align" type="_168" offset="0" context="_50" access="public" location="f22:158" file="f22" line="158"/>
  <Destructor id="_1983" name="._16" artificial="1" throw="" context="_50" access="public" mangled="_ZN18pthread_condattr_tD1Ev *INTERNAL* " demangled="pthread_condattr_t::~pthread_condattr_t()" location="f22:159" file="f22" line="159" endline="159" inline="1">
  </Destructor>
  <OperatorMethod id="_1984" name="=" returns="_8941" artificial="1" throw="" context="_50" access="public" mangled="_ZN18pthread_condattr_taSERKS_" demangled="pthread_condattr_t::operator=(pthread_condattr_t const&amp;)" location="f22:159" file="f22" line="159" endline="159" inline="1">
    <Argument type="_8942" location="f22:156" file="f22" line="156"/>
  </OperatorMethod>
  <Constructor id="_1985" name="._16" artificial="1" throw="" context="_50" access="public" mangled="_ZN18pthread_condattr_tC1ERKS_ *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t(pthread_condattr_t const&amp;)" location="f22:159" file="f22" line="159" endline="159" inline="1">
    <Argument type="_8942" location="f22:156" file="f22" line="156"/>
  </Constructor>
  <Constructor id="_1986" name="._16" artificial="1" throw="" context="_50" access="public" mangled="_ZN18pthread_condattr_tC1Ev *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t()" location="f22:159" file="f22" line="159" inline="1"/>
  <Field id="_1987" name="m_convexInternalShapeData" type="_1344" offset="0" context="_55" access="public" location="f24:85" file="f24" line="85"/>
  <Field id="_1988" name="m_localPositionArrayPtr" type="_8943" offset="448" context="_55" access="public" location="f24:87" file="f24" line="87"/>
  <Field id="_1989" name="m_localPositionArraySize" type="_168" offset="512" context="_55" access="public" location="f24:88" file="f24" line="88"/>
  <Field id="_1990" name="m_padding" type="_8881" offset="544" context="_55" access="public" location="f24:89" file="f24" line="89"/>
  <Destructor id="_1991" name="btMultiSphereShapeData" artificial="1" throw="" context="_55" access="public" mangled="_ZN22btMultiSphereShapeDataD1Ev *INTERNAL* " demangled="btMultiSphereShapeData::~btMultiSphereShapeData()" location="f24:84" file="f24" line="84" endline="84" inline="1">
  </Destructor>
  <OperatorMethod id="_1992" name="=" returns="_8944" artificial="1" throw="" context="_55" access="public" mangled="_ZN22btMultiSphereShapeDataaSERKS_" demangled="btMultiSphereShapeData::operator=(btMultiSphereShapeData const&amp;)" location="f24:84" file="f24" line="84" endline="84" inline="1">
    <Argument type="_8945" location="f24:84" file="f24" line="84"/>
  </OperatorMethod>
  <Constructor id="_1993" name="btMultiSphereShapeData" artificial="1" throw="" context="_55" access="public" mangled="_ZN22btMultiSphereShapeDataC1ERKS_ *INTERNAL* " demangled="btMultiSphereShapeData::btMultiSphereShapeData(btMultiSphereShapeData const&amp;)" location="f24:84" file="f24" line="84" endline="84" inline="1">
    <Argument type="_8945" location="f24:84" file="f24" line="84"/>
  </Constructor>
  <Constructor id="_1994" name="btMultiSphereShapeData" artificial="1" throw="" context="_55" access="public" mangled="_ZN22btMultiSphereShapeDataC1Ev *INTERNAL* " demangled="btMultiSphereShapeData::btMultiSphereShapeData()" location="f24:84" file="f24" line="84" inline="1"/>
  <Field id="_1995" name="m_transform" type="_485" offset="0" context="_56" access="public" location="f16:34" file="f16" line="34"/>
  <Field id="_1996" name="m_childShape" type="_8946" offset="512" context="_56" access="public" location="f16:35" file="f16" line="35"/>
  <Field id="_1997" name="m_childShapeType" type="_168" offset="576" context="_56" access="public" location="f16:36" file="f16" line="36"/>
  <Field id="_1998" name="m_childMargin" type="_362" offset="608" context="_56" access="public" location="f16:37" file="f16" line="37"/>
  <Field id="_1999" name="m_node" type="_8947" offset="640" context="_56" access="public" location="f16:38" file="f16" line="38"/>
  <Destructor id="_2000" name="btCompoundShapeChild" artificial="1" throw="" context="_56" access="public" mangled="_ZN20btCompoundShapeChildD1Ev *INTERNAL* " demangled="btCompoundShapeChild::~btCompoundShapeChild()" location="f16:31" file="f16" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_2001" name="=" returns="_3955" artificial="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildaSERKS_" demangled="btCompoundShapeChild::operator=(btCompoundShapeChild const&amp;)" location="f16:31" file="f16" line="31" endline="31" inline="1">
    <Argument type="_3951" location="f16:31" file="f16" line="31"/>
  </OperatorMethod>
  <Constructor id="_2002" name="btCompoundShapeChild" artificial="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildC1ERKS_ *INTERNAL* " demangled="btCompoundShapeChild::btCompoundShapeChild(btCompoundShapeChild const&amp;)" location="f16:31" file="f16" line="31" endline="31" inline="1">
    <Argument type="_3951" location="f16:31" file="f16" line="31"/>
  </Constructor>
  <Constructor id="_2003" name="btCompoundShapeChild" artificial="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildC1Ev *INTERNAL* " demangled="btCompoundShapeChild::btCompoundShapeChild()" location="f16:31" file="f16" line="31" endline="31" inline="1"/>
  <OperatorMethod id="_2004" name="new" returns="_1077" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildnwEm" demangled="btCompoundShapeChild::operator new(unsigned long)" location="f16:32" file="f16" line="32" endline="32" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_2005" name="delete" returns="_635" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChilddlEPv" demangled="btCompoundShapeChild::operator delete(void*)" location="f16:32" file="f16" line="32" endline="32" inline="1">
    <Argument name="ptr" type="_1077" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_2006" name="new" returns="_1077" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildnwEmPv" demangled="btCompoundShapeChild::operator new(unsigned long, void*)" location="f16:32" file="f16" line="32" endline="32" inline="1">
    <Argument type="_1165" location="f16:32" file="f16" line="32"/>
    <Argument name="ptr" type="_1077" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_2007" name="delete" returns="_635" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChilddlEPvS0_" demangled="btCompoundShapeChild::operator delete(void*, void*)" location="f16:32" file="f16" line="32" inline="1">
    <Argument type="_1077" location="f16:32" file="f16" line="32"/>
    <Argument type="_1077" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_2008" name="new []" returns="_1077" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildnaEm" demangled="btCompoundShapeChild::operator new[](unsigned long)" location="f16:32" file="f16" line="32" endline="32" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_2009" name="delete []" returns="_635" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChilddaEPv" demangled="btCompoundShapeChild::operator delete[](void*)" location="f16:32" file="f16" line="32" endline="32" inline="1">
    <Argument name="ptr" type="_1077" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_2010" name="new []" returns="_1077" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildnaEmPv" demangled="btCompoundShapeChild::operator new[](unsigned long, void*)" location="f16:32" file="f16" line="32" endline="32" inline="1">
    <Argument type="_1165" location="f16:32" file="f16" line="32"/>
    <Argument name="ptr" type="_1077" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_2011" name="delete []" returns="_635" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChilddaEPvS0_" demangled="btCompoundShapeChild::operator delete[](void*, void*)" location="f16:32" file="f16" line="32" inline="1">
    <Argument type="_1077" location="f16:32" file="f16" line="32"/>
    <Argument type="_1077" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_2012" name="=" returns="_8948" artificial="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhaSERKS_" demangled="btOptimizedBvh::operator=(btOptimizedBvh const&amp;)" location="f25:28" file="f25" line="28" endline="28" inline="1">
    <Argument type="_8949" location="f25:28" file="f25" line="28"/>
  </OperatorMethod>
  <Constructor id="_2013" name="btOptimizedBvh" artificial="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhC1ERKS_ *INTERNAL* " demangled="btOptimizedBvh::btOptimizedBvh(btOptimizedBvh const&amp;)" location="f25:28" file="f25" line="28" endline="28" inline="1">
    <Argument type="_8949" location="f25:28" file="f25" line="28"/>
  </Constructor>
  <OperatorMethod id="_2014" name="new" returns="_1077" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhnwEm" demangled="btOptimizedBvh::operator new(unsigned long)" location="f25:31" file="f25" line="31" endline="31" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2015" name="delete" returns="_635" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhdlEPv" demangled="btOptimizedBvh::operator delete(void*)" location="f25:31" file="f25" line="31" endline="31" inline="1">
    <Argument name="ptr" type="_1077" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2016" name="new" returns="_1077" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhnwEmPv" demangled="btOptimizedBvh::operator new(unsigned long, void*)" location="f25:31" file="f25" line="31" endline="31" inline="1">
    <Argument type="_1165" location="f25:31" file="f25" line="31"/>
    <Argument name="ptr" type="_1077" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2017" name="delete" returns="_635" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhdlEPvS0_" demangled="btOptimizedBvh::operator delete(void*, void*)" location="f25:31" file="f25" line="31" inline="1">
    <Argument type="_1077" location="f25:31" file="f25" line="31"/>
    <Argument type="_1077" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2018" name="new []" returns="_1077" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhnaEm" demangled="btOptimizedBvh::operator new[](unsigned long)" location="f25:31" file="f25" line="31" endline="31" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2019" name="delete []" returns="_635" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhdaEPv" demangled="btOptimizedBvh::operator delete[](void*)" location="f25:31" file="f25" line="31" endline="31" inline="1">
    <Argument name="ptr" type="_1077" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2020" name="new []" returns="_1077" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhnaEmPv" demangled="btOptimizedBvh::operator new[](unsigned long, void*)" location="f25:31" file="f25" line="31" endline="31" inline="1">
    <Argument type="_1165" location="f25:31" file="f25" line="31"/>
    <Argument name="ptr" type="_1077" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2021" name="delete []" returns="_635" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhdaEPvS0_" demangled="btOptimizedBvh::operator delete[](void*, void*)" location="f25:31" file="f25" line="31" inline="1">
    <Argument type="_1077" location="f25:31" file="f25" line="31"/>
    <Argument type="_1077" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <Constructor id="_2022" name="btOptimizedBvh" explicit="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhC1Ev *INTERNAL* " demangled="btOptimizedBvh::btOptimizedBvh()" location="f25:37" file="f25" line="37" extern="1"/>
  <Destructor id="_2023" name="btOptimizedBvh" virtual="1" overrides="_4490 " context="_57" access="public" mangled="_ZN14btOptimizedBvhD1Ev *INTERNAL* " demangled="btOptimizedBvh::~btOptimizedBvh()" location="f25:39" file="f25" line="39" extern="1">
  </Destructor>
  <Method id="_2024" name="build" returns="_635" context="_57" access="public" mangled="_ZN14btOptimizedBvh5buildEP23btStridingMeshInterfacebRK9btVector3S4_" demangled="btOptimizedBvh::build(btStridingMeshInterface*, bool, btVector3 const&amp;, btVector3 const&amp;)" location="f25:41" file="f25" line="41" extern="1">
    <Argument name="triangles" type="_8950" location="f25:41" file="f25" line="41"/>
    <Argument name="useQuantizedAabbCompression" type="_1834" location="f25:41" file="f25" line="41"/>
    <Argument name="bvhAabbMin" type="_1824" location="f25:41" file="f25" line="41"/>
    <Argument name="bvhAabbMax" type="_1824" location="f25:41" file="f25" line="41"/>
  </Method>
  <Method id="_2025" name="refit" returns="_635" context="_57" access="public" mangled="_ZN14btOptimizedBvh5refitEP23btStridingMeshInterfaceRK9btVector3S4_" demangled="btOptimizedBvh::refit(btStridingMeshInterface*, btVector3 const&amp;, btVector3 const&amp;)" location="f25:43" file="f25" line="43" extern="1">
    <Argument name="triangles" type="_8950" location="f25:43" file="f25" line="43"/>
    <Argument name="aabbMin" type="_1824" location="f25:43" file="f25" line="43"/>
    <Argument name="aabbMax" type="_1824" location="f25:43" file="f25" line="43"/>
  </Method>
  <Method id="_2026" name="refitPartial" returns="_635" context="_57" access="public" mangled="_ZN14btOptimizedBvh12refitPartialEP23btStridingMeshInterfaceRK9btVector3S4_" demangled="btOptimizedBvh::refitPartial(btStridingMeshInterface*, btVector3 const&amp;, btVector3 const&amp;)" location="f25:45" file="f25" line="45" extern="1">
    <Argument name="triangles" type="_8950" location="f25:45" file="f25" line="45"/>
    <Argument name="aabbMin" type="_1824" location="f25:45" file="f25" line="45"/>
    <Argument name="aabbMax" type="_1824" location="f25:45" file="f25" line="45"/>
  </Method>
  <Method id="_2027" name="updateBvhNodes" returns="_635" context="_57" access="public" mangled="_ZN14btOptimizedBvh14updateBvhNodesEP23btStridingMeshInterfaceiii" demangled="btOptimizedBvh::updateBvhNodes(btStridingMeshInterface*, int, int, int)" location="f25:47" file="f25" line="47" extern="1">
    <Argument name="meshInterface" type="_8950" location="f25:47" file="f25" line="47"/>
    <Argument name="firstNode" type="_168" location="f25:47" file="f25" line="47"/>
    <Argument name="endNode" type="_168" location="f25:47" file="f25" line="47"/>
    <Argument name="index" type="_168" location="f25:47" file="f25" line="47"/>
  </Method>
  <Method id="_2028" name="serializeInPlace" returns="_1834" const="1" virtual="1" overrides="" context="_57" access="public" mangled="_ZNK14btOptimizedBvh16serializeInPlaceEPvjb" demangled="btOptimizedBvh::serializeInPlace(void*, unsigned int, bool) const" location="f25:50" file="f25" line="50" endline="52" inline="1">
    <Argument name="o_alignedDataBuffer" type="_1077" location="f25:50" file="f25" line="50"/>
    <Argument name="i_dataBufferSize" type="_85" location="f25:50" file="f25" line="50"/>
    <Argument name="i_swapEndian" type="_1834" location="f25:50" file="f25" line="50"/>
  </Method>
  <Method id="_2029" name="deSerializeInPlace" returns="_8951" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvh18deSerializeInPlaceEPvjb" demangled="btOptimizedBvh::deSerializeInPlace(void*, unsigned int, bool)" location="f25:57" file="f25" line="57" extern="1">
    <Argument name="i_alignedDataBuffer" type="_1077" location="f25:57" file="f25" line="57"/>
    <Argument name="i_dataBufferSize" type="_85" location="f25:57" file="f25" line="57"/>
    <Argument name="i_swapEndian" type="_1834" location="f25:57" file="f25" line="57"/>
  </Method>
  <Struct id="_2030" name="__class_type_info_pseudo" context="_1" mangled="24__class_type_info_pseudo" demangled="__class_type_info_pseudo" location="f132:0" file="f132" line="0" size="128" align="64" members=""/>
  <CvQualifiedType id="_2030c" type="_2030" const="1"/>
  <Field id="_2032" name="m_nextFree" type="_168" offset="480" context="_70" access="public" location="f32:25" file="f32" line="25"/>
  <Destructor id="_2033" name="btSimpleBroadphaseProxy" artificial="1" throw="" context="_70" access="public" mangled="_ZN23btSimpleBroadphaseProxyD1Ev *INTERNAL* " demangled="btSimpleBroadphaseProxy::~btSimpleBroadphaseProxy()" location="f32:24" file="f32" line="24" endline="24" inline="1">
  </Destructor>
  <OperatorMethod id="_2034" name="=" returns="_8952" artificial="1" throw="" context="_70" access="public" mangled="_ZN23btSimpleBroadphaseProxyaSERKS_" demangled="btSimpleBroadphaseProxy::operator=(btSimpleBroadphaseProxy const&amp;)" location="f32:24" file="f32" line="24" endline="24" inline="1">
    <Argument type="_8953" location="f32:24" file="f32" line="24"/>
  </OperatorMethod>
  <Constructor id="_2035" name="btSimpleBroadphaseProxy" artificial="1" throw="" context="_70" access="public" mangled="_ZN23btSimpleBroadphaseProxyC1ERKS_ *INTERNAL* " demangled="btSimpleBroadphaseProxy::btSimpleBroadphaseProxy(btSimpleBroadphaseProxy const&amp;)" location="f32:24" file="f32" line="24" endline="24" inline="1">
    <Argument type="_8953" location="f32:24" file="f32" line="24"/>
  </Constructor>
  <Constructor id="_2036" name="btSimpleBroadphaseProxy" explicit="1" context="_70" access="public" mangled="_ZN23btSimpleBroadphaseProxyC1Ev *INTERNAL* " demangled="btSimpleBroadphaseProxy::btSimpleBroadphaseProxy()" location="f32:30" file="f32" line="30" endline="30" inline="1"/>
  <Constructor id="_2037" name="btSimpleBroadphaseProxy" explicit="1" context="_70" access="public" mangled="_ZN23btSimpleBroadphaseProxyC1ERK9btVector3S2_iPvssS3_ *INTERNAL* " demangled="btSimpleBroadphaseProxy::btSimpleBroadphaseProxy(btVector3 const&amp;, btVector3 const&amp;, int, void*, short, short, void*)" location="f32:32" file="f32" line="32" endline="33" inline="1">
    <Argument name="minpt" type="_1824" location="f32:32" file="f32" line="32"/>
    <Argument name="maxpt" type="_1824" location="f32:32" file="f32" line="32"/>
    <Argument name="shapeType" type="_168" location="f32:32" file="f32" line="32"/>
    <Argument name="userPtr" type="_1077" location="f32:32" file="f32" line="32"/>
    <Argument name="collisionFilterGroup" type="_227" location="f32:32" file="f32" line="32"/>
    <Argument name="collisionFilterMask" type="_227" location="f32:32" file="f32" line="32"/>
    <Argument name="multiSapProxy" type="_1077" location="f32:32" file="f32" line="32"/>
  </Constructor>
  <Method id="_2038" name="SetNextFree" returns="_635" context="_70" access="public" mangled="_ZN23btSimpleBroadphaseProxy11SetNextFreeEi" demangled="btSimpleBroadphaseProxy::SetNextFree(int)" location="f32:39" file="f32" line="39" endline="39" inline="1">
    <Argument name="next" type="_168" location="f32:39" file="f32" line="39"/>
  </Method>
  <Method id="_2039" name="GetNextFree" returns="_168" const="1" context="_70" access="public" mangled="_ZNK23btSimpleBroadphaseProxy11GetNextFreeEv" demangled="btSimpleBroadphaseProxy::GetNextFree() const" location="f32:40" file="f32" line="40" endline="40" inline="1"/>
  <Struct id="_2040" name="btVehicleRaycasterResult" context="_72" access="public" mangled="N18btVehicleRaycaster24btVehicleRaycasterResultE" demangled="btVehicleRaycaster::btVehicleRaycasterResult" location="f33:23" file="f33" line="23" artificial="1" size="288" align="32" members="_8954 _8955 _8956 _8957 _8958 _8959 _8960 " bases=""/>
  <OperatorMethod id="_2041" name="=" returns="_8961" artificial="1" throw="" context="_72" access="public" mangled="_ZN18btVehicleRaycasteraSERKS_" demangled="btVehicleRaycaster::operator=(btVehicleRaycaster const&amp;)" location="f33:18" file="f33" line="18" endline="18" inline="1">
    <Argument type="_8962" location="f33:18" file="f33" line="18"/>
  </OperatorMethod>
  <Constructor id="_2042" name="btVehicleRaycaster" artificial="1" throw="" context="_72" access="public" mangled="_ZN18btVehicleRaycasterC1ERKS_ *INTERNAL* " demangled="btVehicleRaycaster::btVehicleRaycaster(btVehicleRaycaster const&amp;)" location="f33:18" file="f33" line="18" endline="18" inline="1">
    <Argument type="_8962" location="f33:18" file="f33" line="18"/>
  </Constructor>
  <Constructor id="_2043" name="btVehicleRaycaster" artificial="1" throw="" context="_72" access="public" mangled="_ZN18btVehicleRaycasterC1Ev *INTERNAL* " demangled="btVehicleRaycaster::btVehicleRaycaster()" location="f33:18" file="f33" line="18" endline="18" inline="1"/>
  <Destructor id="_2044" name="btVehicleRaycaster" virtual="1" overrides="" context="_72" access="public" mangled="_ZN18btVehicleRaycasterD1Ev *INTERNAL* " demangled="btVehicleRaycaster::~btVehicleRaycaster()" location="f33:19" file="f33" line="19" endline="21" inline="1">
  </Destructor>
  <Method id="_2045" name="castRay" returns="_1077" virtual="1" pure_virtual="1" overrides="" context="_72" access="public" mangled="_ZN18btVehicleRaycaster7castRayERK9btVector3S2_RNS_24btVehicleRaycasterResultE" demangled="btVehicleRaycaster::castRay(btVector3 const&amp;, btVector3 const&amp;, btVehicleRaycaster::btVehicleRaycasterResult&amp;)" location="f33:30" file="f33" line="30" extern="1">
    <Argument name="from" type="_1824" location="f33:30" file="f33" line="30"/>
    <Argument name="to" type="_1824" location="f33:30" file="f33" line="30"/>
    <Argument name="result" type="_8963" location="f33:30" file="f33" line="30"/>
  </Method>
  <PointerType id="_2046" type="_93" size="64" align="64"/>
  <CvQualifiedType id="_2046r" type="_2046" restrict="1"/>
  <PointerType id="_2048" type="_342" size="64" align="64"/>
  <Field id="_2049" name="quot" type="_168" offset="0" context="_79" access="public" location="f13:99" file="f13" line="99"/>
  <Field id="_2050" name="rem" type="_168" offset="32" context="_79" access="public" location="f13:100" file="f13" line="100"/>
  <Destructor id="_2051" name="._7" artificial="1" throw="" context="_79" access="public" mangled="_ZN5div_tD1Ev *INTERNAL* " demangled="div_t::~div_t()" location="f13:101" file="f13" line="101" endline="101" inline="1">
  </Destructor>
  <OperatorMethod id="_2052" name="=" returns="_8964" artificial="1" throw="" context="_79" access="public" mangled="_ZN5div_taSERKS_" demangled="div_t::operator=(div_t const&amp;)" location="f13:101" file="f13" line="101" endline="101" inline="1">
    <Argument type="_8965" location="f13:98" file="f13" line="98"/>
  </OperatorMethod>
  <Constructor id="_2053" name="._7" artificial="1" throw="" context="_79" access="public" mangled="_ZN5div_tC1ERKS_ *INTERNAL* " demangled="div_t::div_t(div_t const&amp;)" location="f13:101" file="f13" line="101" endline="101" inline="1">
    <Argument type="_8965" location="f13:98" file="f13" line="98"/>
  </Constructor>
  <Constructor id="_2054" name="._7" artificial="1" throw="" context="_79" access="public" mangled="_ZN5div_tC1Ev *INTERNAL* " demangled="div_t::div_t()" location="f13:101" file="f13" line="101" inline="1"/>
  <Field id="_2055" name="m_rootNodeIndex" type="_168" offset="0" context="_83" access="public" location="f35:505" file="f35" line="505"/>
  <Field id="_2056" name="m_subtreeSize" type="_168" offset="32" context="_83" access="public" location="f35:506" file="f35" line="506"/>
  <Field id="_2057" name="m_quantizedAabbMin" type="_8966" offset="64" context="_83" access="public" location="f35:507" file="f35" line="507"/>
  <Field id="_2058" name="m_quantizedAabbMax" type="_8966" offset="112" context="_83" access="public" location="f35:508" file="f35" line="508"/>
  <Destructor id="_2059" name="btBvhSubtreeInfoData" artificial="1" throw="" context="_83" access="public" mangled="_ZN20btBvhSubtreeInfoDataD1Ev *INTERNAL* " demangled="btBvhSubtreeInfoData::~btBvhSubtreeInfoData()" location="f35:504" file="f35" line="504" endline="504" inline="1">
  </Destructor>
  <OperatorMethod id="_2060" name="=" returns="_8967" artificial="1" throw="" context="_83" access="public" mangled="_ZN20btBvhSubtreeInfoDataaSERKS_" demangled="btBvhSubtreeInfoData::operator=(btBvhSubtreeInfoData const&amp;)" location="f35:504" file="f35" line="504" endline="504" inline="1">
    <Argument type="_8968" location="f35:504" file="f35" line="504"/>
  </OperatorMethod>
  <Constructor id="_2061" name="btBvhSubtreeInfoData" artificial="1" throw="" context="_83" access="public" mangled="_ZN20btBvhSubtreeInfoDataC1ERKS_ *INTERNAL* " demangled="btBvhSubtreeInfoData::btBvhSubtreeInfoData(btBvhSubtreeInfoData const&amp;)" location="f35:504" file="f35" line="504" endline="504" inline="1">
    <Argument type="_8968" location="f35:504" file="f35" line="504"/>
  </Constructor>
  <Constructor id="_2062" name="btBvhSubtreeInfoData" artificial="1" throw="" context="_83" access="public" mangled="_ZN20btBvhSubtreeInfoDataC1Ev *INTERNAL* " demangled="btBvhSubtreeInfoData::btBvhSubtreeInfoData()" location="f35:504" file="f35" line="504" inline="1"/>
  <Field id="_2063" name="m_axisInA" type="_193" offset="576" context="_88" access="protected" location="f37:39" file="f37" line="39"/>
  <Field id="_2064" name="m_axisInB" type="_193" offset="704" context="_88" access="protected" location="f37:40" file="f37" line="40"/>
  <Field id="_2065" name="m_useFrameA" type="_1834" offset="832" context="_88" access="protected" location="f37:41" file="f37" line="41"/>
  <Field id="_2066" name="m_ratio" type="_362" offset="864" context="_88" access="protected" location="f37:42" file="f37" line="42"/>
  <Constructor id="_2067" name="btGearConstraint" artificial="1" throw="" context="_88" access="public" mangled="_ZN16btGearConstraintC1ERKS_ *INTERNAL* " demangled="btGearConstraint::btGearConstraint(btGearConstraint const&amp;)" location="f37:37" file="f37" line="37" endline="37" inline="1">
    <Argument type="_8969" location="f37:37" file="f37" line="37"/>
  </Constructor>
  <Constructor id="_2068" name="btGearConstraint" explicit="1" context="_88" access="public" mangled="_ZN16btGearConstraintC1ER11btRigidBodyS1_RK9btVector3S4_f *INTERNAL* " demangled="btGearConstraint::btGearConstraint(btRigidBody&amp;, btRigidBody&amp;, btVector3 const&amp;, btVector3 const&amp;, float)" location="f37:45" file="f37" line="45" extern="1">
    <Argument name="rbA" type="_8891" location="f37:45" file="f37" line="45"/>
    <Argument name="rbB" type="_8891" location="f37:45" file="f37" line="45"/>
    <Argument name="axisInA" type="_1824" location="f37:45" file="f37" line="45"/>
    <Argument name="axisInB" type="_1824" location="f37:45" file="f37" line="45"/>
    <Argument name="ratio" type="_362" location="f37:45" file="f37" line="45" default="1.0e+0f"/>
  </Constructor>
  <Destructor id="_2069" name="btGearConstraint" virtual="1" overrides="_1885 " context="_88" access="public" mangled="_ZN16btGearConstraintD1Ev *INTERNAL* " demangled="btGearConstraint::~btGearConstraint()" location="f37:46" file="f37" line="46" extern="1">
  </Destructor>
  <Method id="_2070" name="getInfo1" returns="_635" virtual="1" overrides="_1893 " context="_88" access="public" mangled="_ZN16btGearConstraint8getInfo1EPN17btTypedConstraint17btConstraintInfo1E" demangled="btGearConstraint::getInfo1(btTypedConstraint::btConstraintInfo1*)" location="f37:49" file="f37" line="49" extern="1">
    <Argument name="info" type="_3699" location="f37:49" file="f37" line="49"/>
  </Method>
  <Method id="_2071" name="getInfo2" returns="_635" virtual="1" overrides="_1894 " context="_88" access="public" mangled="_ZN16btGearConstraint8getInfo2EPN17btTypedConstraint17btConstraintInfo2E" demangled="btGearConstraint::getInfo2(btTypedConstraint::btConstraintInfo2*)" location="f37:52" file="f37" line="52" extern="1">
    <Argument name="info" type="_8922" location="f37:52" file="f37" line="52"/>
  </Method>
  <Method id="_2072" name="setAxisA" returns="_635" context="_88" access="public" mangled="_ZN16btGearConstraint8setAxisAER9btVector3" demangled="btGearConstraint::setAxisA(btVector3&amp;)" location="f37:54" file="f37" line="54" endline="56" inline="1">
    <Argument name="axisA" type="_2535" location="f37:54" file="f37" line="54"/>
  </Method>
  <Method id="_2073" name="setAxisB" returns="_635" context="_88" access="public" mangled="_ZN16btGearConstraint8setAxisBER9btVector3" demangled="btGearConstraint::setAxisB(btVector3&amp;)" location="f37:58" file="f37" line="58" endline="60" inline="1">
    <Argument name="axisB" type="_2535" location="f37:58" file="f37" line="58"/>
  </Method>
  <Method id="_2074" name="setRatio" returns="_635" context="_88" access="public" mangled="_ZN16btGearConstraint8setRatioEf" demangled="btGearConstraint::setRatio(float)" location="f37:62" file="f37" line="62" endline="64" inline="1">
    <Argument name="ratio" type="_362" location="f37:62" file="f37" line="62"/>
  </Method>
  <Method id="_2075" name="getAxisA" returns="_1824" const="1" context="_88" access="public" mangled="_ZNK16btGearConstraint8getAxisAEv" demangled="btGearConstraint::getAxisA() const" location="f37:66" file="f37" line="66" endline="68" inline="1"/>
  <Method id="_2076" name="getAxisB" returns="_1824" const="1" context="_88" access="public" mangled="_ZNK16btGearConstraint8getAxisBEv" demangled="btGearConstraint::getAxisB() const" location="f37:70" file="f37" line="70" endline="72" inline="1"/>
  <Method id="_2077" name="getRatio" returns="_362" const="1" context="_88" access="public" mangled="_ZNK16btGearConstraint8getRatioEv" demangled="btGearConstraint::getRatio() const" location="f37:74" file="f37" line="74" endline="76" inline="1"/>
  <Method id="_2078" name="setParam" returns="_635" virtual="1" overrides="_1922 " context="_88" access="public" mangled="_ZN16btGearConstraint8setParamEifi" demangled="btGearConstraint::setParam(int, float, int)" location="f37:80" file="f37" line="80" inline="1">
    <Argument name="num" type="_168" location="f37:80" file="f37" line="80"/>
    <Argument name="value" type="_362" location="f37:80" file="f37" line="80"/>
    <Argument name="axis" type="_168" location="f37:80" file="f37" line="80" default="-0x00000000000000001"/>
  </Method>
  <Method id="_2079" name="getParam" returns="_362" const="1" virtual="1" overrides="_1923 " context="_88" access="public" mangled="_ZNK16btGearConstraint8getParamEii" demangled="btGearConstraint::getParam(int, int) const" location="f37:89" file="f37" line="89" endline="94" inline="1">
    <Argument name="num" type="_168" location="f37:89" file="f37" line="89"/>
    <Argument name="axis" type="_168" location="f37:89" file="f37" line="89" default="-0x00000000000000001"/>
  </Method>
  <Method id="_2080" name="calculateSerializeBufferSize" returns="_168" const="1" virtual="1" overrides="_1924 " context="_88" access="public" mangled="_ZNK16btGearConstraint28calculateSerializeBufferSizeEv" demangled="btGearConstraint::calculateSerializeBufferSize() const" location="f37:128" file="f37" line="128" endline="130" inline="1"/>
  <Method id="_2081" name="serialize" returns="_1823" const="1" virtual="1" overrides="_1925 " context="_88" access="public" mangled="_ZNK16btGearConstraint9serializeEPvP12btSerializer" demangled="btGearConstraint::serialize(void*, btSerializer*) const" location="f37:134" file="f37" line="134" endline="144" inline="1">
    <Argument name="dataBuffer" type="_1077" location="f37:134" file="f37" line="134"/>
    <Argument name="serializer" type="_8886" location="f37:134" file="f37" line="134"/>
  </Method>
  <PointerType id="_2082" type="_484" size="64" align="64"/>
  <Field id="_2083" name="m_invInertiaTensorWorld" type="_1258" offset="2336" context="_95" access="private" location="f38:62" file="f38" line="62"/>
  <Field id="_2084" name="m_linearVelocity" type="_193" offset="2720" context="_95" access="private" location="f38:63" file="f38" line="63"/>
  <Field id="_2085" name="m_angularVelocity" type="_193" offset="2848" context="_95" access="private" location="f38:64" file="f38" line="64"/>
  <Field id="_2086" name="m_inverseMass" type="_362" offset="2976" context="_95" access="private" location="f38:65" file="f38" line="65"/>
  <Field id="_2087" name="m_linearFactor" type="_193" offset="3008" context="_95" access="private" location="f38:66" file="f38" line="66"/>
  <Field id="_2088" name="m_gravity" type="_193" offset="3136" context="_95" access="private" location="f38:68" file="f38" line="68"/>
  <Field id="_2089" name="m_gravity_acceleration" type="_193" offset="3264" context="_95" access="private" location="f38:69" file="f38" line="69"/>
  <Field id="_2090" name="m_invInertiaLocal" type="_193" offset="3392" context="_95" access="private" location="f38:70" file="f38" line="70"/>
  <Field id="_2091" name="m_totalForce" type="_193" offset="3520" context="_95" access="private" location="f38:71" file="f38" line="71"/>
  <Field id="_2092" name="m_totalTorque" type="_193" offset="3648" context="_95" access="private" location="f38:72" file="f38" line="72"/>
  <Field id="_2093" name="m_linearDamping" type="_362" offset="3776" context="_95" access="private" location="f38:74" file="f38" line="74"/>
  <Field id="_2094" name="m_angularDamping" type="_362" offset="3808" context="_95" access="private" location="f38:75" file="f38" line="75"/>
  <Field id="_2095" name="m_additionalDamping" type="_1834" offset="3840" context="_95" access="private" location="f38:77" file="f38" line="77"/>
  <Field id="_2096" name="m_additionalDampingFactor" type="_362" offset="3872" context="_95" access="private" location="f38:78" file="f38" line="78"/>
  <Field id="_2097" name="m_additionalLinearDampingThresholdSqr" type="_362" offset="3904" context="_95" access="private" location="f38:79" file="f38" line="79"/>
  <Field id="_2098" name="m_additionalAngularDampingThresholdSqr" type="_362" offset="3936" context="_95" access="private" location="f38:80" file="f38" line="80"/>
  <Field id="_2099" name="m_additionalAngularDampingFactor" type="_362" offset="3968" context="_95" access="private" location="f38:81" file="f38" line="81"/>
  <Field id="_2100" name="m_linearSleepingThreshold" type="_362" offset="4000" context="_95" access="private" location="f38:84" file="f38" line="84"/>
  <Field id="_2101" name="m_angularSleepingThreshold" type="_362" offset="4032" context="_95" access="private" location="f38:85" file="f38" line="85"/>
  <Field id="_2102" name="m_optionalMotionState" type="_8970" offset="4096" context="_95" access="private" location="f38:88" file="f38" line="88"/>
  <Field id="_2103" name="m_constraintRefs" type="_1544" offset="4160" context="_95" access="private" location="f38:91" file="f38" line="91"/>
  <Field id="_2104" name="m_rigidbodyFlags" type="_168" offset="4416" context="_95" access="private" location="f38:93" file="f38" line="93"/>
  <Field id="_2105" name="m_debugBodyId" type="_168" offset="4448" context="_95" access="private" location="f38:95" file="f38" line="95"/>
  <Field id="_2106" name="m_deltaLinearVelocity" type="_193" offset="4480" context="_95" access="protected" location="f38:100" file="f38" line="100"/>
  <Field id="_2107" name="m_deltaAngularVelocity" type="_193" offset="4608" context="_95" access="protected" location="f38:101" file="f38" line="101"/>
  <Field id="_2108" name="m_angularFactor" type="_193" offset="4736" context="_95" access="protected" location="f38:102" file="f38" line="102"/>
  <Field id="_2109" name="m_invMass" type="_193" offset="4864" context="_95" access="protected" location="f38:103" file="f38" line="103"/>
  <Field id="_2110" name="m_pushVelocity" type="_193" offset="4992" context="_95" access="protected" location="f38:104" file="f38" line="104"/>
  <Field id="_2111" name="m_turnVelocity" type="_193" offset="5120" context="_95" access="protected" location="f38:105" file="f38" line="105"/>
  <Field id="_2112" name="m_contactSolverType" type="_168" offset="5248" context="_95" access="public" location="f38:484" file="f38" line="484"/>
  <Field id="_2113" name="m_frictionSolverType" type="_168" offset="5280" context="_95" access="public" location="f38:485" file="f38" line="485"/>
  <Struct id="_2114" name="btRigidBodyConstructionInfo" context="_95" access="public" mangled="N11btRigidBody27btRigidBodyConstructionInfoE" demangled="btRigidBody::btRigidBodyConstructionInfo" location="f38:117" file="f38" line="117" artificial="1" size="1216" align="64" members="_8971 _8972 _8973 _8974 _8975 _8976 _8977 _8978 _8979 _8980 _8981 _8982 _8983 _8984 _8985 _8986 _8987 _8988 _8989 _8990 _8991 " bases=""/>
  <OperatorMethod id="_2115" name="=" returns="_8891" artificial="1" context="_95" access="public" mangled="_ZN11btRigidBodyaSERKS_" demangled="btRigidBody::operator=(btRigidBody const&amp;)" location="f38:60" file="f38" line="60" endline="60" inline="1">
    <Argument type="_8923" location="f38:60" file="f38" line="60"/>
  </OperatorMethod>
  <Constructor id="_2116" name="btRigidBody" artificial="1" context="_95" access="public" mangled="_ZN11btRigidBodyC1ERKS_ *INTERNAL* " demangled="btRigidBody::btRigidBody(btRigidBody const&amp;)" location="f38:60" file="f38" line="60" endline="60" inline="1">
    <Argument type="_8923" location="f38:60" file="f38" line="60"/>
  </Constructor>
  <Constructor id="_2117" name="btRigidBody" context="_95" access="public" mangled="_ZN11btRigidBodyC1ERKNS_27btRigidBodyConstructionInfoE *INTERNAL* " demangled="btRigidBody::btRigidBody(btRigidBody::btRigidBodyConstructionInfo const&amp;)" location="f38:172" file="f38" line="172" extern="1">
    <Argument name="constructionInfo" type="_8992" location="f38:172" file="f38" line="172"/>
  </Constructor>
  <Constructor id="_2118" name="btRigidBody" explicit="1" context="_95" access="public" mangled="_ZN11btRigidBodyC1EfP13btMotionStateP16btCollisionShapeRK9btVector3 *INTERNAL* " demangled="btRigidBody::btRigidBody(float, btMotionState*, btCollisionShape*, btVector3 const&amp;)" location="f38:176" file="f38" line="176" extern="1">
    <Argument name="mass" type="_362" location="f38:176" file="f38" line="176"/>
    <Argument name="motionState" type="_8970" location="f38:176" file="f38" line="176"/>
    <Argument name="collisionShape" type="_8946" location="f38:176" file="f38" line="176"/>
    <Argument name="localInertia" type="_1824" location="f38:176" file="f38" line="176" default="btVector3(((const btScalar&amp;)((const btScalar*)(&amp;0.0))), ((const btScalar&amp;)((const btScalar*)(&amp;0.0))), ((const btScalar&amp;)((const btScalar*)(&amp;0.0))))"/>
  </Constructor>
  <Destructor id="_2119" name="btRigidBody" virtual="1" overrides="_6786 " context="_95" access="public" mangled="_ZN11btRigidBodyD1Ev *INTERNAL* " demangled="btRigidBody::~btRigidBody()" location="f38:179" file="f38" line="179" endline="184" inline="1">
  </Destructor>
  <Method id="_2120" name="setupRigidBody" returns="_635" context="_95" access="protected" mangled="_ZN11btRigidBody14setupRigidBodyERKNS_27btRigidBodyConstructionInfoE" demangled="btRigidBody::setupRigidBody(btRigidBody::btRigidBodyConstructionInfo const&amp;)" location="f38:189" file="f38" line="189" extern="1">
    <Argument name="constructionInfo" type="_8992" location="f38:189" file="f38" line="189"/>
  </Method>
  <Method id="_2121" name="proceedToTransform" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody18proceedToTransformERK11btTransform" demangled="btRigidBody::proceedToTransform(btTransform const&amp;)" location="f38:193" file="f38" line="193" extern="1">
    <Argument name="newTrans" type="_6975" location="f38:193" file="f38" line="193"/>
  </Method>
  <Method id="_2122" name="upcast" returns="_8993" static="1" context="_95" access="public" mangled="_ZN11btRigidBody6upcastEPK17btCollisionObject" demangled="btRigidBody::upcast(btCollisionObject const*)" location="f38:197" file="f38" line="197" endline="201" inline="1">
    <Argument name="colObj" type="_4331" location="f38:197" file="f38" line="197"/>
  </Method>
  <Method id="_2123" name="upcast" returns="_3780" static="1" context="_95" access="public" mangled="_ZN11btRigidBody6upcastEP17btCollisionObject" demangled="btRigidBody::upcast(btCollisionObject*)" location="f38:203" file="f38" line="203" endline="207" inline="1">
    <Argument name="colObj" type="_4351" location="f38:203" file="f38" line="203"/>
  </Method>
  <Method id="_2124" name="predictIntegratedTransform" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody26predictIntegratedTransformEfR11btTransform" demangled="btRigidBody::predictIntegratedTransform(float, btTransform&amp;)" location="f38:211" file="f38" line="211" extern="1">
    <Argument name="step" type="_362" location="f38:211" file="f38" line="211"/>
    <Argument name="predictedTransform" type="_8994" location="f38:211" file="f38" line="211"/>
  </Method>
  <Method id="_2125" name="saveKinematicState" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody18saveKinematicStateEf" demangled="btRigidBody::saveKinematicState(float)" location="f38:213" file="f38" line="213" extern="1">
    <Argument name="step" type="_362" location="f38:213" file="f38" line="213"/>
  </Method>
  <Method id="_2126" name="applyGravity" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody12applyGravityEv" demangled="btRigidBody::applyGravity()" location="f38:215" file="f38" line="215" extern="1"/>
  <Method id="_2127" name="setGravity" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody10setGravityERK9btVector3" demangled="btRigidBody::setGravity(btVector3 const&amp;)" location="f38:217" file="f38" line="217" extern="1">
    <Argument name="acceleration" type="_1824" location="f38:217" file="f38" line="217"/>
  </Method>
  <Method id="_2128" name="getGravity" returns="_1824" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody10getGravityEv" demangled="btRigidBody::getGravity() const" location="f38:219" file="f38" line="219" endline="221" inline="1"/>
  <Method id="_2129" name="setDamping" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody10setDampingEff" demangled="btRigidBody::setDamping(float, float)" location="f38:224" file="f38" line="224" extern="1">
    <Argument name="lin_damping" type="_362" location="f38:224" file="f38" line="224"/>
    <Argument name="ang_damping" type="_362" location="f38:224" file="f38" line="224"/>
  </Method>
  <Method id="_2130" name="getLinearDamping" returns="_362" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody16getLinearDampingEv" demangled="btRigidBody::getLinearDamping() const" location="f38:226" file="f38" line="226" endline="228" inline="1"/>
  <Method id="_2131" name="getAngularDamping" returns="_362" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody17getAngularDampingEv" demangled="btRigidBody::getAngularDamping() const" location="f38:231" file="f38" line="231" endline="233" inline="1"/>
  <Method id="_2132" name="getLinearSleepingThreshold" returns="_362" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody26getLinearSleepingThresholdEv" demangled="btRigidBody::getLinearSleepingThreshold() const" location="f38:236" file="f38" line="236" endline="238" inline="1"/>
  <Method id="_2133" name="getAngularSleepingThreshold" returns="_362" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody27getAngularSleepingThresholdEv" demangled="btRigidBody::getAngularSleepingThreshold() const" location="f38:241" file="f38" line="241" endline="243" inline="1"/>
  <Method id="_2134" name="applyDamping" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody12applyDampingEf" demangled="btRigidBody::applyDamping(float)" location="f38:246" file="f38" line="246" extern="1">
    <Argument name="timeStep" type="_362" location="f38:246" file="f38" line="246"/>
  </Method>
  <Method id="_2135" name="getCollisionShape" returns="_8995" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody17getCollisionShapeEv" demangled="btRigidBody::getCollisionShape() const" location="f38:248" file="f38" line="248" endline="249" inline="1"/>
  <Method id="_2136" name="getCollisionShape" returns="_8946" context="_95" access="public" mangled="_ZN11btRigidBody17getCollisionShapeEv" demangled="btRigidBody::getCollisionShape()" location="f38:252" file="f38" line="252" endline="253" inline="1"/>
  <Method id="_2137" name="setMassProps" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody12setMassPropsEfRK9btVector3" demangled="btRigidBody::setMassProps(float, btVector3 const&amp;)" location="f38:256" file="f38" line="256" extern="1">
    <Argument name="mass" type="_362" location="f38:256" file="f38" line="256"/>
    <Argument name="inertia" type="_1824" location="f38:256" file="f38" line="256"/>
  </Method>
  <Method id="_2138" name="getLinearFactor" returns="_1824" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody15getLinearFactorEv" demangled="btRigidBody::getLinearFactor() const" location="f38:258" file="f38" line="258" endline="260" inline="1"/>
  <Method id="_2139" name="setLinearFactor" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody15setLinearFactorERK9btVector3" demangled="btRigidBody::setLinearFactor(btVector3 const&amp;)" location="f38:262" file="f38" line="262" endline="265" inline="1">
    <Argument name="linearFactor" type="_1824" location="f38:262" file="f38" line="262"/>
  </Method>
  <Method id="_2140" name="getInvMass" returns="_362" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody10getInvMassEv" demangled="btRigidBody::getInvMass() const" location="f38:267" file="f38" line="267" endline="267" inline="1"/>
  <Method id="_2141" name="getInvInertiaTensorWorld" returns="_6101" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody24getInvInertiaTensorWorldEv" demangled="btRigidBody::getInvInertiaTensorWorld() const" location="f38:268" file="f38" line="268" endline="269" inline="1"/>
  <Method id="_2142" name="integrateVelocities" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody19integrateVelocitiesEf" demangled="btRigidBody::integrateVelocities(float)" location="f38:272" file="f38" line="272" extern="1">
    <Argument name="step" type="_362" location="f38:272" file="f38" line="272"/>
  </Method>
  <Method id="_2143" name="setCenterOfMassTransform" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody24setCenterOfMassTransformERK11btTransform" demangled="btRigidBody::setCenterOfMassTransform(btTransform const&amp;)" location="f38:274" file="f38" line="274" extern="1">
    <Argument name="xform" type="_6975" location="f38:274" file="f38" line="274"/>
  </Method>
  <Method id="_2144" name="applyCentralForce" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody17applyCentralForceERK9btVector3" demangled="btRigidBody::applyCentralForce(btVector3 const&amp;)" location="f38:276" file="f38" line="276" endline="278" inline="1">
    <Argument name="force" type="_1824" location="f38:276" file="f38" line="276"/>
  </Method>
  <Method id="_2145" name="getTotalForce" returns="_1824" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody13getTotalForceEv" demangled="btRigidBody::getTotalForce() const" location="f38:281" file="f38" line="281" endline="283" inline="1"/>
  <Method id="_2146" name="getTotalTorque" returns="_1824" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody14getTotalTorqueEv" demangled="btRigidBody::getTotalTorque() const" location="f38:286" file="f38" line="286" endline="288" inline="1"/>
  <Method id="_2147" name="getInvInertiaDiagLocal" returns="_1824" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody22getInvInertiaDiagLocalEv" demangled="btRigidBody::getInvInertiaDiagLocal() const" location="f38:291" file="f38" line="291" endline="293" inline="1"/>
  <Method id="_2148" name="setInvInertiaDiagLocal" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody22setInvInertiaDiagLocalERK9btVector3" demangled="btRigidBody::setInvInertiaDiagLocal(btVector3 const&amp;)" location="f38:296" file="f38" line="296" endline="298" inline="1">
    <Argument name="diagInvInertia" type="_1824" location="f38:296" file="f38" line="296"/>
  </Method>
  <Method id="_2149" name="setSleepingThresholds" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody21setSleepingThresholdsEff" demangled="btRigidBody::setSleepingThresholds(float, float)" location="f38:301" file="f38" line="301" endline="304" inline="1">
    <Argument name="linear" type="_362" location="f38:301" file="f38" line="301"/>
    <Argument name="angular" type="_362" location="f38:301" file="f38" line="301"/>
  </Method>
  <Method id="_2150" name="applyTorque" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody11applyTorqueERK9btVector3" demangled="btRigidBody::applyTorque(btVector3 const&amp;)" location="f38:307" file="f38" line="307" endline="309" inline="1">
    <Argument name="torque" type="_1824" location="f38:307" file="f38" line="307"/>
  </Method>
  <Method id="_2151" name="applyForce" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody10applyForceERK9btVector3S2_" demangled="btRigidBody::applyForce(btVector3 const&amp;, btVector3 const&amp;)" location="f38:312" file="f38" line="312" endline="315" inline="1">
    <Argument name="force" type="_1824" location="f38:312" file="f38" line="312"/>
    <Argument name="rel_pos" type="_1824" location="f38:312" file="f38" line="312"/>
  </Method>
  <Method id="_2152" name="applyCentralImpulse" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody19applyCentralImpulseERK9btVector3" demangled="btRigidBody::applyCentralImpulse(btVector3 const&amp;)" location="f38:318" file="f38" line="318" endline="320" inline="1">
    <Argument name="impulse" type="_1824" location="f38:318" file="f38" line="318"/>
  </Method>
  <Method id="_2153" name="applyTorqueImpulse" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody18applyTorqueImpulseERK9btVector3" demangled="btRigidBody::applyTorqueImpulse(btVector3 const&amp;)" location="f38:323" file="f38" line="323" endline="325" inline="1">
    <Argument name="torque" type="_1824" location="f38:323" file="f38" line="323"/>
  </Method>
  <Method id="_2154" name="applyImpulse" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody12applyImpulseERK9btVector3S2_" demangled="btRigidBody::applyImpulse(btVector3 const&amp;, btVector3 const&amp;)" location="f38:328" file="f38" line="328" endline="330" inline="1">
    <Argument name="impulse" type="_1824" location="f38:328" file="f38" line="328"/>
    <Argument name="rel_pos" type="_1824" location="f38:328" file="f38" line="328"/>
  </Method>
  <Method id="_2155" name="clearForces" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody11clearForcesEv" demangled="btRigidBody::clearForces()" location="f38:340" file="f38" line="340" endline="343" inline="1"/>
  <Method id="_2156" name="updateInertiaTensor" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody19updateInertiaTensorEv" demangled="btRigidBody::updateInertiaTensor()" location="f38:346" file="f38" line="346" extern="1"/>
  <Method id="_2157" name="getCenterOfMassPosition" returns="_1824" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody23getCenterOfMassPositionEv" demangled="btRigidBody::getCenterOfMassPosition() const" location="f38:348" file="f38" line="348" endline="349" inline="1"/>
  <Method id="_2158" name="getOrientation" returns="_1087" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody14getOrientationEv" demangled="btRigidBody::getOrientation() const" location="f38:351" file="f38" line="351" extern="1"/>
  <Method id="_2159" name="getCenterOfMassTransform" returns="_6975" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody24getCenterOfMassTransformEv" demangled="btRigidBody::getCenterOfMassTransform() const" location="f38:353" file="f38" line="353" endline="354" inline="1"/>
  <Method id="_2160" name="getLinearVelocity" returns="_1824" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody17getLinearVelocityEv" demangled="btRigidBody::getLinearVelocity() const" location="f38:356" file="f38" line="356" endline="357" inline="1"/>
  <Method id="_2161" name="getAngularVelocity" returns="_1824" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody18getAngularVelocityEv" demangled="btRigidBody::getAngularVelocity() const" location="f38:359" file="f38" line="359" endline="360" inline="1"/>
  <Method id="_2162" name="setLinearVelocity" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody17setLinearVelocityERK9btVector3" demangled="btRigidBody::setLinearVelocity(btVector3 const&amp;)" location="f38:364" file="f38" line="364" endline="367" inline="1">
    <Argument name="lin_vel" type="_1824" location="f38:364" file="f38" line="364"/>
  </Method>
  <Method id="_2163" name="setAngularVelocity" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody18setAngularVelocityERK9btVector3" demangled="btRigidBody::setAngularVelocity(btVector3 const&amp;)" location="f38:370" file="f38" line="370" endline="373" inline="1">
    <Argument name="ang_vel" type="_1824" location="f38:370" file="f38" line="370"/>
  </Method>
  <Method id="_2164" name="getVelocityInLocalPoint" returns="_193" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody23getVelocityInLocalPointERK9btVector3" demangled="btRigidBody::getVelocityInLocalPoint(btVector3 const&amp;) const" location="f38:376" file="f38" line="376" endline="379" inline="1">
    <Argument name="rel_pos" type="_1824" location="f38:376" file="f38" line="376"/>
  </Method>
  <Method id="_2165" name="translate" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody9translateERK9btVector3" demangled="btRigidBody::translate(btVector3 const&amp;)" location="f38:385" file="f38" line="385" endline="387" inline="1">
    <Argument name="v" type="_1824" location="f38:385" file="f38" line="385"/>
  </Method>
  <Method id="_2166" name="getAabb" returns="_635" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody7getAabbER9btVector3S1_" demangled="btRigidBody::getAabb(btVector3&amp;, btVector3&amp;) const" location="f38:391" file="f38" line="391" extern="1">
    <Argument name="aabbMin" type="_2535" location="f38:391" file="f38" line="391"/>
    <Argument name="aabbMax" type="_2535" location="f38:391" file="f38" line="391"/>
  </Method>
  <Method id="_2167" name="computeImpulseDenominator" returns="_362" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody25computeImpulseDenominatorERK9btVector3S2_" demangled="btRigidBody::computeImpulseDenominator(btVector3 const&amp;, btVector3 const&amp;) const" location="f38:397" file="f38" line="397" endline="405" inline="1">
    <Argument name="pos" type="_1824" location="f38:397" file="f38" line="397"/>
    <Argument name="normal" type="_1824" location="f38:397" file="f38" line="397"/>
  </Method>
  <Method id="_2168" name="computeAngularImpulseDenominator" returns="_362" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody32computeAngularImpulseDenominatorERK9btVector3" demangled="btRigidBody::computeAngularImpulseDenominator(btVector3 const&amp;) const" location="f38:409" file="f38" line="409" endline="412" inline="1">
    <Argument name="axis" type="_1824" location="f38:409" file="f38" line="409"/>
  </Method>
  <Method id="_2169" name="updateDeactivation" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody18updateDeactivationEf" demangled="btRigidBody::updateDeactivation(float)" location="f38:415" file="f38" line="415" endline="420" inline="1">
    <Argument name="timeStep" type="_362" location="f38:415" file="f38" line="415"/>
  </Method>
  <Method id="_2170" name="wantsSleeping" returns="_1834" context="_95" access="public" mangled="_ZN11btRigidBody13wantsSleepingEv" demangled="btRigidBody::wantsSleeping()" location="f38:432" file="f38" line="432" endline="449" inline="1"/>
  <Method id="_2171" name="getBroadphaseProxy" returns="_8996" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody18getBroadphaseProxyEv" demangled="btRigidBody::getBroadphaseProxy() const" location="f38:454" file="f38" line="454" endline="456" inline="1"/>
  <Method id="_2172" name="getBroadphaseProxy" returns="_8929" context="_95" access="public" mangled="_ZN11btRigidBody18getBroadphaseProxyEv" demangled="btRigidBody::getBroadphaseProxy()" location="f38:458" file="f38" line="458" endline="460" inline="1"/>
  <Method id="_2173" name="setNewBroadphaseProxy" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody21setNewBroadphaseProxyEP17btBroadphaseProxy" demangled="btRigidBody::setNewBroadphaseProxy(btBroadphaseProxy*)" location="f38:462" file="f38" line="462" endline="464" inline="1">
    <Argument name="broadphaseProxy" type="_8929" location="f38:462" file="f38" line="462"/>
  </Method>
  <Method id="_2174" name="getMotionState" returns="_8970" context="_95" access="public" mangled="_ZN11btRigidBody14getMotionStateEv" demangled="btRigidBody::getMotionState()" location="f38:468" file="f38" line="468" endline="470" inline="1"/>
  <Method id="_2175" name="getMotionState" returns="_8997" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody14getMotionStateEv" demangled="btRigidBody::getMotionState() const" location="f38:472" file="f38" line="472" endline="474" inline="1"/>
  <Method id="_2176" name="setMotionState" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody14setMotionStateEP13btMotionState" demangled="btRigidBody::setMotionState(btMotionState*)" location="f38:476" file="f38" line="476" endline="479" inline="1">
    <Argument name="motionState" type="_8970" location="f38:476" file="f38" line="476"/>
  </Method>
  <Method id="_2177" name="setAngularFactor" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody16setAngularFactorERK9btVector3" demangled="btRigidBody::setAngularFactor(btVector3 const&amp;)" location="f38:487" file="f38" line="487" endline="490" inline="1">
    <Argument name="angFac" type="_1824" location="f38:487" file="f38" line="487"/>
  </Method>
  <Method id="_2178" name="setAngularFactor" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody16setAngularFactorEf" demangled="btRigidBody::setAngularFactor(float)" location="f38:493" file="f38" line="493" endline="496" inline="1">
    <Argument name="angFac" type="_362" location="f38:493" file="f38" line="493"/>
  </Method>
  <Method id="_2179" name="getAngularFactor" returns="_1824" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody16getAngularFactorEv" demangled="btRigidBody::getAngularFactor() const" location="f38:498" file="f38" line="498" endline="500" inline="1"/>
  <Method id="_2180" name="isInWorld" returns="_1834" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody9isInWorldEv" demangled="btRigidBody::isInWorld() const" location="f38:504" file="f38" line="504" endline="506" inline="1"/>
  <Method id="_2181" name="checkCollideWithOverride" returns="_1834" const="1" virtual="1" overrides="_6766 " context="_95" access="public" mangled="_ZNK11btRigidBody24checkCollideWithOverrideEPK17btCollisionObject" demangled="btRigidBody::checkCollideWithOverride(btCollisionObject const*) const" location="f38:509" file="f38" line="509" extern="1">
    <Argument name="co" type="_4331" location="f38:509" file="f38" line="509"/>
  </Method>
  <Method id="_2182" name="addConstraintRef" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody16addConstraintRefEP17btTypedConstraint" demangled="btRigidBody::addConstraintRef(btTypedConstraint*)" location="f38:511" file="f38" line="511" extern="1">
    <Argument name="c" type="_3800" location="f38:511" file="f38" line="511"/>
  </Method>
  <Method id="_2183" name="removeConstraintRef" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody19removeConstraintRefEP17btTypedConstraint" demangled="btRigidBody::removeConstraintRef(btTypedConstraint*)" location="f38:512" file="f38" line="512" extern="1">
    <Argument name="c" type="_3800" location="f38:512" file="f38" line="512"/>
  </Method>
  <Method id="_2184" name="getConstraintRef" returns="_3800" context="_95" access="public" mangled="_ZN11btRigidBody16getConstraintRefEi" demangled="btRigidBody::getConstraintRef(int)" location="f38:514" file="f38" line="514" endline="516" inline="1">
    <Argument name="index" type="_168" location="f38:514" file="f38" line="514"/>
  </Method>
  <Method id="_2185" name="getNumConstraintRefs" returns="_168" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody20getNumConstraintRefsEv" demangled="btRigidBody::getNumConstraintRefs() const" location="f38:519" file="f38" line="519" endline="521" inline="1"/>
  <Method id="_2186" name="setFlags" returns="_635" context="_95" access="public" mangled="_ZN11btRigidBody8setFlagsEi" demangled="btRigidBody::setFlags(int)" location="f38:524" file="f38" line="524" endline="526" inline="1">
    <Argument name="flags" type="_168" location="f38:524" file="f38" line="524"/>
  </Method>
  <Method id="_2187" name="getFlags" returns="_168" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody8getFlagsEv" demangled="btRigidBody::getFlags() const" location="f38:529" file="f38" line="529" endline="531" inline="1"/>
  <Method id="_2188" name="computeGyroscopicForce" returns="_193" const="1" context="_95" access="public" mangled="_ZNK11btRigidBody22computeGyroscopicForceEf" demangled="btRigidBody::computeGyroscopicForce(float) const" location="f38:534" file="f38" line="534" extern="1">
    <Argument name="maxGyroscopicForce" type="_362" location="f38:534" file="f38" line="534"/>
  </Method>
  <Method id="_2189" name="calculateSerializeBufferSize" returns="_168" const="1" virtual="1" overrides="_6838 " context="_95" access="public" mangled="_ZNK11btRigidBody28calculateSerializeBufferSizeEv" demangled="btRigidBody::calculateSerializeBufferSize() const" location="f38:538" file="f38" line="538" extern="1"/>
  <Method id="_2190" name="serialize" returns="_1823" const="1" virtual="1" overrides="_6839 " context="_95" access="public" mangled="_ZNK11btRigidBody9serializeEPvP12btSerializer" demangled="btRigidBody::serialize(void*, btSerializer*) const" location="f38:541" file="f38" line="541" extern="1">
    <Argument name="dataBuffer" type="_1077" location="f38:541" file="f38" line="541"/>
    <Argument name="serializer" type="_8886" location="f38:541" file="f38" line="541"/>
  </Method>
  <Method id="_2191" name="serializeSingleObject" returns="_635" const="1" virtual="1" overrides="_6840 " context="_95" access="public" mangled="_ZNK11btRigidBody21serializeSingleObjectEP12btSerializer" demangled="btRigidBody::serializeSingleObject(btSerializer*) const" location="f38:543" file="f38" line="543" extern="1">
    <Argument name="serializer" type="_8886" location="f38:543" file="f38" line="543"/>
  </Method>
  <PointerType id="_2192" type="_342c" size="64" align="64"/>
  <Field id="_2193" name="Name" type="_1823" offset="0" context="_102" access="protected" location="f40:89" file="f40" line="89"/>
  <Field id="_2194" name="TotalCalls" type="_168" offset="64" context="_102" access="protected" location="f40:90" file="f40" line="90"/>
  <Field id="_2195" name="TotalTime" type="_361" offset="96" context="_102" access="protected" location="f40:91" file="f40" line="91"/>
  <Field id="_2196" name="StartTime" type="_153" offset="128" context="_102" access="protected" location="f40:92" file="f40" line="92"/>
  <Field id="_2197" name="RecursionCounter" type="_168" offset="192" context="_102" access="protected" location="f40:93" file="f40" line="93"/>
  <Field id="_2198" name="Parent" type="_8999" offset="256" context="_102" access="protected" location="f40:95" file="f40" line="95"/>
  <Field id="_2199" name="Child" type="_8999" offset="320" context="_102" access="protected" location="f40:96" file="f40" line="96"/>
  <Field id="_2200" name="Sibling" type="_8999" offset="384" context="_102" access="protected" location="f40:97" file="f40" line="97"/>
  <Field id="_2201" name="m_userPtr" type="_1077" offset="448" context="_102" access="protected" location="f40:98" file="f40" line="98"/>
  <OperatorMethod id="_2202" name="=" returns="_9000" artificial="1" throw="" context="_102" access="public" mangled="_ZN12CProfileNodeaSERKS_" demangled="CProfileNode::operator=(CProfileNode const&amp;)" location="f40:65" file="f40" line="65" endline="65" inline="1">
    <Argument type="_9001" location="f40:65" file="f40" line="65"/>
  </OperatorMethod>
  <Constructor id="_2203" name="CProfileNode" artificial="1" throw="" context="_102" access="public" mangled="_ZN12CProfileNodeC1ERKS_ *INTERNAL* " demangled="CProfileNode::CProfileNode(CProfileNode const&amp;)" location="f40:65" file="f40" line="65" endline="65" inline="1">
    <Argument type="_9001" location="f40:65" file="f40" line="65"/>
  </Constructor>
  <Constructor id="_2204" name="CProfileNode" explicit="1" context="_102" access="public" mangled="_ZN12CProfileNodeC1EPKcPS_ *INTERNAL* " demangled="CProfileNode::CProfileNode(char const*, CProfileNode*)" location="f40:68" file="f40" line="68" extern="1">
    <Argument name="name" type="_1823" location="f40:68" file="f40" line="68"/>
    <Argument name="parent" type="_8999" location="f40:68" file="f40" line="68"/>
  </Constructor>
  <Destructor id="_2205" name="CProfileNode" context="_102" access="public" mangled="_ZN12CProfileNodeD1Ev *INTERNAL* " demangled="CProfileNode::~CProfileNode()" location="f40:69" file="f40" line="69" extern="1">
  </Destructor>
  <Method id="_2206" name="Get_Sub_Node" returns="_8999" context="_102" access="public" mangled="_ZN12CProfileNode12Get_Sub_NodeEPKc" demangled="CProfileNode::Get_Sub_Node(char const*)" location="f40:71" file="f40" line="71" extern="1">
    <Argument name="name" type="_1823" location="f40:71" file="f40" line="71"/>
  </Method>
  <Method id="_2207" name="Get_Parent" returns="_8999" context="_102" access="public" mangled="_ZN12CProfileNode10Get_ParentEv" demangled="CProfileNode::Get_Parent()" location="f40:73" file="f40" line="73" endline="73" inline="1"/>
  <Method id="_2208" name="Get_Sibling" returns="_8999" context="_102" access="public" mangled="_ZN12CProfileNode11Get_SiblingEv" demangled="CProfileNode::Get_Sibling()" location="f40:74" file="f40" line="74" endline="74" inline="1"/>
  <Method id="_2209" name="Get_Child" returns="_8999" context="_102" access="public" mangled="_ZN12CProfileNode9Get_ChildEv" demangled="CProfileNode::Get_Child()" location="f40:75" file="f40" line="75" endline="75" inline="1"/>
  <Method id="_2210" name="CleanupMemory" returns="_635" context="_102" access="public" mangled="_ZN12CProfileNode13CleanupMemoryEv" demangled="CProfileNode::CleanupMemory()" location="f40:77" file="f40" line="77" extern="1"/>
  <Method id="_2211" name="Reset" returns="_635" context="_102" access="public" mangled="_ZN12CProfileNode5ResetEv" demangled="CProfileNode::Reset()" location="f40:78" file="f40" line="78" extern="1"/>
  <Method id="_2212" name="Call" returns="_635" context="_102" access="public" mangled="_ZN12CProfileNode4CallEv" demangled="CProfileNode::Call()" location="f40:79" file="f40" line="79" extern="1"/>
  <Method id="_2213" name="Return" returns="_1834" context="_102" access="public" mangled="_ZN12CProfileNode6ReturnEv" demangled="CProfileNode::Return()" location="f40:80" file="f40" line="80" extern="1"/>
  <Method id="_2214" name="Get_Name" returns="_1823" context="_102" access="public" mangled="_ZN12CProfileNode8Get_NameEv" demangled="CProfileNode::Get_Name()" location="f40:82" file="f40" line="82" endline="82" inline="1"/>
  <Method id="_2215" name="Get_Total_Calls" returns="_168" context="_102" access="public" mangled="_ZN12CProfileNode15Get_Total_CallsEv" demangled="CProfileNode::Get_Total_Calls()" location="f40:83" file="f40" line="83" endline="83" inline="1"/>
  <Method id="_2216" name="Get_Total_Time" returns="_361" context="_102" access="public" mangled="_ZN12CProfileNode14Get_Total_TimeEv" demangled="CProfileNode::Get_Total_Time()" location="f40:84" file="f40" line="84" endline="84" inline="1"/>
  <Method id="_2217" name="GetUserPointer" returns="_1077" const="1" context="_102" access="public" mangled="_ZNK12CProfileNode14GetUserPointerEv" demangled="CProfileNode::GetUserPointer() const" location="f40:85" file="f40" line="85" endline="85" inline="1"/>
  <Method id="_2218" name="SetUserPointer" returns="_635" context="_102" access="public" mangled="_ZN12CProfileNode14SetUserPointerEPv" demangled="CProfileNode::SetUserPointer(void*)" location="f40:86" file="f40" line="86" endline="86" inline="1">
    <Argument name="ptr" type="_1077" location="f40:86" file="f40" line="86"/>
  </Method>
  <Field id="_2219" name="m_collisionShapeData" type="_1301" offset="0" context="_103" access="public" location="f41:74" file="f41" line="74"/>
  <Field id="_2220" name="m_localScaling" type="_621" offset="128" context="_103" access="public" location="f41:76" file="f41" line="76"/>
  <Field id="_2221" name="m_planeNormal" type="_621" offset="256" context="_103" access="public" location="f41:77" file="f41" line="77"/>
  <Field id="_2222" name="m_planeConstant" type="_361" offset="384" context="_103" access="public" location="f41:78" file="f41" line="78"/>
  <Field id="_2223" name="m_pad" type="_8881" offset="416" context="_103" access="public" location="f41:79" file="f41" line="79"/>
  <Destructor id="_2224" name="btStaticPlaneShapeData" artificial="1" throw="" context="_103" access="public" mangled="_ZN22btStaticPlaneShapeDataD1Ev *INTERNAL* " demangled="btStaticPlaneShapeData::~btStaticPlaneShapeData()" location="f41:73" file="f41" line="73" endline="73" inline="1">
  </Destructor>
  <OperatorMethod id="_2225" name="=" returns="_9002" artificial="1" throw="" context="_103" access="public" mangled="_ZN22btStaticPlaneShapeDataaSERKS_" demangled="btStaticPlaneShapeData::operator=(btStaticPlaneShapeData const&amp;)" location="f41:73" file="f41" line="73" endline="73" inline="1">
    <Argument type="_9003" location="f41:73" file="f41" line="73"/>
  </OperatorMethod>
  <Constructor id="_2226" name="btStaticPlaneShapeData" artificial="1" throw="" context="_103" access="public" mangled="_ZN22btStaticPlaneShapeDataC1ERKS_ *INTERNAL* " demangled="btStaticPlaneShapeData::btStaticPlaneShapeData(btStaticPlaneShapeData const&amp;)" location="f41:73" file="f41" line="73" endline="73" inline="1">
    <Argument type="_9003" location="f41:73" file="f41" line="73"/>
  </Constructor>
  <Constructor id="_2227" name="btStaticPlaneShapeData" artificial="1" throw="" context="_103" access="public" mangled="_ZN22btStaticPlaneShapeDataC1Ev *INTERNAL* " demangled="btStaticPlaneShapeData::btStaticPlaneShapeData()" location="f41:73" file="f41" line="73" inline="1"/>
  <Field id="_2228" name="m_rbA" type="_9004" offset="0" context="_107" access="public" location="f10:371" file="f10" line="371"/>
  <Field id="_2229" name="m_rbB" type="_9004" offset="64" context="_107" access="public" location="f10:372" file="f10" line="372"/>
  <Field id="_2230" name="m_name" type="_1071" offset="128" context="_107" access="public" location="f10:373" file="f10" line="373"/>
  <Field id="_2231" name="m_objectType" type="_168" offset="192" context="_107" access="public" location="f10:375" file="f10" line="375"/>
  <Field id="_2232" name="m_userConstraintType" type="_168" offset="224" context="_107" access="public" location="f10:376" file="f10" line="376"/>
  <Field id="_2233" name="m_userConstraintId" type="_168" offset="256" context="_107" access="public" location="f10:377" file="f10" line="377"/>
  <Field id="_2234" name="m_needsFeedback" type="_168" offset="288" context="_107" access="public" location="f10:378" file="f10" line="378"/>
  <Field id="_2235" name="m_appliedImpulse" type="_361" offset="320" context="_107" access="public" location="f10:380" file="f10" line="380"/>
  <Field id="_2236" name="m_dbgDrawSize" type="_361" offset="352" context="_107" access="public" location="f10:381" file="f10" line="381"/>
  <Field id="_2237" name="m_disableCollisionsBetweenLinkedBodies" type="_168" offset="384" context="_107" access="public" location="f10:383" file="f10" line="383"/>
  <Field id="_2238" name="m_overrideNumSolverIterations" type="_168" offset="416" context="_107" access="public" location="f10:384" file="f10" line="384"/>
  <Field id="_2239" name="m_breakingImpulseThreshold" type="_361" offset="448" context="_107" access="public" location="f10:386" file="f10" line="386"/>
  <Field id="_2240" name="m_isEnabled" type="_168" offset="480" context="_107" access="public" location="f10:387" file="f10" line="387"/>
  <Destructor id="_2241" name="btTypedConstraintFloatData" artificial="1" throw="" context="_107" access="public" mangled="_ZN26btTypedConstraintFloatDataD1Ev *INTERNAL* " demangled="btTypedConstraintFloatData::~btTypedConstraintFloatData()" location="f10:370" file="f10" line="370" endline="370" inline="1">
  </Destructor>
  <OperatorMethod id="_2242" name="=" returns="_9005" artificial="1" throw="" context="_107" access="public" mangled="_ZN26btTypedConstraintFloatDataaSERKS_" demangled="btTypedConstraintFloatData::operator=(btTypedConstraintFloatData const&amp;)" location="f10:370" file="f10" line="370" endline="370" inline="1">
    <Argument type="_9006" location="f10:370" file="f10" line="370"/>
  </OperatorMethod>
  <Constructor id="_2243" name="btTypedConstraintFloatData" artificial="1" throw="" context="_107" access="public" mangled="_ZN26btTypedConstraintFloatDataC1ERKS_ *INTERNAL* " demangled="btTypedConstraintFloatData::btTypedConstraintFloatData(btTypedConstraintFloatData const&amp;)" location="f10:370" file="f10" line="370" endline="370" inline="1">
    <Argument type="_9006" location="f10:370" file="f10" line="370"/>
  </Constructor>
  <Constructor id="_2244" name="btTypedConstraintFloatData" artificial="1" throw="" context="_107" access="public" mangled="_ZN26btTypedConstraintFloatDataC1Ev *INTERNAL* " demangled="btTypedConstraintFloatData::btTypedConstraintFloatData()" location="f10:370" file="f10" line="370" inline="1"/>
  <Field id="_2245" name="__val" type="_9007" offset="0" context="_111" access="public" location="f44:29" file="f44" line="29"/>
  <Destructor id="_2246" name="._10" artificial="1" throw="" context="_111" access="public" mangled="_ZN10__sigset_tD1Ev *INTERNAL* " demangled="__sigset_t::~__sigset_t()" location="f44:30" file="f44" line="30" endline="30" inline="1">
  </Destructor>
  <OperatorMethod id="_2247" name="=" returns="_9008" artificial="1" throw="" context="_111" access="public" mangled="_ZN10__sigset_taSERKS_" demangled="__sigset_t::operator=(__sigset_t const&amp;)" location="f44:30" file="f44" line="30" endline="30" inline="1">
    <Argument type="_9009" location="f44:28" file="f44" line="28"/>
  </OperatorMethod>
  <Constructor id="_2248" name="._10" artificial="1" throw="" context="_111" access="public" mangled="_ZN10__sigset_tC1ERKS_ *INTERNAL* " demangled="__sigset_t::__sigset_t(__sigset_t const&amp;)" location="f44:30" file="f44" line="30" endline="30" inline="1">
    <Argument type="_9009" location="f44:28" file="f44" line="28"/>
  </Constructor>
  <Constructor id="_2249" name="._10" artificial="1" throw="" context="_111" access="public" mangled="_ZN10__sigset_tC1Ev *INTERNAL* " demangled="__sigset_t::__sigset_t()" location="f44:30" file="f44" line="30" inline="1"/>
  <Field id="_2250" name="mi" type="_193" offset="0" context="_119" access="private" location="f27:170" file="f27" line="170"/>
  <Field id="_2251" name="mx" type="_193" offset="128" context="_119" access="private" location="f27:170" file="f27" line="170"/>
  <Destructor id="_2252" name="btDbvtAabbMm" artificial="1" throw="" context="_119" access="public" mangled="_ZN12btDbvtAabbMmD1Ev *INTERNAL* " demangled="btDbvtAabbMm::~btDbvtAabbMm()" location="f27:131" file="f27" line="131" endline="131" inline="1">
  </Destructor>
  <OperatorMethod id="_2253" name="=" returns="_3467" artificial="1" throw="" context="_119" access="public" mangled="_ZN12btDbvtAabbMmaSERKS_" demangled="btDbvtAabbMm::operator=(btDbvtAabbMm const&amp;)" location="f27:131" file="f27" line="131" endline="131" inline="1">
    <Argument type="_2553" location="f27:131" file="f27" line="131"/>
  </OperatorMethod>
  <Constructor id="_2254" name="btDbvtAabbMm" artificial="1" throw="" context="_119" access="public" mangled="_ZN12btDbvtAabbMmC1ERKS_ *INTERNAL* " demangled="btDbvtAabbMm::btDbvtAabbMm(btDbvtAabbMm const&amp;)" location="f27:131" file="f27" line="131" endline="131" inline="1">
    <Argument type="_2553" location="f27:131" file="f27" line="131"/>
  </Constructor>
  <Constructor id="_2255" name="btDbvtAabbMm" artificial="1" context="_119" access="public" mangled="_ZN12btDbvtAabbMmC1Ev *INTERNAL* " demangled="btDbvtAabbMm::btDbvtAabbMm()" location="f27:131" file="f27" line="131" endline="131" inline="1"/>
  <Method id="_2256" name="Center" returns="_193" const="1" context="_119" access="public" mangled="_ZNK12btDbvtAabbMm6CenterEv" demangled="btDbvtAabbMm::Center() const" location="f27:132" file="f27" line="132" endline="132" inline="1"/>
  <Method id="_2257" name="Lengths" returns="_193" const="1" context="_119" access="public" mangled="_ZNK12btDbvtAabbMm7LengthsEv" demangled="btDbvtAabbMm::Lengths() const" location="f27:133" file="f27" line="133" endline="133" inline="1"/>
  <Method id="_2258" name="Extents" returns="_193" const="1" context="_119" access="public" mangled="_ZNK12btDbvtAabbMm7ExtentsEv" demangled="btDbvtAabbMm::Extents() const" location="f27:134" file="f27" line="134" endline="134" inline="1"/>
  <Method id="_2259" name="Mins" returns="_1824" const="1" context="_119" access="public" mangled="_ZNK12btDbvtAabbMm4MinsEv" demangled="btDbvtAabbMm::Mins() const" location="f27:135" file="f27" line="135" endline="135" inline="1"/>
  <Method id="_2260" name="Maxs" returns="_1824" const="1" context="_119" access="public" mangled="_ZNK12btDbvtAabbMm4MaxsEv" demangled="btDbvtAabbMm::Maxs() const" location="f27:136" file="f27" line="136" endline="136" inline="1"/>
  <Method id="_2261" name="FromCE" returns="_119" static="1" context="_119" access="public" mangled="_ZN12btDbvtAabbMm6FromCEERK9btVector3S2_" demangled="btDbvtAabbMm::FromCE(btVector3 const&amp;, btVector3 const&amp;)" location="f27:397" file="f27" line="397" endline="401" inline="1">
    <Argument name="c" type="_1824" location="f27:397" file="f27" line="397"/>
    <Argument name="e" type="_1824" location="f27:397" file="f27" line="397"/>
  </Method>
  <Method id="_2262" name="FromCR" returns="_119" static="1" context="_119" access="public" mangled="_ZN12btDbvtAabbMm6FromCRERK9btVector3f" demangled="btDbvtAabbMm::FromCR(btVector3 const&amp;, float)" location="f27:405" file="f27" line="405" endline="407" inline="1">
    <Argument name="c" type="_1824" location="f27:405" file="f27" line="405"/>
    <Argument name="r" type="_362" location="f27:405" file="f27" line="405"/>
  </Method>
  <Method id="_2263" name="FromMM" returns="_119" static="1" context="_119" access="public" mangled="_ZN12btDbvtAabbMm6FromMMERK9btVector3S2_" demangled="btDbvtAabbMm::FromMM(btVector3 const&amp;, btVector3 const&amp;)" location="f27:411" file="f27" line="411" endline="415" inline="1">
    <Argument name="mi" type="_1824" location="f27:411" file="f27" line="411"/>
    <Argument name="mx" type="_1824" location="f27:411" file="f27" line="411"/>
  </Method>
  <Method id="_2264" name="FromPoints" returns="_119" static="1" context="_119" access="public" mangled="_ZN12btDbvtAabbMm10FromPointsEPK9btVector3i" demangled="btDbvtAabbMm::FromPoints(btVector3 const*, int)" location="f27:419" file="f27" line="419" endline="428" inline="1">
    <Argument name="pts" type="_4306" location="f27:419" file="f27" line="419"/>
    <Argument name="n" type="_168" location="f27:419" file="f27" line="419"/>
  </Method>
  <Method id="_2265" name="FromPoints" returns="_119" static="1" context="_119" access="public" mangled="_ZN12btDbvtAabbMm10FromPointsEPPK9btVector3i" demangled="btDbvtAabbMm::FromPoints(btVector3 const**, int)" location="f27:432" file="f27" line="432" endline="441" inline="1">
    <Argument name="ppts" type="_9010" location="f27:432" file="f27" line="432"/>
    <Argument name="n" type="_168" location="f27:432" file="f27" line="432"/>
  </Method>
  <Method id="_2266" name="Expand" returns="_635" context="_119" access="public" mangled="_ZN12btDbvtAabbMm6ExpandERK9btVector3" demangled="btDbvtAabbMm::Expand(btVector3 const&amp;)" location="f27:445" file="f27" line="445" endline="447" inline="1">
    <Argument name="e" type="_1824" location="f27:445" file="f27" line="445"/>
  </Method>
  <Method id="_2267" name="SignedExpand" returns="_635" context="_119" access="public" mangled="_ZN12btDbvtAabbMm12SignedExpandERK9btVector3" demangled="btDbvtAabbMm::SignedExpand(btVector3 const&amp;)" location="f27:451" file="f27" line="451" endline="455" inline="1">
    <Argument name="e" type="_1824" location="f27:451" file="f27" line="451"/>
  </Method>
  <Method id="_2268" name="Contain" returns="_1834" const="1" context="_119" access="public" mangled="_ZNK12btDbvtAabbMm7ContainERKS_" demangled="btDbvtAabbMm::Contain(btDbvtAabbMm const&amp;) const" location="f27:459" file="f27" line="459" endline="466" inline="1">
    <Argument name="a" type="_2553" location="f27:459" file="f27" line="459"/>
  </Method>
  <Method id="_2269" name="Classify" returns="_168" const="1" context="_119" access="public" mangled="_ZNK12btDbvtAabbMm8ClassifyERK9btVector3fi" demangled="btDbvtAabbMm::Classify(btVector3 const&amp;, float, int) const" location="f27:470" file="f27" line="470" endline="494" inline="1">
    <Argument name="n" type="_1824" location="f27:470" file="f27" line="470"/>
    <Argument name="o" type="_362" location="f27:470" file="f27" line="470"/>
    <Argument name="s" type="_168" location="f27:470" file="f27" line="470"/>
  </Method>
  <Method id="_2270" name="ProjectMinimum" returns="_362" const="1" context="_119" access="public" mangled="_ZNK12btDbvtAabbMm14ProjectMinimumERK9btVector3j" demangled="btDbvtAabbMm::ProjectMinimum(btVector3 const&amp;, unsigned int) const" location="f27:498" file="f27" line="498" endline="504" inline="1">
    <Argument name="v" type="_1824" location="f27:498" file="f27" line="498"/>
    <Argument name="signs" type="_85" location="f27:498" file="f27" line="498"/>
  </Method>
  <Method id="_2271" name="tMins" returns="_2535" context="_119" access="public" mangled="_ZN12btDbvtAabbMm5tMinsEv" demangled="btDbvtAabbMm::tMins()" location="f27:164" file="f27" line="164" endline="164" inline="1"/>
  <Method id="_2272" name="tMaxs" returns="_2535" context="_119" access="public" mangled="_ZN12btDbvtAabbMm5tMaxsEv" demangled="btDbvtAabbMm::tMaxs()" location="f27:165" file="f27" line="165" endline="165" inline="1"/>
  <Method id="_2273" name="AddSpan" returns="_635" const="1" context="_119" access="private" mangled="_ZNK12btDbvtAabbMm7AddSpanERK9btVector3RfS3_" demangled="btDbvtAabbMm::AddSpan(btVector3 const&amp;, float&amp;, float&amp;) const" location="f27:508" file="f27" line="508" endline="516" inline="1">
    <Argument name="d" type="_1824" location="f27:508" file="f27" line="508"/>
    <Argument name="smi" type="_3326" location="f27:508" file="f27" line="508"/>
    <Argument name="smx" type="_3326" location="f27:508" file="f27" line="508"/>
  </Method>
  <Field id="_2274" name="m_value" type="_227" offset="0" context="_127" access="public" location="f50:111" file="f50" line="111"/>
  <Field id="_2275" name="m_pad" type="_9011" offset="16" context="_127" access="public" location="f50:112" file="f50" line="112"/>
  <Destructor id="_2276" name="btShortIntIndexData" artificial="1" throw="" context="_127" access="public" mangled="_ZN19btShortIntIndexDataD1Ev *INTERNAL* " demangled="btShortIntIndexData::~btShortIntIndexData()" location="f50:110" file="f50" line="110" endline="110" inline="1">
  </Destructor>
  <OperatorMethod id="_2277" name="=" returns="_9012" artificial="1" throw="" context="_127" access="public" mangled="_ZN19btShortIntIndexDataaSERKS_" demangled="btShortIntIndexData::operator=(btShortIntIndexData const&amp;)" location="f50:110" file="f50" line="110" endline="110" inline="1">
    <Argument type="_9013" location="f50:110" file="f50" line="110"/>
  </OperatorMethod>
  <Constructor id="_2278" name="btShortIntIndexData" artificial="1" throw="" context="_127" access="public" mangled="_ZN19btShortIntIndexDataC1ERKS_ *INTERNAL* " demangled="btShortIntIndexData::btShortIntIndexData(btShortIntIndexData const&amp;)" location="f50:110" file="f50" line="110" endline="110" inline="1">
    <Argument type="_9013" location="f50:110" file="f50" line="110"/>
  </Constructor>
  <Constructor id="_2279" name="btShortIntIndexData" artificial="1" throw="" context="_127" access="public" mangled="_ZN19btShortIntIndexDataC1Ev *INTERNAL* " demangled="btShortIntIndexData::btShortIntIndexData()" location="f50:110" file="f50" line="110" inline="1"/>
  <CvQualifiedType id="_1926r" type="_1926" restrict="1"/>
  <OperatorMethod id="_2281" name="=" returns="_9014" artificial="1" throw="" context="_138" access="public" mangled="_ZN13btMotionStateaSERKS_" demangled="btMotionState::operator=(btMotionState const&amp;)" location="f28:24" file="f28" line="24" endline="24" inline="1">
    <Argument type="_9015" location="f28:24" file="f28" line="24"/>
  </OperatorMethod>
  <Constructor id="_2282" name="btMotionState" artificial="1" throw="" context="_138" access="public" mangled="_ZN13btMotionStateC1ERKS_ *INTERNAL* " demangled="btMotionState::btMotionState(btMotionState const&amp;)" location="f28:24" file="f28" line="24" endline="24" inline="1">
    <Argument type="_9015" location="f28:24" file="f28" line="24"/>
  </Constructor>
  <Constructor id="_2283" name="btMotionState" artificial="1" throw="" context="_138" access="public" mangled="_ZN13btMotionStateC1Ev *INTERNAL* " demangled="btMotionState::btMotionState()" location="f28:24" file="f28" line="24" endline="24" inline="1"/>
  <Destructor id="_2284" name="btMotionState" virtual="1" overrides="" context="_138" access="public" mangled="_ZN13btMotionStateD1Ev *INTERNAL* " demangled="btMotionState::~btMotionState()" location="f28:27" file="f28" line="27" endline="30" inline="1">
  </Destructor>
  <Method id="_2285" name="getWorldTransform" returns="_635" const="1" virtual="1" pure_virtual="1" overrides="" context="_138" access="public" mangled="_ZNK13btMotionState17getWorldTransformER11btTransform" demangled="btMotionState::getWorldTransform(btTransform&amp;) const" location="f28:32" file="f28" line="32" extern="1">
    <Argument name="worldTrans" type="_8994" location="f28:32" file="f28" line="32"/>
  </Method>
  <Method id="_2286" name="setWorldTransform" returns="_635" virtual="1" pure_virtual="1" overrides="" context="_138" access="public" mangled="_ZN13btMotionState17setWorldTransformERK11btTransform" demangled="btMotionState::setWorldTransform(btTransform const&amp;)" location="f28:35" file="f28" line="35" extern="1">
    <Argument name="worldTrans" type="_6975" location="f28:35" file="f28" line="35"/>
  </Method>
  <Field id="_2287" name="m_stridingMesh" type="_8950" offset="896" context="_139" access="private" location="f39:28" file="f39" line="28"/>
  <OperatorMethod id="_2288" name="=" returns="_9016" artificial="1" throw="" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShapeaSERKS_" demangled="btConvexTriangleMeshShape::operator=(btConvexTriangleMeshShape const&amp;)" location="f39:26" file="f39" line="26" endline="26" inline="1">
    <Argument type="_9017" location="f39:26" file="f39" line="26"/>
  </OperatorMethod>
  <Constructor id="_2289" name="btConvexTriangleMeshShape" artificial="1" throw="" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShapeC1ERKS_ *INTERNAL* " demangled="btConvexTriangleMeshShape::btConvexTriangleMeshShape(btConvexTriangleMeshShape const&amp;)" location="f39:26" file="f39" line="26" endline="26" inline="1">
    <Argument type="_9017" location="f39:26" file="f39" line="26"/>
  </Constructor>
  <OperatorMethod id="_2290" name="new" returns="_1077" static="1" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShapenwEm" demangled="btConvexTriangleMeshShape::operator new(unsigned long)" location="f39:31" file="f39" line="31" endline="31" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f39:31" file="f39" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2291" name="delete" returns="_635" static="1" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShapedlEPv" demangled="btConvexTriangleMeshShape::operator delete(void*)" location="f39:31" file="f39" line="31" endline="31" inline="1">
    <Argument name="ptr" type="_1077" location="f39:31" file="f39" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2292" name="new" returns="_1077" static="1" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShapenwEmPv" demangled="btConvexTriangleMeshShape::operator new(unsigned long, void*)" location="f39:31" file="f39" line="31" endline="31" inline="1">
    <Argument type="_1165" location="f39:31" file="f39" line="31"/>
    <Argument name="ptr" type="_1077" location="f39:31" file="f39" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2293" name="delete" returns="_635" static="1" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShapedlEPvS0_" demangled="btConvexTriangleMeshShape::operator delete(void*, void*)" location="f39:31" file="f39" line="31" inline="1">
    <Argument type="_1077" location="f39:31" file="f39" line="31"/>
    <Argument type="_1077" location="f39:31" file="f39" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2294" name="new []" returns="_1077" static="1" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShapenaEm" demangled="btConvexTriangleMeshShape::operator new[](unsigned long)" location="f39:31" file="f39" line="31" endline="31" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f39:31" file="f39" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2295" name="delete []" returns="_635" static="1" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShapedaEPv" demangled="btConvexTriangleMeshShape::operator delete[](void*)" location="f39:31" file="f39" line="31" endline="31" inline="1">
    <Argument name="ptr" type="_1077" location="f39:31" file="f39" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2296" name="new []" returns="_1077" static="1" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShapenaEmPv" demangled="btConvexTriangleMeshShape::operator new[](unsigned long, void*)" location="f39:31" file="f39" line="31" endline="31" inline="1">
    <Argument type="_1165" location="f39:31" file="f39" line="31"/>
    <Argument name="ptr" type="_1077" location="f39:31" file="f39" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2297" name="delete []" returns="_635" static="1" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShapedaEPvS0_" demangled="btConvexTriangleMeshShape::operator delete[](void*, void*)" location="f39:31" file="f39" line="31" inline="1">
    <Argument type="_1077" location="f39:31" file="f39" line="31"/>
    <Argument type="_1077" location="f39:31" file="f39" line="31"/>
  </OperatorMethod>
  <Constructor id="_2298" name="btConvexTriangleMeshShape" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShapeC1EP23btStridingMeshInterfaceb *INTERNAL* " demangled="btConvexTriangleMeshShape::btConvexTriangleMeshShape(btStridingMeshInterface*, bool)" location="f39:33" file="f39" line="33" extern="1">
    <Argument name="meshInterface" type="_8950" location="f39:33" file="f39" line="33"/>
    <Argument name="calcAabb" type="_1834" location="f39:33" file="f39" line="33" default="true"/>
  </Constructor>
  <Method id="_2299" name="getMeshInterface" returns="_8950" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShape16getMeshInterfaceEv" demangled="btConvexTriangleMeshShape::getMeshInterface()" location="f39:35" file="f39" line="35" endline="37" inline="1"/>
  <Method id="_2300" name="getMeshInterface" returns="_9018" const="1" context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape16getMeshInterfaceEv" demangled="btConvexTriangleMeshShape::getMeshInterface() const" location="f39:39" file="f39" line="39" endline="41" inline="1"/>
  <Method id="_2301" name="localGetSupportingVertex" returns="_193" const="1" virtual="1" overrides="_5348 " context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape24localGetSupportingVertexERK9btVector3" demangled="btConvexTriangleMeshShape::localGetSupportingVertex(btVector3 const&amp;) const" location="f39:44" file="f39" line="44" extern="1">
    <Argument name="vec" type="_1824" location="f39:44" file="f39" line="44"/>
  </Method>
  <Method id="_2302" name="localGetSupportingVertexWithoutMargin" returns="_193" const="1" virtual="1" overrides="_5495 " context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape37localGetSupportingVertexWithoutMarginERK9btVector3" demangled="btConvexTriangleMeshShape::localGetSupportingVertexWithoutMargin(btVector3 const&amp;) const" location="f39:45" file="f39" line="45" extern="1">
    <Argument name="vec" type="_1824" location="f39:45" file="f39" line="45"/>
  </Method>
  <Method id="_2303" name="batchedUnitVectorGetSupportingVertexWithoutMargin" returns="_635" const="1" virtual="1" overrides="_5496 " context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape49batchedUnitVectorGetSupportingVertexWithoutMarginEPK9btVector3PS0_i" demangled="btConvexTriangleMeshShape::batchedUnitVectorGetSupportingVertexWithoutMargin(btVector3 const*, btVector3*, int) const" location="f39:46" file="f39" line="46" extern="1">
    <Argument name="vectors" type="_4306" location="f39:46" file="f39" line="46"/>
    <Argument name="supportVerticesOut" type="_4309" location="f39:46" file="f39" line="46"/>
    <Argument name="numVectors" type="_168" location="f39:46" file="f39" line="46"/>
  </Method>
  <Method id="_2304" name="getName" returns="_1823" const="1" virtual="1" overrides="_2525 " context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape7getNameEv" demangled="btConvexTriangleMeshShape::getName() const" location="f39:49" file="f39" line="49" endline="49" inline="1"/>
  <Method id="_2305" name="getNumVertices" returns="_168" const="1" virtual="1" overrides="_5498 " context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape14getNumVerticesEv" demangled="btConvexTriangleMeshShape::getNumVertices() const" location="f39:51" file="f39" line="51" extern="1"/>
  <Method id="_2306" name="getNumEdges" returns="_168" const="1" virtual="1" overrides="_5499 " context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape11getNumEdgesEv" demangled="btConvexTriangleMeshShape::getNumEdges() const" location="f39:52" file="f39" line="52" extern="1"/>
  <Method id="_2307" name="getEdge" returns="_635" const="1" virtual="1" overrides="_5500 " context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape7getEdgeEiR9btVector3S1_" demangled="btConvexTriangleMeshShape::getEdge(int, btVector3&amp;, btVector3&amp;) const" location="f39:53" file="f39" line="53" extern="1">
    <Argument name="i" type="_168" location="f39:53" file="f39" line="53"/>
    <Argument name="pa" type="_2535" location="f39:53" file="f39" line="53"/>
    <Argument name="pb" type="_2535" location="f39:53" file="f39" line="53"/>
  </Method>
  <Method id="_2308" name="getVertex" returns="_635" const="1" virtual="1" overrides="_5501 " context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape9getVertexEiR9btVector3" demangled="btConvexTriangleMeshShape::getVertex(int, btVector3&amp;) const" location="f39:54" file="f39" line="54" extern="1">
    <Argument name="i" type="_168" location="f39:54" file="f39" line="54"/>
    <Argument name="vtx" type="_2535" location="f39:54" file="f39" line="54"/>
  </Method>
  <Method id="_2309" name="getNumPlanes" returns="_168" const="1" virtual="1" overrides="_5502 " context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape12getNumPlanesEv" demangled="btConvexTriangleMeshShape::getNumPlanes() const" location="f39:55" file="f39" line="55" extern="1"/>
  <Method id="_2310" name="getPlane" returns="_635" const="1" virtual="1" overrides="_5503 " context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape8getPlaneER9btVector3S1_i" demangled="btConvexTriangleMeshShape::getPlane(btVector3&amp;, btVector3&amp;, int) const" location="f39:56" file="f39" line="56" extern="1">
    <Argument name="planeNormal" type="_2535" location="f39:56" file="f39" line="56"/>
    <Argument name="planeSupport" type="_2535" location="f39:56" file="f39" line="56"/>
    <Argument name="i" type="_168" location="f39:56" file="f39" line="56"/>
  </Method>
  <Method id="_2311" name="isInside" returns="_1834" const="1" virtual="1" overrides="_5504 " context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape8isInsideERK9btVector3f" demangled="btConvexTriangleMeshShape::isInside(btVector3 const&amp;, float) const" location="f39:57" file="f39" line="57" extern="1">
    <Argument name="pt" type="_1824" location="f39:57" file="f39" line="57"/>
    <Argument name="tolerance" type="_362" location="f39:57" file="f39" line="57"/>
  </Method>
  <Method id="_2312" name="setLocalScaling" returns="_635" virtual="1" overrides="_5980 " context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShape15setLocalScalingERK9btVector3" demangled="btConvexTriangleMeshShape::setLocalScaling(btVector3 const&amp;)" location="f39:60" file="f39" line="60" extern="1">
    <Argument name="scaling" type="_1824" location="f39:60" file="f39" line="60"/>
  </Method>
  <Method id="_2313" name="getLocalScaling" returns="_1824" const="1" virtual="1" overrides="_5356 " context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape15getLocalScalingEv" demangled="btConvexTriangleMeshShape::getLocalScaling() const" location="f39:61" file="f39" line="61" extern="1"/>
  <Method id="_2314" name="calculatePrincipalAxisTransform" returns="_635" const="1" context="_139" access="public" mangled="_ZNK25btConvexTriangleMeshShape31calculatePrincipalAxisTransformER11btTransformR9btVector3Rf" demangled="btConvexTriangleMeshShape::calculatePrincipalAxisTransform(btTransform&amp;, btVector3&amp;, float&amp;) const" location="f39:68" file="f39" line="68" extern="1">
    <Argument name="principal" type="_8994" location="f39:68" file="f39" line="68"/>
    <Argument name="inertia" type="_2535" location="f39:68" file="f39" line="68"/>
    <Argument name="volume" type="_3326" location="f39:68" file="f39" line="68"/>
  </Method>
  <Destructor id="_2315" name="btConvexTriangleMeshShape" virtual="1" overrides="_5983 " artificial="1" context="_139" access="public" mangled="_ZN25btConvexTriangleMeshShapeD1Ev *INTERNAL* " demangled="btConvexTriangleMeshShape::~btConvexTriangleMeshShape()" location="f39:26" file="f39" line="26" endline="26" inline="1">
  </Destructor>
  <CvQualifiedType id="_1077r" type="_1077" restrict="1"/>
  <FundamentalType id="_2317" name="complex double" size="128" align="64"/>
  <PointerType id="_2318" type="_1825" size="64" align="64"/>
  <PointerType id="_2319" type="_1969c" size="64" align="64"/>
  <CvQualifiedType id="_2319r" type="_2319" restrict="1"/>
  <Field id="_2321" name="m_manifoldPtr" type="_4408" offset="64" context="_171" access="protected" location="f54:43" file="f54" line="43"/>
  <Field id="_2322" name="m_body0Wrap" type="_9020" offset="128" context="_171" access="protected" location="f54:45" file="f54" line="45"/>
  <Field id="_2323" name="m_body1Wrap" type="_9020" offset="192" context="_171" access="protected" location="f54:46" file="f54" line="46"/>
  <Field id="_2324" name="m_partId0" type="_168" offset="256" context="_171" access="protected" location="f54:47" file="f54" line="47"/>
  <Field id="_2325" name="m_partId1" type="_168" offset="288" context="_171" access="protected" location="f54:48" file="f54" line="48"/>
  <Field id="_2326" name="m_index0" type="_168" offset="320" context="_171" access="protected" location="f54:49" file="f54" line="49"/>
  <Field id="_2327" name="m_index1" type="_168" offset="352" context="_171" access="protected" location="f54:50" file="f54" line="50"/>
  <OperatorMethod id="_2328" name="=" returns="_9021" artificial="1" throw="" context="_171" access="public" mangled="_ZN16btManifoldResultaSERKS_" demangled="btManifoldResult::operator=(btManifoldResult const&amp;)" location="f54:40" file="f54" line="40" endline="40" inline="1">
    <Argument type="_9022" location="f54:40" file="f54" line="40"/>
  </OperatorMethod>
  <Constructor id="_2329" name="btManifoldResult" artificial="1" throw="" context="_171" access="public" mangled="_ZN16btManifoldResultC1ERKS_ *INTERNAL* " demangled="btManifoldResult::btManifoldResult(btManifoldResult const&amp;)" location="f54:40" file="f54" line="40" endline="40" inline="1">
    <Argument type="_9022" location="f54:40" file="f54" line="40"/>
  </Constructor>
  <Constructor id="_2330" name="btManifoldResult" explicit="1" context="_171" access="public" mangled="_ZN16btManifoldResultC1Ev *INTERNAL* " demangled="btManifoldResult::btManifoldResult()" location="f54:55" file="f54" line="55" endline="64" inline="1"/>
  <Constructor id="_2331" name="btManifoldResult" explicit="1" context="_171" access="public" mangled="_ZN16btManifoldResultC1EPK24btCollisionObjectWrapperS2_ *INTERNAL* " demangled="btManifoldResult::btManifoldResult(btCollisionObjectWrapper const*, btCollisionObjectWrapper const*)" location="f54:66" file="f54" line="66" extern="1">
    <Argument name="body0Wrap" type="_9020" location="f54:66" file="f54" line="66"/>
    <Argument name="body1Wrap" type="_9020" location="f54:66" file="f54" line="66"/>
  </Constructor>
  <Destructor id="_2332" name="btManifoldResult" virtual="1" overrides="_9023 " context="_171" access="public" mangled="_ZN16btManifoldResultD1Ev *INTERNAL* " demangled="btManifoldResult::~btManifoldResult()" location="f54:68" file="f54" line="68" endline="68" inline="1">
  </Destructor>
  <Method id="_2333" name="setPersistentManifold" returns="_635" context="_171" access="public" mangled="_ZN16btManifoldResult21setPersistentManifoldEP20btPersistentManifold" demangled="btManifoldResult::setPersistentManifold(btPersistentManifold*)" location="f54:70" file="f54" line="70" endline="72" inline="1">
    <Argument name="manifoldPtr" type="_4408" location="f54:70" file="f54" line="70"/>
  </Method>
  <Method id="_2334" name="getPersistentManifold" returns="_9024" const="1" context="_171" access="public" mangled="_ZNK16btManifoldResult21getPersistentManifoldEv" demangled="btManifoldResult::getPersistentManifold() const" location="f54:75" file="f54" line="75" endline="77" inline="1"/>
  <Method id="_2335" name="getPersistentManifold" returns="_4408" context="_171" access="public" mangled="_ZN16btManifoldResult21getPersistentManifoldEv" demangled="btManifoldResult::getPersistentManifold()" location="f54:79" file="f54" line="79" endline="81" inline="1"/>
  <Method id="_2336" name="setShapeIdentifiersA" returns="_635" virtual="1" overrides="_9025 " context="_171" access="public" mangled="_ZN16btManifoldResult20setShapeIdentifiersAEii" demangled="btManifoldResult::setShapeIdentifiersA(int, int)" location="f54:84" file="f54" line="84" endline="87" inline="1">
    <Argument name="partId0" type="_168" location="f54:84" file="f54" line="84"/>
    <Argument name="index0" type="_168" location="f54:84" file="f54" line="84"/>
  </Method>
  <Method id="_2337" name="setShapeIdentifiersB" returns="_635" virtual="1" overrides="_9026 " context="_171" access="public" mangled="_ZN16btManifoldResult20setShapeIdentifiersBEii" demangled="btManifoldResult::setShapeIdentifiersB(int, int)" location="f54:90" file="f54" line="90" endline="93" inline="1">
    <Argument name="partId1" type="_168" location="f54:90" file="f54" line="90"/>
    <Argument name="index1" type="_168" location="f54:90" file="f54" line="90"/>
  </Method>
  <Method id="_2338" name="addContactPoint" returns="_635" virtual="1" overrides="_9027 " context="_171" access="public" mangled="_ZN16btManifoldResult15addContactPointERK9btVector3S2_f" demangled="btManifoldResult::addContactPoint(btVector3 const&amp;, btVector3 const&amp;, float)" location="f54:97" file="f54" line="97" extern="1">
    <Argument name="normalOnBInWorld" type="_1824" location="f54:97" file="f54" line="97"/>
    <Argument name="pointInWorld" type="_1824" location="f54:97" file="f54" line="97"/>
    <Argument name="depth" type="_362" location="f54:97" file="f54" line="97"/>
  </Method>
  <Method id="_2339" name="refreshContactPoints" returns="_635" context="_171" access="public" mangled="_ZN16btManifoldResult20refreshContactPointsEv" demangled="btManifoldResult::refreshContactPoints()" location="f54:99" file="f54" line="99" endline="107" inline="1"/>
  <Method id="_2340" name="getBody0Wrap" returns="_9020" const="1" context="_171" access="public" mangled="_ZNK16btManifoldResult12getBody0WrapEv" demangled="btManifoldResult::getBody0Wrap() const" location="f54:116" file="f54" line="116" endline="118" inline="1"/>
  <Method id="_2341" name="getBody1Wrap" returns="_9020" const="1" context="_171" access="public" mangled="_ZNK16btManifoldResult12getBody1WrapEv" demangled="btManifoldResult::getBody1Wrap() const" location="f54:120" file="f54" line="120" endline="122" inline="1"/>
  <Method id="_2342" name="setBody0Wrap" returns="_635" context="_171" access="public" mangled="_ZN16btManifoldResult12setBody0WrapEPK24btCollisionObjectWrapper" demangled="btManifoldResult::setBody0Wrap(btCollisionObjectWrapper const*)" location="f54:125" file="f54" line="125" endline="127" inline="1">
    <Argument name="obj0Wrap" type="_9020" location="f54:125" file="f54" line="125"/>
  </Method>
  <Method id="_2343" name="setBody1Wrap" returns="_635" context="_171" access="public" mangled="_ZN16btManifoldResult12setBody1WrapEPK24btCollisionObjectWrapper" demangled="btManifoldResult::setBody1Wrap(btCollisionObjectWrapper const*)" location="f54:130" file="f54" line="130" endline="132" inline="1">
    <Argument name="obj1Wrap" type="_9020" location="f54:130" file="f54" line="130"/>
  </Method>
  <Method id="_2344" name="getBody0Internal" returns="_4331" const="1" context="_171" access="public" mangled="_ZNK16btManifoldResult16getBody0InternalEv" demangled="btManifoldResult::getBody0Internal() const" location="f54:135" file="f54" line="135" endline="137" inline="1"/>
  <Method id="_2345" name="getBody1Internal" returns="_4331" const="1" context="_171" access="public" mangled="_ZNK16btManifoldResult16getBody1InternalEv" demangled="btManifoldResult::getBody1Internal() const" location="f54:140" file="f54" line="140" endline="142" inline="1"/>
  <Method id="_2346" name="calculateCombinedRestitution" returns="_362" static="1" context="_171" access="public" mangled="_ZN16btManifoldResult28calculateCombinedRestitutionEPK17btCollisionObjectS2_" demangled="btManifoldResult::calculateCombinedRestitution(btCollisionObject const*, btCollisionObject const*)" location="f54:146" file="f54" line="146" extern="1">
    <Argument name="body0" type="_4331" location="f54:146" file="f54" line="146"/>
    <Argument name="body1" type="_4331" location="f54:146" file="f54" line="146"/>
  </Method>
  <Method id="_2347" name="calculateCombinedFriction" returns="_362" static="1" context="_171" access="public" mangled="_ZN16btManifoldResult25calculateCombinedFrictionEPK17btCollisionObjectS2_" demangled="btManifoldResult::calculateCombinedFriction(btCollisionObject const*, btCollisionObject const*)" location="f54:147" file="f54" line="147" extern="1">
    <Argument name="body0" type="_4331" location="f54:147" file="f54" line="147"/>
    <Argument name="body1" type="_4331" location="f54:147" file="f54" line="147"/>
  </Method>
  <Struct id="_2348" name="Result" context="_602" access="public" abstract="1" mangled="N36btDiscreteCollisionDetectorInterface6ResultE" demangled="btDiscreteCollisionDetectorInterface::Result" location="f79:32" file="f79" line="32" artificial="1" size="64" align="64" members="_9028 _9029 _9030 _9023 _9025 _9026 _9027 " bases=""/>
  <Field id="_2349" name="m_allocator" type="_572" offset="0" context="_174" access="private" location="f55:49" file="f55" line="49"/>
  <Field id="_2350" name="m_size" type="_168" offset="32" context="_174" access="private" location="f55:51" file="f55" line="51"/>
  <Field id="_2351" name="m_capacity" type="_168" offset="64" context="_174" access="private" location="f55:52" file="f55" line="52"/>
  <Field id="_2352" name="m_data" type="_4347" offset="128" context="_174" access="private" location="f55:53" file="f55" line="53"/>
  <Field id="_2353" name="m_ownsMemory" type="_1834" offset="192" context="_174" access="private" location="f55:55" file="f55" line="55"/>
  <Class id="_2354" name="less" context="_174" access="public" incomplete="1" mangled="N20btAlignedObjectArrayIP17btCollisionObjectE4lessE" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::less" location="f55:324" file="f55" line="324" artificial="1" align="8"/>
  <OperatorMethod id="_2355" name="=" returns="_9031" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectEaSERKS2_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::operator=(btAlignedObjectArray&lt;btCollisionObject*&gt; const&amp;)" location="f55:59" file="f55" line="59" inline="1">
    <Argument name="other" type="_9032" location="f55:59" file="f55" line="59"/>
  </OperatorMethod>
  <Method id="_2356" name="allocSize" returns="_168" context="_174" access="protected" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE9allocSizeEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::allocSize(int)" location="f55:70" file="f55" line="70" extern="1" inline="1">
    <Argument name="size" type="_168" location="f55:70" file="f55" line="70"/>
  </Method>
  <Method id="_2357" name="copy" returns="_635" const="1" context="_174" access="protected" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectE4copyEiiPS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::copy(int, int, btCollisionObject**) const" location="f55:74" file="f55" line="74" extern="1" inline="1">
    <Argument name="start" type="_168" location="f55:74" file="f55" line="74"/>
    <Argument name="end" type="_168" location="f55:74" file="f55" line="74"/>
    <Argument name="dest" type="_4347" location="f55:74" file="f55" line="74"/>
  </Method>
  <Method id="_2358" name="init" returns="_635" context="_174" access="protected" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE4initEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::init()" location="f55:85" file="f55" line="85" extern="1" inline="1"/>
  <Method id="_2359" name="destroy" returns="_635" context="_174" access="protected" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE7destroyEii" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::destroy(int, int)" location="f55:93" file="f55" line="93" extern="1" inline="1">
    <Argument name="first" type="_168" location="f55:93" file="f55" line="93"/>
    <Argument name="last" type="_168" location="f55:93" file="f55" line="93"/>
  </Method>
  <Method id="_2360" name="allocate" returns="_1077" context="_174" access="protected" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE8allocateEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::allocate(int)" location="f55:102" file="f55" line="102" extern="1" inline="1">
    <Argument name="size" type="_168" location="f55:102" file="f55" line="102"/>
  </Method>
  <Method id="_2361" name="deallocate" returns="_635" context="_174" access="protected" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE10deallocateEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::deallocate()" location="f55:109" file="f55" line="109" extern="1" inline="1"/>
  <Constructor id="_2362" name="btAlignedObjectArray" explicit="1" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectEC1Ev *INTERNAL* " demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::btAlignedObjectArray()" location="f55:126" file="f55" line="126" extern="1" inline="1"/>
  <Destructor id="_2363" name="btAlignedObjectArray" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectED1Ev *INTERNAL* " demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::~btAlignedObjectArray()" location="f55:131" file="f55" line="131" inline="1">
  </Destructor>
  <Constructor id="_2364" name="btAlignedObjectArray" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectEC1ERKS2_ *INTERNAL* " demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::btAlignedObjectArray(btAlignedObjectArray&lt;btCollisionObject*&gt; const&amp;)" location="f55:137" file="f55" line="137" inline="1">
    <Argument name="otherArray" type="_9032" location="f55:137" file="f55" line="137"/>
  </Constructor>
  <Method id="_2365" name="size" returns="_168" const="1" context="_174" access="public" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectE4sizeEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::size() const" location="f55:149" file="f55" line="149" inline="1"/>
  <Method id="_2366" name="at" returns="_4345" const="1" context="_174" access="public" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectE2atEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::at(int) const" location="f55:154" file="f55" line="154" extern="1" inline="1">
    <Argument name="n" type="_168" location="f55:154" file="f55" line="154"/>
  </Method>
  <Method id="_2367" name="at" returns="_4349" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE2atEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::at(int)" location="f55:161" file="f55" line="161" extern="1" inline="1">
    <Argument name="n" type="_168" location="f55:161" file="f55" line="161"/>
  </Method>
  <OperatorMethod id="_2368" name="[]" returns="_4345" const="1" context="_174" access="public" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectEixEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::operator[](int) const" location="f55:168" file="f55" line="168" extern="1" inline="1">
    <Argument name="n" type="_168" location="f55:168" file="f55" line="168"/>
  </OperatorMethod>
  <OperatorMethod id="_2369" name="[]" returns="_4349" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectEixEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::operator[](int)" location="f55:175" file="f55" line="175" extern="1" inline="1">
    <Argument name="n" type="_168" location="f55:175" file="f55" line="175"/>
  </OperatorMethod>
  <Method id="_2370" name="clear" returns="_635" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE5clearEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::clear()" location="f55:184" file="f55" line="184" extern="1" inline="1"/>
  <Method id="_2371" name="pop_back" returns="_635" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE8pop_backEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::pop_back()" location="f55:193" file="f55" line="193" extern="1" inline="1"/>
  <Method id="_2372" name="resizeNoInitialize" returns="_635" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE18resizeNoInitializeEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::resizeNoInitialize(int)" location="f55:203" file="f55" line="203" extern="1" inline="1">
    <Argument name="newsize" type="_168" location="f55:203" file="f55" line="203"/>
  </Method>
  <Method id="_2373" name="resize" returns="_635" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE6resizeEiRKS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::resize(int, btCollisionObject* const&amp;)" location="f55:220" file="f55" line="220" extern="1" inline="1">
    <Argument name="newsize" type="_168" location="f55:220" file="f55" line="220"/>
    <Argument name="fillData" type="_4345" location="f55:220" file="f55" line="220" default="T()"/>
  </Method>
  <Method id="_2374" name="expandNonInitializing" returns="_4349" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE21expandNonInitializingEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::expandNonInitializing()" location="f55:247" file="f55" line="247" extern="1" inline="1"/>
  <Method id="_2375" name="expand" returns="_4349" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE6expandERKS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::expand(btCollisionObject* const&amp;)" location="f55:260" file="f55" line="260" extern="1" inline="1">
    <Argument name="fillValue" type="_4345" location="f55:260" file="f55" line="260" default="T()"/>
  </Method>
  <Method id="_2376" name="push_back" returns="_635" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE9push_backERKS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::push_back(btCollisionObject* const&amp;)" location="f55:276" file="f55" line="276" extern="1" inline="1">
    <Argument name="_Val" type="_4345" location="f55:276" file="f55" line="276"/>
  </Method>
  <Method id="_2377" name="capacity" returns="_168" const="1" context="_174" access="public" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectE8capacityEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::capacity() const" location="f55:295" file="f55" line="295" extern="1" inline="1"/>
  <Method id="_2378" name="reserve" returns="_635" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE7reserveEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::reserve(int)" location="f55:300" file="f55" line="300" extern="1" inline="1">
    <Argument name="_Count" type="_168" location="f55:300" file="f55" line="300"/>
  </Method>
  <Method id="_2379" name="swap" returns="_635" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE4swapEii" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::swap(int, int)" location="f55:407" file="f55" line="407" extern="1" inline="1">
    <Argument name="index0" type="_168" location="f55:407" file="f55" line="407"/>
    <Argument name="index1" type="_168" location="f55:407" file="f55" line="407"/>
  </Method>
  <Method id="_2380" name="findBinarySearch" returns="_168" const="1" context="_174" access="public" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectE16findBinarySearchERKS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::findBinarySearch(btCollisionObject* const&amp;) const" location="f55:446" file="f55" line="446" extern="1" inline="1">
    <Argument name="key" type="_4345" location="f55:446" file="f55" line="446"/>
  </Method>
  <Method id="_2381" name="findLinearSearch" returns="_168" const="1" context="_174" access="public" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectE16findLinearSearchERKS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::findLinearSearch(btCollisionObject* const&amp;) const" location="f55:465" file="f55" line="465" extern="1" inline="1">
    <Argument name="key" type="_4345" location="f55:465" file="f55" line="465"/>
  </Method>
  <Method id="_2382" name="remove" returns="_635" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE6removeERKS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::remove(btCollisionObject* const&amp;)" location="f55:481" file="f55" line="481" extern="1" inline="1">
    <Argument name="key" type="_4345" location="f55:481" file="f55" line="481"/>
  </Method>
  <Method id="_2383" name="initializeFromBuffer" returns="_635" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE20initializeFromBufferEPvii" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::initializeFromBuffer(void*, int, int)" location="f55:493" file="f55" line="493" extern="1" inline="1">
    <Argument name="buffer" type="_1077" location="f55:493" file="f55" line="493"/>
    <Argument name="size" type="_168" location="f55:493" file="f55" line="493"/>
    <Argument name="capacity" type="_168" location="f55:493" file="f55" line="493"/>
  </Method>
  <Method id="_2384" name="copyFromArray" returns="_635" context="_174" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE13copyFromArrayERKS2_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::copyFromArray(btAlignedObjectArray&lt;btCollisionObject*&gt; const&amp;)" location="f55:502" file="f55" line="502" extern="1" inline="1">
    <Argument name="otherArray" type="_9032" location="f55:502" file="f55" line="502"/>
  </Method>
  <Field id="_2385" name="m_allocator" type="_540" offset="0" context="_177" access="private" location="f55:49" file="f55" line="49"/>
  <Field id="_2386" name="m_size" type="_168" offset="32" context="_177" access="private" location="f55:51" file="f55" line="51"/>
  <Field id="_2387" name="m_capacity" type="_168" offset="64" context="_177" access="private" location="f55:52" file="f55" line="52"/>
  <Field id="_2388" name="m_data" type="_3737" offset="128" context="_177" access="private" location="f55:53" file="f55" line="53"/>
  <Field id="_2389" name="m_ownsMemory" type="_1834" offset="192" context="_177" access="private" location="f55:55" file="f55" line="55"/>
  <Class id="_2390" name="less" context="_177" access="public" incomplete="1" mangled="N20btAlignedObjectArrayI18btSolverConstraintE4lessE" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::less" location="f55:324" file="f55" line="324" artificial="1" align="8"/>
  <OperatorMethod id="_2391" name="=" returns="_9033" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintEaSERKS1_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::operator=(btAlignedObjectArray&lt;btSolverConstraint&gt; const&amp;)" location="f55:59" file="f55" line="59" inline="1">
    <Argument name="other" type="_9034" location="f55:59" file="f55" line="59"/>
  </OperatorMethod>
  <Method id="_2392" name="allocSize" returns="_168" context="_177" access="protected" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE9allocSizeEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::allocSize(int)" location="f55:70" file="f55" line="70" extern="1" inline="1">
    <Argument name="size" type="_168" location="f55:70" file="f55" line="70"/>
  </Method>
  <Method id="_2393" name="copy" returns="_635" const="1" context="_177" access="protected" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintE4copyEiiPS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::copy(int, int, btSolverConstraint*) const" location="f55:74" file="f55" line="74" extern="1" inline="1">
    <Argument name="start" type="_168" location="f55:74" file="f55" line="74"/>
    <Argument name="end" type="_168" location="f55:74" file="f55" line="74"/>
    <Argument name="dest" type="_3737" location="f55:74" file="f55" line="74"/>
  </Method>
  <Method id="_2394" name="init" returns="_635" context="_177" access="protected" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE4initEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::init()" location="f55:85" file="f55" line="85" extern="1" inline="1"/>
  <Method id="_2395" name="destroy" returns="_635" context="_177" access="protected" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE7destroyEii" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::destroy(int, int)" location="f55:93" file="f55" line="93" extern="1" inline="1">
    <Argument name="first" type="_168" location="f55:93" file="f55" line="93"/>
    <Argument name="last" type="_168" location="f55:93" file="f55" line="93"/>
  </Method>
  <Method id="_2396" name="allocate" returns="_1077" context="_177" access="protected" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE8allocateEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::allocate(int)" location="f55:102" file="f55" line="102" extern="1" inline="1">
    <Argument name="size" type="_168" location="f55:102" file="f55" line="102"/>
  </Method>
  <Method id="_2397" name="deallocate" returns="_635" context="_177" access="protected" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE10deallocateEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::deallocate()" location="f55:109" file="f55" line="109" extern="1" inline="1"/>
  <Constructor id="_2398" name="btAlignedObjectArray" explicit="1" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintEC1Ev *INTERNAL* " demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::btAlignedObjectArray()" location="f55:126" file="f55" line="126" extern="1" inline="1"/>
  <Destructor id="_2399" name="btAlignedObjectArray" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintED1Ev *INTERNAL* " demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::~btAlignedObjectArray()" location="f55:131" file="f55" line="131" inline="1">
  </Destructor>
  <Constructor id="_2400" name="btAlignedObjectArray" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintEC1ERKS1_ *INTERNAL* " demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::btAlignedObjectArray(btAlignedObjectArray&lt;btSolverConstraint&gt; const&amp;)" location="f55:137" file="f55" line="137" inline="1">
    <Argument name="otherArray" type="_9034" location="f55:137" file="f55" line="137"/>
  </Constructor>
  <Method id="_2401" name="size" returns="_168" const="1" context="_177" access="public" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintE4sizeEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::size() const" location="f55:149" file="f55" line="149" extern="1" inline="1"/>
  <Method id="_2402" name="at" returns="_3735" const="1" context="_177" access="public" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintE2atEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::at(int) const" location="f55:154" file="f55" line="154" extern="1" inline="1">
    <Argument name="n" type="_168" location="f55:154" file="f55" line="154"/>
  </Method>
  <Method id="_2403" name="at" returns="_3739" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE2atEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::at(int)" location="f55:161" file="f55" line="161" extern="1" inline="1">
    <Argument name="n" type="_168" location="f55:161" file="f55" line="161"/>
  </Method>
  <OperatorMethod id="_2404" name="[]" returns="_3735" const="1" context="_177" access="public" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintEixEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::operator[](int) const" location="f55:168" file="f55" line="168" extern="1" inline="1">
    <Argument name="n" type="_168" location="f55:168" file="f55" line="168"/>
  </OperatorMethod>
  <OperatorMethod id="_2405" name="[]" returns="_3739" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintEixEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::operator[](int)" location="f55:175" file="f55" line="175" extern="1" inline="1">
    <Argument name="n" type="_168" location="f55:175" file="f55" line="175"/>
  </OperatorMethod>
  <Method id="_2406" name="clear" returns="_635" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE5clearEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::clear()" location="f55:184" file="f55" line="184" extern="1" inline="1"/>
  <Method id="_2407" name="pop_back" returns="_635" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE8pop_backEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::pop_back()" location="f55:193" file="f55" line="193" extern="1" inline="1"/>
  <Method id="_2408" name="resizeNoInitialize" returns="_635" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE18resizeNoInitializeEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::resizeNoInitialize(int)" location="f55:203" file="f55" line="203" extern="1" inline="1">
    <Argument name="newsize" type="_168" location="f55:203" file="f55" line="203"/>
  </Method>
  <Method id="_2409" name="resize" returns="_635" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE6resizeEiRKS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::resize(int, btSolverConstraint const&amp;)" location="f55:220" file="f55" line="220" extern="1" inline="1">
    <Argument name="newsize" type="_168" location="f55:220" file="f55" line="220"/>
    <Argument name="fillData" type="_3735" location="f55:220" file="f55" line="220" default="T()"/>
  </Method>
  <Method id="_2410" name="expandNonInitializing" returns="_3739" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE21expandNonInitializingEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::expandNonInitializing()" location="f55:247" file="f55" line="247" extern="1" inline="1"/>
  <Method id="_2411" name="expand" returns="_3739" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE6expandERKS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::expand(btSolverConstraint const&amp;)" location="f55:260" file="f55" line="260" extern="1" inline="1">
    <Argument name="fillValue" type="_3735" location="f55:260" file="f55" line="260" default="T()"/>
  </Method>
  <Method id="_2412" name="push_back" returns="_635" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE9push_backERKS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::push_back(btSolverConstraint const&amp;)" location="f55:276" file="f55" line="276" extern="1" inline="1">
    <Argument name="_Val" type="_3735" location="f55:276" file="f55" line="276"/>
  </Method>
  <Method id="_2413" name="capacity" returns="_168" const="1" context="_177" access="public" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintE8capacityEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::capacity() const" location="f55:295" file="f55" line="295" extern="1" inline="1"/>
  <Method id="_2414" name="reserve" returns="_635" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE7reserveEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::reserve(int)" location="f55:300" file="f55" line="300" extern="1" inline="1">
    <Argument name="_Count" type="_168" location="f55:300" file="f55" line="300"/>
  </Method>
  <Method id="_2415" name="swap" returns="_635" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE4swapEii" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::swap(int, int)" location="f55:407" file="f55" line="407" extern="1" inline="1">
    <Argument name="index0" type="_168" location="f55:407" file="f55" line="407"/>
    <Argument name="index1" type="_168" location="f55:407" file="f55" line="407"/>
  </Method>
  <Method id="_2416" name="findBinarySearch" returns="_168" const="1" context="_177" access="public" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintE16findBinarySearchERKS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::findBinarySearch(btSolverConstraint const&amp;) const" location="f55:446" file="f55" line="446" extern="1" inline="1">
    <Argument name="key" type="_3735" location="f55:446" file="f55" line="446"/>
  </Method>
  <Method id="_2417" name="findLinearSearch" returns="_168" const="1" context="_177" access="public" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintE16findLinearSearchERKS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::findLinearSearch(btSolverConstraint const&amp;) const" location="f55:465" file="f55" line="465" extern="1" inline="1">
    <Argument name="key" type="_3735" location="f55:465" file="f55" line="465"/>
  </Method>
  <Method id="_2418" name="remove" returns="_635" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE6removeERKS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::remove(btSolverConstraint const&amp;)" location="f55:481" file="f55" line="481" extern="1" inline="1">
    <Argument name="key" type="_3735" location="f55:481" file="f55" line="481"/>
  </Method>
  <Method id="_2419" name="initializeFromBuffer" returns="_635" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE20initializeFromBufferEPvii" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::initializeFromBuffer(void*, int, int)" location="f55:493" file="f55" line="493" extern="1" inline="1">
    <Argument name="buffer" type="_1077" location="f55:493" file="f55" line="493"/>
    <Argument name="size" type="_168" location="f55:493" file="f55" line="493"/>
    <Argument name="capacity" type="_168" location="f55:493" file="f55" line="493"/>
  </Method>
  <Method id="_2420" name="copyFromArray" returns="_635" context="_177" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE13copyFromArrayERKS1_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::copyFromArray(btAlignedObjectArray&lt;btSolverConstraint&gt; const&amp;)" location="f55:502" file="f55" line="502" extern="1" inline="1">
    <Argument name="otherArray" type="_9034" location="f55:502" file="f55" line="502"/>
  </Method>
  <Field id="_2421" name="m_floats" type="_9035" offset="0" context="_193" access="public" location="f3:112" file="f3" line="112"/>
  <Destructor id="_2422" name="btVector3" artificial="1" throw="" context="_193" access="public" mangled="_ZN9btVector3D1Ev *INTERNAL* " demangled="btVector3::~btVector3()" location="f3:84" file="f3" line="84" endline="84" inline="1">
  </Destructor>
  <OperatorMethod id="_2423" name="=" returns="_2535" artificial="1" throw="" context="_193" access="public" mangled="_ZN9btVector3aSERKS_" demangled="btVector3::operator=(btVector3 const&amp;)" location="f3:84" file="f3" line="84" endline="84" inline="1">
    <Argument type="_1824" location="f3:84" file="f3" line="84"/>
  </OperatorMethod>
  <Constructor id="_2424" name="btVector3" artificial="1" throw="" context="_193" access="public" mangled="_ZN9btVector3C1ERKS_ *INTERNAL* " demangled="btVector3::btVector3(btVector3 const&amp;)" location="f3:84" file="f3" line="84" endline="84" inline="1">
    <Argument type="_1824" location="f3:84" file="f3" line="84"/>
  </Constructor>
  <OperatorMethod id="_2425" name="new" returns="_1077" static="1" context="_193" access="public" mangled="_ZN9btVector3nwEm" demangled="btVector3::operator new(unsigned long)" location="f3:87" file="f3" line="87" endline="87" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f3:87" file="f3" line="87"/>
  </OperatorMethod>
  <OperatorMethod id="_2426" name="delete" returns="_635" static="1" context="_193" access="public" mangled="_ZN9btVector3dlEPv" demangled="btVector3::operator delete(void*)" location="f3:87" file="f3" line="87" endline="87" inline="1">
    <Argument name="ptr" type="_1077" location="f3:87" file="f3" line="87"/>
  </OperatorMethod>
  <OperatorMethod id="_2427" name="new" returns="_1077" static="1" context="_193" access="public" mangled="_ZN9btVector3nwEmPv" demangled="btVector3::operator new(unsigned long, void*)" location="f3:87" file="f3" line="87" endline="87" inline="1">
    <Argument type="_1165" location="f3:87" file="f3" line="87"/>
    <Argument name="ptr" type="_1077" location="f3:87" file="f3" line="87"/>
  </OperatorMethod>
  <OperatorMethod id="_2428" name="delete" returns="_635" static="1" context="_193" access="public" mangled="_ZN9btVector3dlEPvS0_" demangled="btVector3::operator delete(void*, void*)" location="f3:87" file="f3" line="87" inline="1">
    <Argument type="_1077" location="f3:87" file="f3" line="87"/>
    <Argument type="_1077" location="f3:87" file="f3" line="87"/>
  </OperatorMethod>
  <OperatorMethod id="_2429" name="new []" returns="_1077" static="1" context="_193" access="public" mangled="_ZN9btVector3naEm" demangled="btVector3::operator new[](unsigned long)" location="f3:87" file="f3" line="87" endline="87" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f3:87" file="f3" line="87"/>
  </OperatorMethod>
  <OperatorMethod id="_2430" name="delete []" returns="_635" static="1" context="_193" access="public" mangled="_ZN9btVector3daEPv" demangled="btVector3::operator delete[](void*)" location="f3:87" file="f3" line="87" endline="87" inline="1">
    <Argument name="ptr" type="_1077" location="f3:87" file="f3" line="87"/>
  </OperatorMethod>
  <OperatorMethod id="_2431" name="new []" returns="_1077" static="1" context="_193" access="public" mangled="_ZN9btVector3naEmPv" demangled="btVector3::operator new[](unsigned long, void*)" location="f3:87" file="f3" line="87" endline="87" inline="1">
    <Argument type="_1165" location="f3:87" file="f3" line="87"/>
    <Argument name="ptr" type="_1077" location="f3:87" file="f3" line="87"/>
  </OperatorMethod>
  <OperatorMethod id="_2432" name="delete []" returns="_635" static="1" context="_193" access="public" mangled="_ZN9btVector3daEPvS0_" demangled="btVector3::operator delete[](void*, void*)" location="f3:87" file="f3" line="87" inline="1">
    <Argument type="_1077" location="f3:87" file="f3" line="87"/>
    <Argument type="_1077" location="f3:87" file="f3" line="87"/>
  </OperatorMethod>
  <Constructor id="_2433" name="btVector3" explicit="1" context="_193" access="public" mangled="_ZN9btVector3C1Ev *INTERNAL* " demangled="btVector3::btVector3()" location="f3:119" file="f3" line="119" inline="1"/>
  <Constructor id="_2434" name="btVector3" explicit="1" context="_193" access="public" mangled="_ZN9btVector3C1ERKfS1_S1_ *INTERNAL* " demangled="btVector3::btVector3(float const&amp;, float const&amp;, float const&amp;)" location="f3:131" file="f3" line="131" endline="136" inline="1">
    <Argument name="_x" type="_3325" location="f3:131" file="f3" line="131"/>
    <Argument name="_y" type="_3325" location="f3:131" file="f3" line="131"/>
    <Argument name="_z" type="_3325" location="f3:131" file="f3" line="131"/>
  </Constructor>
  <OperatorMethod id="_2435" name="+=" returns="_2535" context="_193" access="public" mangled="_ZN9btVector3pLERKS_" demangled="btVector3::operator+=(btVector3 const&amp;)" location="f3:164" file="f3" line="164" endline="175" inline="1">
    <Argument name="v" type="_1824" location="f3:164" file="f3" line="164"/>
  </OperatorMethod>
  <OperatorMethod id="_2436" name="-=" returns="_2535" context="_193" access="public" mangled="_ZN9btVector3mIERKS_" demangled="btVector3::operator-=(btVector3 const&amp;)" location="f3:181" file="f3" line="181" endline="192" inline="1">
    <Argument name="v" type="_1824" location="f3:181" file="f3" line="181"/>
  </OperatorMethod>
  <OperatorMethod id="_2437" name="*=" returns="_2535" context="_193" access="public" mangled="_ZN9btVector3mLERKf" demangled="btVector3::operator*=(float const&amp;)" location="f3:197" file="f3" line="197" endline="210" inline="1">
    <Argument name="s" type="_3325" location="f3:197" file="f3" line="197"/>
  </OperatorMethod>
  <OperatorMethod id="_2438" name="/=" returns="_2535" context="_193" access="public" mangled="_ZN9btVector3dVERKf" demangled="btVector3::operator/=(float const&amp;)" location="f3:215" file="f3" line="215" endline="229" inline="1">
    <Argument name="s" type="_3325" location="f3:215" file="f3" line="215"/>
  </OperatorMethod>
  <Method id="_2439" name="dot" returns="_362" const="1" context="_193" access="public" mangled="_ZNK9btVector33dotERKS_" demangled="btVector3::dot(btVector3 const&amp;) const" location="f3:235" file="f3" line="235" endline="252" inline="1">
    <Argument name="v" type="_1824" location="f3:235" file="f3" line="235"/>
  </Method>
  <Method id="_2440" name="length2" returns="_362" const="1" context="_193" access="public" mangled="_ZNK9btVector37length2Ev" demangled="btVector3::length2() const" location="f3:257" file="f3" line="257" endline="259" inline="1"/>
  <Method id="_2441" name="length" returns="_362" const="1" context="_193" access="public" mangled="_ZNK9btVector36lengthEv" demangled="btVector3::length() const" location="f3:263" file="f3" line="263" endline="265" inline="1"/>
  <Method id="_2442" name="norm" returns="_362" const="1" context="_193" access="public" mangled="_ZNK9btVector34normEv" demangled="btVector3::norm() const" location="f3:269" file="f3" line="269" endline="271" inline="1"/>
  <Method id="_2443" name="distance2" returns="_362" const="1" context="_193" access="public" mangled="_ZNK9btVector39distance2ERKS_" demangled="btVector3::distance2(btVector3 const&amp;) const" location="f3:941" file="f3" line="941" endline="943" inline="1">
    <Argument name="v" type="_1824" location="f3:941" file="f3" line="941"/>
  </Method>
  <Method id="_2444" name="distance" returns="_362" const="1" context="_193" access="public" mangled="_ZNK9btVector38distanceERKS_" demangled="btVector3::distance(btVector3 const&amp;) const" location="f3:946" file="f3" line="946" endline="948" inline="1">
    <Argument name="v" type="_1824" location="f3:946" file="f3" line="946"/>
  </Method>
  <Method id="_2445" name="safeNormalize" returns="_2535" context="_193" access="public" mangled="_ZN9btVector313safeNormalizeEv" demangled="btVector3::safeNormalize()" location="f3:282" file="f3" line="282" endline="292" inline="1"/>
  <Method id="_2446" name="normalize" returns="_2535" context="_193" access="public" mangled="_ZN9btVector39normalizeEv" demangled="btVector3::normalize()" location="f3:297" file="f3" line="297" endline="338" inline="1"/>
  <Method id="_2447" name="normalized" returns="_193" const="1" context="_193" access="public" mangled="_ZNK9btVector310normalizedEv" demangled="btVector3::normalized() const" location="f3:951" file="f3" line="951" endline="955" inline="1"/>
  <Method id="_2448" name="rotate" returns="_193" const="1" context="_193" access="public" mangled="_ZNK9btVector36rotateERKS_f" demangled="btVector3::rotate(btVector3 const&amp;, float) const" location="f3:958" file="f3" line="958" endline="996" inline="1">
    <Argument name="wAxis" type="_1824" location="f3:958" file="f3" line="958"/>
    <Argument name="_angle" type="_362c" location="f3:958" file="f3" line="958"/>
  </Method>
  <Method id="_2449" name="angle" returns="_362" const="1" context="_193" access="public" mangled="_ZNK9btVector35angleERKS_" demangled="btVector3::angle(btVector3 const&amp;) const" location="f3:352" file="f3" line="352" endline="356" inline="1">
    <Argument name="v" type="_1824" location="f3:352" file="f3" line="352"/>
  </Method>
  <Method id="_2450" name="absolute" returns="_193" const="1" context="_193" access="public" mangled="_ZNK9btVector38absoluteEv" demangled="btVector3::absolute() const" location="f3:360" file="f3" line="360" endline="371" inline="1"/>
  <Method id="_2451" name="cross" returns="_193" const="1" context="_193" access="public" mangled="_ZNK9btVector35crossERKS_" demangled="btVector3::cross(btVector3 const&amp;) const" location="f3:377" file="f3" line="377" endline="412" inline="1">
    <Argument name="v" type="_1824" location="f3:377" file="f3" line="377"/>
  </Method>
  <Method id="_2452" name="triple" returns="_362" const="1" context="_193" access="public" mangled="_ZNK9btVector36tripleERKS_S1_" demangled="btVector3::triple(btVector3 const&amp;, btVector3 const&amp;) const" location="f3:416" file="f3" line="416" endline="462" inline="1">
    <Argument name="v1" type="_1824" location="f3:416" file="f3" line="416"/>
    <Argument name="v2" type="_1824" location="f3:416" file="f3" line="416"/>
  </Method>
  <Method id="_2453" name="minAxis" returns="_168" const="1" context="_193" access="public" mangled="_ZNK9btVector37minAxisEv" demangled="btVector3::minAxis() const" location="f3:468" file="f3" line="468" endline="470" inline="1"/>
  <Method id="_2454" name="maxAxis" returns="_168" const="1" context="_193" access="public" mangled="_ZNK9btVector37maxAxisEv" demangled="btVector3::maxAxis() const" location="f3:475" file="f3" line="475" endline="477" inline="1"/>
  <Method id="_2455" name="furthestAxis" returns="_168" const="1" context="_193" access="public" mangled="_ZNK9btVector312furthestAxisEv" demangled="btVector3::furthestAxis() const" location="f3:480" file="f3" line="480" endline="482" inline="1"/>
  <Method id="_2456" name="closestAxis" returns="_168" const="1" context="_193" access="public" mangled="_ZNK9btVector311closestAxisEv" demangled="btVector3::closestAxis() const" location="f3:485" file="f3" line="485" endline="487" inline="1"/>
  <Method id="_2457" name="setInterpolate3" returns="_635" context="_193" access="public" mangled="_ZN9btVector315setInterpolate3ERKS_S1_f" demangled="btVector3::setInterpolate3(btVector3 const&amp;, btVector3 const&amp;, float)" location="f3:491" file="f3" line="491" endline="511" inline="1">
    <Argument name="v0" type="_1824" location="f3:491" file="f3" line="491"/>
    <Argument name="v1" type="_1824" location="f3:491" file="f3" line="491"/>
    <Argument name="rt" type="_362" location="f3:491" file="f3" line="491"/>
  </Method>
  <Method id="_2458" name="lerp" returns="_193" const="1" context="_193" access="public" mangled="_ZNK9btVector34lerpERKS_RKf" demangled="btVector3::lerp(btVector3 const&amp;, float const&amp;) const" location="f3:520" file="f3" line="520" endline="540" inline="1">
    <Argument name="v" type="_1824" location="f3:520" file="f3" line="520"/>
    <Argument name="t" type="_3325" location="f3:520" file="f3" line="520"/>
  </Method>
  <OperatorMethod id="_2459" name="*=" returns="_2535" context="_193" access="public" mangled="_ZN9btVector3mLERKS_" demangled="btVector3::operator*=(btVector3 const&amp;)" location="f3:546" file="f3" line="546" endline="557" inline="1">
    <Argument name="v" type="_1824" location="f3:546" file="f3" line="546"/>
  </OperatorMethod>
  <Method id="_2460" name="getX" returns="_3325" const="1" context="_193" access="public" mangled="_ZNK9btVector34getXEv" demangled="btVector3::getX() const" location="f3:561" file="f3" line="561" endline="561" inline="1"/>
  <Method id="_2461" name="getY" returns="_3325" const="1" context="_193" access="public" mangled="_ZNK9btVector34getYEv" demangled="btVector3::getY() const" location="f3:563" file="f3" line="563" endline="563" inline="1"/>
  <Method id="_2462" name="getZ" returns="_3325" const="1" context="_193" access="public" mangled="_ZNK9btVector34getZEv" demangled="btVector3::getZ() const" location="f3:565" file="f3" line="565" endline="565" inline="1"/>
  <Method id="_2463" name="setX" returns="_635" context="_193" access="public" mangled="_ZN9btVector34setXEf" demangled="btVector3::setX(float)" location="f3:567" file="f3" line="567" endline="567" inline="1">
    <Argument name="_x" type="_362" location="f3:567" file="f3" line="567"/>
  </Method>
  <Method id="_2464" name="setY" returns="_635" context="_193" access="public" mangled="_ZN9btVector34setYEf" demangled="btVector3::setY(float)" location="f3:569" file="f3" line="569" endline="569" inline="1">
    <Argument name="_y" type="_362" location="f3:569" file="f3" line="569"/>
  </Method>
  <Method id="_2465" name="setZ" returns="_635" context="_193" access="public" mangled="_ZN9btVector34setZEf" demangled="btVector3::setZ(float)" location="f3:571" file="f3" line="571" endline="571" inline="1">
    <Argument name="_z" type="_362" location="f3:571" file="f3" line="571"/>
  </Method>
  <Method id="_2466" name="setW" returns="_635" context="_193" access="public" mangled="_ZN9btVector34setWEf" demangled="btVector3::setW(float)" location="f3:573" file="f3" line="573" endline="573" inline="1">
    <Argument name="_w" type="_362" location="f3:573" file="f3" line="573"/>
  </Method>
  <Method id="_2467" name="x" returns="_3325" const="1" context="_193" access="public" mangled="_ZNK9btVector31xEv" demangled="btVector3::x() const" location="f3:575" file="f3" line="575" endline="575" inline="1"/>
  <Method id="_2468" name="y" returns="_3325" const="1" context="_193" access="public" mangled="_ZNK9btVector31yEv" demangled="btVector3::y() const" location="f3:577" file="f3" line="577" endline="577" inline="1"/>
  <Method id="_2469" name="z" returns="_3325" const="1" context="_193" access="public" mangled="_ZNK9btVector31zEv" demangled="btVector3::z() const" location="f3:579" file="f3" line="579" endline="579" inline="1"/>
  <Method id="_2470" name="w" returns="_3325" const="1" context="_193" access="public" mangled="_ZNK9btVector31wEv" demangled="btVector3::w() const" location="f3:581" file="f3" line="581" endline="581" inline="1"/>
  <Converter id="_2471" name="operator 1" returns="_9037" context="_193" access="public" mangled="_ZN9btVector3cvPfEv" demangled="btVector3::operator float*()" location="f3:586" file="f3" line="586" endline="586" inline="1"/>
  <Converter id="_2472" name="operator 2" returns="_5479" const="1" context="_193" access="public" mangled="_ZNK9btVector3cvPKfEv" demangled="btVector3::operator float const*() const" location="f3:587" file="f3" line="587" endline="587" inline="1"/>
  <OperatorMethod id="_2473" name="==" returns="_1834" const="1" context="_193" access="public" mangled="_ZNK9btVector3eqERKS_" demangled="btVector3::operator==(btVector3 const&amp;) const" location="f3:589" file="f3" line="589" endline="597" inline="1">
    <Argument name="other" type="_1824" location="f3:589" file="f3" line="589"/>
  </OperatorMethod>
  <OperatorMethod id="_2474" name="!=" returns="_1834" const="1" context="_193" access="public" mangled="_ZNK9btVector3neERKS_" demangled="btVector3::operator!=(btVector3 const&amp;) const" location="f3:601" file="f3" line="601" endline="603" inline="1">
    <Argument name="other" type="_1824" location="f3:601" file="f3" line="601"/>
  </OperatorMethod>
  <Method id="_2475" name="setMax" returns="_635" context="_193" access="public" mangled="_ZN9btVector36setMaxERKS_" demangled="btVector3::setMax(btVector3 const&amp;)" location="f3:609" file="f3" line="609" endline="619" inline="1">
    <Argument name="other" type="_1824" location="f3:609" file="f3" line="609"/>
  </Method>
  <Method id="_2476" name="setMin" returns="_635" context="_193" access="public" mangled="_ZN9btVector36setMinERKS_" demangled="btVector3::setMin(btVector3 const&amp;)" location="f3:626" file="f3" line="626" endline="636" inline="1">
    <Argument name="other" type="_1824" location="f3:626" file="f3" line="626"/>
  </Method>
  <Method id="_2477" name="setValue" returns="_635" context="_193" access="public" mangled="_ZN9btVector38setValueERKfS1_S1_" demangled="btVector3::setValue(float const&amp;, float const&amp;, float const&amp;)" location="f3:640" file="f3" line="640" endline="645" inline="1">
    <Argument name="_x" type="_3325" location="f3:640" file="f3" line="640"/>
    <Argument name="_y" type="_3325" location="f3:640" file="f3" line="640"/>
    <Argument name="_z" type="_3325" location="f3:640" file="f3" line="640"/>
  </Method>
  <Method id="_2478" name="getSkewSymmetricMatrix" returns="_635" const="1" context="_193" access="public" mangled="_ZNK9btVector322getSkewSymmetricMatrixEPS_S0_S0_" demangled="btVector3::getSkewSymmetricMatrix(btVector3*, btVector3*, btVector3*) const" location="f3:648" file="f3" line="648" endline="667" inline="1">
    <Argument name="v0" type="_4309" location="f3:648" file="f3" line="648"/>
    <Argument name="v1" type="_4309" location="f3:648" file="f3" line="648"/>
    <Argument name="v2" type="_4309" location="f3:648" file="f3" line="648"/>
  </Method>
  <Method id="_2479" name="setZero" returns="_635" context="_193" access="public" mangled="_ZN9btVector37setZeroEv" demangled="btVector3::setZero()" location="f3:671" file="f3" line="671" endline="679" inline="1"/>
  <Method id="_2480" name="isZero" returns="_1834" const="1" context="_193" access="public" mangled="_ZNK9btVector36isZeroEv" demangled="btVector3::isZero() const" location="f3:683" file="f3" line="683" endline="685" inline="1"/>
  <Method id="_2481" name="fuzzyZero" returns="_1834" const="1" context="_193" access="public" mangled="_ZNK9btVector39fuzzyZeroEv" demangled="btVector3::fuzzyZero() const" location="f3:688" file="f3" line="688" endline="690" inline="1"/>
  <Method id="_2482" name="serialize" returns="_635" const="1" context="_193" access="public" mangled="_ZNK9btVector39serializeER18btVector3FloatData" demangled="btVector3::serialize(btVector3FloatData&amp;) const" location="f3:1339" file="f3" line="1339" endline="1343" inline="1">
    <Argument name="dataOut" type="_9038" location="f3:1339" file="f3" line="1339"/>
  </Method>
  <Method id="_2483" name="deSerialize" returns="_635" context="_193" access="public" mangled="_ZN9btVector311deSerializeERK18btVector3FloatData" demangled="btVector3::deSerialize(btVector3FloatData const&amp;)" location="f3:1346" file="f3" line="1346" endline="1349" inline="1">
    <Argument name="dataIn" type="_9039" location="f3:1346" file="f3" line="1346"/>
  </Method>
  <Method id="_2484" name="serializeFloat" returns="_635" const="1" context="_193" access="public" mangled="_ZNK9btVector314serializeFloatER18btVector3FloatData" demangled="btVector3::serializeFloat(btVector3FloatData&amp;) const" location="f3:1311" file="f3" line="1311" endline="1315" inline="1">
    <Argument name="dataOut" type="_9038" location="f3:1311" file="f3" line="1311"/>
  </Method>
  <Method id="_2485" name="deSerializeFloat" returns="_635" context="_193" access="public" mangled="_ZN9btVector316deSerializeFloatERK18btVector3FloatData" demangled="btVector3::deSerializeFloat(btVector3FloatData const&amp;)" location="f3:1318" file="f3" line="1318" endline="1321" inline="1">
    <Argument name="dataIn" type="_9039" location="f3:1318" file="f3" line="1318"/>
  </Method>
  <Method id="_2486" name="serializeDouble" returns="_635" const="1" context="_193" access="public" mangled="_ZNK9btVector315serializeDoubleER19btVector3DoubleData" demangled="btVector3::serializeDouble(btVector3DoubleData&amp;) const" location="f3:1325" file="f3" line="1325" endline="1329" inline="1">
    <Argument name="dataOut" type="_9040" location="f3:1325" file="f3" line="1325"/>
  </Method>
  <Method id="_2487" name="deSerializeDouble" returns="_635" context="_193" access="public" mangled="_ZN9btVector317deSerializeDoubleERK19btVector3DoubleData" demangled="btVector3::deSerializeDouble(btVector3DoubleData const&amp;)" location="f3:1332" file="f3" line="1332" endline="1335" inline="1">
    <Argument name="dataIn" type="_9041" location="f3:1332" file="f3" line="1332"/>
  </Method>
  <Method id="_2488" name="maxDot" returns="_22" const="1" context="_193" access="public" mangled="_ZNK9btVector36maxDotEPKS_lRf" demangled="btVector3::maxDot(btVector3 const*, long, float&amp;) const" location="f3:1000" file="f3" line="1000" endline="1028" inline="1">
    <Argument name="array" type="_4306" location="f3:1000" file="f3" line="1000"/>
    <Argument name="array_count" type="_22" location="f3:1000" file="f3" line="1000"/>
    <Argument name="dotOut" type="_3326" location="f3:1000" file="f3" line="1000"/>
  </Method>
  <Method id="_2489" name="minDot" returns="_22" const="1" context="_193" access="public" mangled="_ZNK9btVector36minDotEPKS_lRf" demangled="btVector3::minDot(btVector3 const*, long, float&amp;) const" location="f3:1035" file="f3" line="1035" endline="1068" inline="1">
    <Argument name="array" type="_4306" location="f3:1035" file="f3" line="1035"/>
    <Argument name="array_count" type="_22" location="f3:1035" file="f3" line="1035"/>
    <Argument name="dotOut" type="_3326" location="f3:1035" file="f3" line="1035"/>
  </Method>
  <Method id="_2490" name="dot3" returns="_193" const="1" context="_193" access="public" mangled="_ZNK9btVector34dot3ERKS_S1_S1_" demangled="btVector3::dot3(btVector3 const&amp;, btVector3 const&amp;, btVector3 const&amp;) const" location="f3:718" file="f3" line="718" endline="745" inline="1">
    <Argument name="v0" type="_1824" location="f3:718" file="f3" line="718"/>
    <Argument name="v1" type="_1824" location="f3:718" file="f3" line="718"/>
    <Argument name="v2" type="_1824" location="f3:718" file="f3" line="718"/>
  </Method>
  <PointerType id="_2491" type="_1165" size="64" align="64"/>
  <CvQualifiedType id="_2491r" type="_2491" restrict="1"/>
  <PointerType id="_2493" type="_635c" size="64" align="64"/>
  <PointerType id="_2494" type="_1971" size="64" align="64"/>
  <Field id="_2495" name="m_shapeType" type="_168" offset="64" context="_217" access="protected" location="f64:30" file="f64" line="30"/>
  <Field id="_2496" name="m_userPointer" type="_1077" offset="128" context="_217" access="protected" location="f64:31" file="f64" line="31"/>
  <OperatorMethod id="_2497" name="=" returns="_9043" artificial="1" throw="" context="_217" access="public" mangled="_ZN16btCollisionShapeaSERKS_" demangled="btCollisionShape::operator=(btCollisionShape const&amp;)" location="f64:28" file="f64" line="28" endline="28" inline="1">
    <Argument type="_9044" location="f64:28" file="f64" line="28"/>
  </OperatorMethod>
  <Constructor id="_2498" name="btCollisionShape" artificial="1" throw="" context="_217" access="public" mangled="_ZN16btCollisionShapeC1ERKS_ *INTERNAL* " demangled="btCollisionShape::btCollisionShape(btCollisionShape const&amp;)" location="f64:28" file="f64" line="28" endline="28" inline="1">
    <Argument type="_9044" location="f64:28" file="f64" line="28"/>
  </Constructor>
  <OperatorMethod id="_2499" name="new" returns="_1077" static="1" context="_217" access="public" mangled="_ZN16btCollisionShapenwEm" demangled="btCollisionShape::operator new(unsigned long)" location="f64:35" file="f64" line="35" endline="35" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f64:35" file="f64" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2500" name="delete" returns="_635" static="1" context="_217" access="public" mangled="_ZN16btCollisionShapedlEPv" demangled="btCollisionShape::operator delete(void*)" location="f64:35" file="f64" line="35" endline="35" inline="1">
    <Argument name="ptr" type="_1077" location="f64:35" file="f64" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2501" name="new" returns="_1077" static="1" context="_217" access="public" mangled="_ZN16btCollisionShapenwEmPv" demangled="btCollisionShape::operator new(unsigned long, void*)" location="f64:35" file="f64" line="35" endline="35" inline="1">
    <Argument type="_1165" location="f64:35" file="f64" line="35"/>
    <Argument name="ptr" type="_1077" location="f64:35" file="f64" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2502" name="delete" returns="_635" static="1" context="_217" access="public" mangled="_ZN16btCollisionShapedlEPvS0_" demangled="btCollisionShape::operator delete(void*, void*)" location="f64:35" file="f64" line="35" inline="1">
    <Argument type="_1077" location="f64:35" file="f64" line="35"/>
    <Argument type="_1077" location="f64:35" file="f64" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2503" name="new []" returns="_1077" static="1" context="_217" access="public" mangled="_ZN16btCollisionShapenaEm" demangled="btCollisionShape::operator new[](unsigned long)" location="f64:35" file="f64" line="35" endline="35" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f64:35" file="f64" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2504" name="delete []" returns="_635" static="1" context="_217" access="public" mangled="_ZN16btCollisionShapedaEPv" demangled="btCollisionShape::operator delete[](void*)" location="f64:35" file="f64" line="35" endline="35" inline="1">
    <Argument name="ptr" type="_1077" location="f64:35" file="f64" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2505" name="new []" returns="_1077" static="1" context="_217" access="public" mangled="_ZN16btCollisionShapenaEmPv" demangled="btCollisionShape::operator new[](unsigned long, void*)" location="f64:35" file="f64" line="35" endline="35" inline="1">
    <Argument type="_1165" location="f64:35" file="f64" line="35"/>
    <Argument name="ptr" type="_1077" location="f64:35" file="f64" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2506" name="delete []" returns="_635" static="1" context="_217" access="public" mangled="_ZN16btCollisionShapedaEPvS0_" demangled="btCollisionShape::operator delete[](void*, void*)" location="f64:35" file="f64" line="35" inline="1">
    <Argument type="_1077" location="f64:35" file="f64" line="35"/>
    <Argument type="_1077" location="f64:35" file="f64" line="35"/>
  </OperatorMethod>
  <Constructor id="_2507" name="btCollisionShape" explicit="1" context="_217" access="public" mangled="_ZN16btCollisionShapeC1Ev *INTERNAL* " demangled="btCollisionShape::btCollisionShape()" location="f64:37" file="f64" line="37" endline="37" inline="1"/>
  <Destructor id="_2508" name="btCollisionShape" virtual="1" overrides="" context="_217" access="public" mangled="_ZN16btCollisionShapeD1Ev *INTERNAL* " demangled="btCollisionShape::~btCollisionShape()" location="f64:41" file="f64" line="41" endline="43" inline="1">
  </Destructor>
  <Method id="_2509" name="getAabb" returns="_635" const="1" virtual="1" pure_virtual="1" overrides="" context="_217" access="public" mangled="_ZNK16btCollisionShape7getAabbERK11btTransformR9btVector3S4_" demangled="btCollisionShape::getAabb(btTransform const&amp;, btVector3&amp;, btVector3&amp;) const" location="f64:46" file="f64" line="46" extern="1">
    <Argument name="t" type="_6975" location="f64:46" file="f64" line="46"/>
    <Argument name="aabbMin" type="_2535" location="f64:46" file="f64" line="46"/>
    <Argument name="aabbMax" type="_2535" location="f64:46" file="f64" line="46"/>
  </Method>
  <Method id="_2510" name="getBoundingSphere" returns="_635" const="1" virtual="1" overrides="" context="_217" access="public" mangled="_ZNK16btCollisionShape17getBoundingSphereER9btVector3Rf" demangled="btCollisionShape::getBoundingSphere(btVector3&amp;, float&amp;) const" location="f64:48" file="f64" line="48" extern="1">
    <Argument name="center" type="_2535" location="f64:48" file="f64" line="48"/>
    <Argument name="radius" type="_3326" location="f64:48" file="f64" line="48"/>
  </Method>
  <Method id="_2511" name="getAngularMotionDisc" returns="_362" const="1" virtual="1" overrides="" context="_217" access="public" mangled="_ZNK16btCollisionShape20getAngularMotionDiscEv" demangled="btCollisionShape::getAngularMotionDisc() const" location="f64:51" file="f64" line="51" extern="1"/>
  <Method id="_2512" name="getContactBreakingThreshold" returns="_362" const="1" virtual="1" overrides="" context="_217" access="public" mangled="_ZNK16btCollisionShape27getContactBreakingThresholdEf" demangled="btCollisionShape::getContactBreakingThreshold(float) const" location="f64:53" file="f64" line="53" extern="1">
    <Argument name="defaultContactThresholdFactor" type="_362" location="f64:53" file="f64" line="53"/>
  </Method>
  <Method id="_2513" name="calculateTemporalAabb" returns="_635" const="1" context="_217" access="public" mangled="_ZNK16btCollisionShape21calculateTemporalAabbERK11btTransformRK9btVector3S5_fRS3_S6_" demangled="btCollisionShape::calculateTemporalAabb(btTransform const&amp;, btVector3 const&amp;, btVector3 const&amp;, float, btVector3&amp;, btVector3&amp;) const" location="f64:58" file="f64" line="58" extern="1">
    <Argument name="curTrans" type="_6975" location="f64:58" file="f64" line="58"/>
    <Argument name="linvel" type="_1824" location="f64:58" file="f64" line="58"/>
    <Argument name="angvel" type="_1824" location="f64:58" file="f64" line="58"/>
    <Argument name="timeStep" type="_362" location="f64:58" file="f64" line="58"/>
    <Argument name="temporalAabbMin" type="_2535" location="f64:58" file="f64" line="58"/>
    <Argument name="temporalAabbMax" type="_2535" location="f64:58" file="f64" line="58"/>
  </Method>
  <Method id="_2514" name="isPolyhedral" returns="_1834" const="1" context="_217" access="public" mangled="_ZNK16btCollisionShape12isPolyhedralEv" demangled="btCollisionShape::isPolyhedral() const" location="f64:62" file="f64" line="62" endline="64" inline="1"/>
  <Method id="_2515" name="isConvex2d" returns="_1834" const="1" context="_217" access="public" mangled="_ZNK16btCollisionShape10isConvex2dEv" demangled="btCollisionShape::isConvex2d() const" location="f64:67" file="f64" line="67" endline="69" inline="1"/>
  <Method id="_2516" name="isConvex" returns="_1834" const="1" context="_217" access="public" mangled="_ZNK16btCollisionShape8isConvexEv" demangled="btCollisionShape::isConvex() const" location="f64:72" file="f64" line="72" endline="74" inline="1"/>
  <Method id="_2517" name="isNonMoving" returns="_1834" const="1" context="_217" access="public" mangled="_ZNK16btCollisionShape11isNonMovingEv" demangled="btCollisionShape::isNonMoving() const" location="f64:76" file="f64" line="76" endline="78" inline="1"/>
  <Method id="_2518" name="isConcave" returns="_1834" const="1" context="_217" access="public" mangled="_ZNK16btCollisionShape9isConcaveEv" demangled="btCollisionShape::isConcave() const" location="f64:80" file="f64" line="80" endline="82" inline="1"/>
  <Method id="_2519" name="isCompound" returns="_1834" const="1" context="_217" access="public" mangled="_ZNK16btCollisionShape10isCompoundEv" demangled="btCollisionShape::isCompound() const" location="f64:84" file="f64" line="84" endline="86" inline="1"/>
  <Method id="_2520" name="isSoftBody" returns="_1834" const="1" context="_217" access="public" mangled="_ZNK16btCollisionShape10isSoftBodyEv" demangled="btCollisionShape::isSoftBody() const" location="f64:89" file="f64" line="89" endline="91" inline="1"/>
  <Method id="_2521" name="isInfinite" returns="_1834" const="1" context="_217" access="public" mangled="_ZNK16btCollisionShape10isInfiniteEv" demangled="btCollisionShape::isInfinite() const" location="f64:95" file="f64" line="95" endline="97" inline="1"/>
  <Method id="_2522" name="setLocalScaling" returns="_635" virtual="1" pure_virtual="1" overrides="" context="_217" access="public" mangled="_ZN16btCollisionShape15setLocalScalingERK9btVector3" demangled="btCollisionShape::setLocalScaling(btVector3 const&amp;)" location="f64:101" file="f64" line="101" extern="1">
    <Argument name="scaling" type="_1824" location="f64:101" file="f64" line="101"/>
  </Method>
  <Method id="_2523" name="getLocalScaling" returns="_1824" const="1" virtual="1" pure_virtual="1" overrides="" context="_217" access="public" mangled="_ZNK16btCollisionShape15getLocalScalingEv" demangled="btCollisionShape::getLocalScaling() const" location="f64:102" file="f64" line="102" extern="1"/>
  <Method id="_2524" name="calculateLocalInertia" returns="_635" const="1" virtual="1" pure_virtual="1" overrides="" context="_217" access="public" mangled="_ZNK16btCollisionShape21calculateLocalInertiaEfR9btVector3" demangled="btCollisionShape::calculateLocalInertia(float, btVector3&amp;) const" location="f64:103" file="f64" line="103" extern="1">
    <Argument name="mass" type="_362" location="f64:103" file="f64" line="103"/>
    <Argument name="inertia" type="_2535" location="f64:103" file="f64" line="103"/>
  </Method>
  <Method id="_2525" name="getName" returns="_1823" const="1" virtual="1" pure_virtual="1" overrides="" context="_217" access="public" mangled="_ZNK16btCollisionShape7getNameEv" demangled="btCollisionShape::getName() const" location="f64:107" file="f64" line="107" extern="1"/>
  <Method id="_2526" name="getShapeType" returns="_168" const="1" context="_217" access="public" mangled="_ZNK16btCollisionShape12getShapeTypeEv" demangled="btCollisionShape::getShapeType() const" location="f64:111" file="f64" line="111" endline="111" inline="1"/>
  <Method id="_2527" name="getAnisotropicRollingFrictionDirection" returns="_193" const="1" virtual="1" overrides="" context="_217" access="public" mangled="_ZNK16btCollisionShape38getAnisotropicRollingFrictionDirectionEv" demangled="btCollisionShape::getAnisotropicRollingFrictionDirection() const" location="f64:115" file="f64" line="115" endline="117" inline="1"/>
  <Method id="_2528" name="setMargin" returns="_635" virtual="1" pure_virtual="1" overrides="" context="_217" access="public" mangled="_ZN16btCollisionShape9setMarginEf" demangled="btCollisionShape::setMargin(float)" location="f64:119" file="f64" line="119" extern="1">
    <Argument name="margin" type="_362" location="f64:119" file="f64" line="119"/>
  </Method>
  <Method id="_2529" name="getMargin" returns="_362" const="1" virtual="1" pure_virtual="1" overrides="" context="_217" access="public" mangled="_ZNK16btCollisionShape9getMarginEv" demangled="btCollisionShape::getMargin() const" location="f64:120" file="f64" line="120" extern="1"/>
  <Method id="_2530" name="setUserPointer" returns="_635" context="_217" access="public" mangled="_ZN16btCollisionShape14setUserPointerEPv" demangled="btCollisionShape::setUserPointer(void*)" location="f64:124" file="f64" line="124" endline="126" inline="1">
    <Argument name="userPtr" type="_1077" location="f64:124" file="f64" line="124"/>
  </Method>
  <Method id="_2531" name="getUserPointer" returns="_1077" const="1" context="_217" access="public" mangled="_ZNK16btCollisionShape14getUserPointerEv" demangled="btCollisionShape::getUserPointer() const" location="f64:129" file="f64" line="129" endline="131" inline="1"/>
  <Method id="_2532" name="calculateSerializeBufferSize" returns="_168" const="1" virtual="1" overrides="" context="_217" access="public" mangled="_ZNK16btCollisionShape28calculateSerializeBufferSizeEv" demangled="btCollisionShape::calculateSerializeBufferSize() const" location="f64:151" file="f64" line="151" endline="153" inline="1"/>
  <Method id="_2533" name="serialize" returns="_1823" const="1" virtual="1" overrides="" context="_217" access="public" mangled="_ZNK16btCollisionShape9serializeEPvP12btSerializer" demangled="btCollisionShape::serialize(void*, btSerializer*) const" location="f64:137" file="f64" line="137" extern="1">
    <Argument name="dataBuffer" type="_1077" location="f64:137" file="f64" line="137"/>
    <Argument name="serializer" type="_8886" location="f64:137" file="f64" line="137"/>
  </Method>
  <Method id="_2534" name="serializeSingleShape" returns="_635" const="1" virtual="1" overrides="" context="_217" access="public" mangled="_ZNK16btCollisionShape20serializeSingleShapeEP12btSerializer" demangled="btCollisionShape::serializeSingleShape(btSerializer*) const" location="f64:139" file="f64" line="139" extern="1">
    <Argument name="serializer" type="_8886" location="f64:139" file="f64" line="139"/>
  </Method>
  <ReferenceType id="_2535" type="_193" size="64" align="64"/>
  <OperatorMethod id="_2536" name="=" returns="_9045" artificial="1" throw="" context="_219" access="public" mangled="_ZN24btCollisionConfigurationaSERKS_" demangled="btCollisionConfiguration::operator=(btCollisionConfiguration const&amp;)" location="f65:27" file="f65" line="27" endline="27" inline="1">
    <Argument type="_9046" location="f65:27" file="f65" line="27"/>
  </OperatorMethod>
  <Constructor id="_2537" name="btCollisionConfiguration" artificial="1" throw="" context="_219" access="public" mangled="_ZN24btCollisionConfigurationC1ERKS_ *INTERNAL* " demangled="btCollisionConfiguration::btCollisionConfiguration(btCollisionConfiguration const&amp;)" location="f65:27" file="f65" line="27" endline="27" inline="1">
    <Argument type="_9046" location="f65:27" file="f65" line="27"/>
  </Constructor>
  <Constructor id="_2538" name="btCollisionConfiguration" artificial="1" throw="" context="_219" access="public" mangled="_ZN24btCollisionConfigurationC1Ev *INTERNAL* " demangled="btCollisionConfiguration::btCollisionConfiguration()" location="f65:27" file="f65" line="27" endline="27" inline="1"/>
  <Destructor id="_2539" name="btCollisionConfiguration" virtual="1" overrides="" context="_219" access="public" mangled="_ZN24btCollisionConfigurationD1Ev *INTERNAL* " demangled="btCollisionConfiguration::~btCollisionConfiguration()" location="f65:31" file="f65" line="31" endline="33" inline="1">
  </Destructor>
  <Method id="_2540" name="getPersistentManifoldPool" returns="_9047" virtual="1" pure_virtual="1" overrides="" context="_219" access="public" mangled="_ZN24btCollisionConfiguration25getPersistentManifoldPoolEv" demangled="btCollisionConfiguration::getPersistentManifoldPool()" location="f65:36" file="f65" line="36" extern="1"/>
  <Method id="_2541" name="getCollisionAlgorithmPool" returns="_9047" virtual="1" pure_virtual="1" overrides="" context="_219" access="public" mangled="_ZN24btCollisionConfiguration25getCollisionAlgorithmPoolEv" demangled="btCollisionConfiguration::getCollisionAlgorithmPool()" location="f65:38" file="f65" line="38" extern="1"/>
  <Method id="_2542" name="getCollisionAlgorithmCreateFunc" returns="_9048" virtual="1" pure_virtual="1" overrides="" context="_219" access="public" mangled="_ZN24btCollisionConfiguration31getCollisionAlgorithmCreateFuncEii" demangled="btCollisionConfiguration::getCollisionAlgorithmCreateFunc(int, int)" location="f65:41" file="f65" line="41" extern="1">
    <Argument name="proxyType0" type="_168" location="f65:41" file="f65" line="41"/>
    <Argument name="proxyType1" type="_168" location="f65:41" file="f65" line="41"/>
  </Method>
  <OperatorMethod id="_2543" name="=" returns="_9049" artificial="1" throw="" context="_220" access="public" mangled="_ZN15btCapsuleShapeXaSERKS_" demangled="btCapsuleShapeX::operator=(btCapsuleShapeX const&amp;)" location="f7:126" file="f7" line="126" endline="126" inline="1">
    <Argument type="_9050" location="f7:126" file="f7" line="126"/>
  </OperatorMethod>
  <Constructor id="_2544" name="btCapsuleShapeX" artificial="1" throw="" context="_220" access="public" mangled="_ZN15btCapsuleShapeXC1ERKS_ *INTERNAL* " demangled="btCapsuleShapeX::btCapsuleShapeX(btCapsuleShapeX const&amp;)" location="f7:126" file="f7" line="126" endline="126" inline="1">
    <Argument type="_9050" location="f7:126" file="f7" line="126"/>
  </Constructor>
  <Constructor id="_2545" name="btCapsuleShapeX" explicit="1" context="_220" access="public" mangled="_ZN15btCapsuleShapeXC1Eff *INTERNAL* " demangled="btCapsuleShapeX::btCapsuleShapeX(float, float)" location="f7:129" file="f7" line="129" extern="1">
    <Argument name="radius" type="_362" location="f7:129" file="f7" line="129"/>
    <Argument name="height" type="_362" location="f7:129" file="f7" line="129"/>
  </Constructor>
  <Method id="_2546" name="getName" returns="_1823" const="1" virtual="1" overrides="_7063 " context="_220" access="public" mangled="_ZNK15btCapsuleShapeX7getNameEv" demangled="btCapsuleShapeX::getName() const" location="f7:132" file="f7" line="132" endline="134" inline="1"/>
  <Destructor id="_2547" name="btCapsuleShapeX" virtual="1" overrides="_7071 " artificial="1" context="_220" access="public" mangled="_ZN15btCapsuleShapeXD1Ev *INTERNAL* " demangled="btCapsuleShapeX::~btCapsuleShapeX()" location="f7:126" file="f7" line="126" endline="126" inline="1">
  </Destructor>
  <OperatorMethod id="_2548" name="=" returns="_9051" artificial="1" throw="" context="_221" access="public" mangled="_ZN15btCapsuleShapeZaSERKS_" demangled="btCapsuleShapeZ::operator=(btCapsuleShapeZ const&amp;)" location="f7:144" file="f7" line="144" endline="144" inline="1">
    <Argument type="_9052" location="f7:144" file="f7" line="144"/>
  </OperatorMethod>
  <Constructor id="_2549" name="btCapsuleShapeZ" artificial="1" throw="" context="_221" access="public" mangled="_ZN15btCapsuleShapeZC1ERKS_ *INTERNAL* " demangled="btCapsuleShapeZ::btCapsuleShapeZ(btCapsuleShapeZ const&amp;)" location="f7:144" file="f7" line="144" endline="144" inline="1">
    <Argument type="_9052" location="f7:144" file="f7" line="144"/>
  </Constructor>
  <Constructor id="_2550" name="btCapsuleShapeZ" explicit="1" context="_221" access="public" mangled="_ZN15btCapsuleShapeZC1Eff *INTERNAL* " demangled="btCapsuleShapeZ::btCapsuleShapeZ(float, float)" location="f7:146" file="f7" line="146" extern="1">
    <Argument name="radius" type="_362" location="f7:146" file="f7" line="146"/>
    <Argument name="height" type="_362" location="f7:146" file="f7" line="146"/>
  </Constructor>
  <Method id="_2551" name="getName" returns="_1823" const="1" virtual="1" overrides="_7063 " context="_221" access="public" mangled="_ZNK15btCapsuleShapeZ7getNameEv" demangled="btCapsuleShapeZ::getName() const" location="f7:149" file="f7" line="149" endline="151" inline="1"/>
  <Destructor id="_2552" name="btCapsuleShapeZ" virtual="1" overrides="_7071 " artificial="1" context="_221" access="public" mangled="_ZN15btCapsuleShapeZD1Ev *INTERNAL* " demangled="btCapsuleShapeZ::~btCapsuleShapeZ()" location="f7:144" file="f7" line="144" endline="144" inline="1">
  </Destructor>
  <ReferenceType id="_2553" type="_119c" size="64" align="64"/>
  <Field id="_2554" name="m_chassisConnectionCS" type="_193" offset="0" context="_246" access="public" location="f69:21" file="f69" line="21"/>
  <Field id="_2555" name="m_wheelDirectionCS" type="_193" offset="128" context="_246" access="public" location="f69:22" file="f69" line="22"/>
  <Field id="_2556" name="m_wheelAxleCS" type="_193" offset="256" context="_246" access="public" location="f69:23" file="f69" line="23"/>
  <Field id="_2557" name="m_suspensionRestLength" type="_362" offset="384" context="_246" access="public" location="f69:24" file="f69" line="24"/>
  <Field id="_2558" name="m_maxSuspensionTravelCm" type="_362" offset="416" context="_246" access="public" location="f69:25" file="f69" line="25"/>
  <Field id="_2559" name="m_wheelRadius" type="_362" offset="448" context="_246" access="public" location="f69:26" file="f69" line="26"/>
  <Field id="_2560" name="m_suspensionStiffness" type="_362" offset="480" context="_246" access="public" location="f69:28" file="f69" line="28"/>
  <Field id="_2561" name="m_wheelsDampingCompression" type="_362" offset="512" context="_246" access="public" location="f69:29" file="f69" line="29"/>
  <Field id="_2562" name="m_wheelsDampingRelaxation" type="_362" offset="544" context="_246" access="public" location="f69:30" file="f69" line="30"/>
  <Field id="_2563" name="m_frictionSlip" type="_362" offset="576" context="_246" access="public" location="f69:31" file="f69" line="31"/>
  <Field id="_2564" name="m_maxSuspensionForce" type="_362" offset="608" context="_246" access="public" location="f69:32" file="f69" line="32"/>
  <Field id="_2565" name="m_bIsFrontWheel" type="_1834" offset="640" context="_246" access="public" location="f69:33" file="f69" line="33"/>
  <Destructor id="_2566" name="btWheelInfoConstructionInfo" artificial="1" throw="" context="_246" access="public" mangled="_ZN27btWheelInfoConstructionInfoD1Ev *INTERNAL* " demangled="btWheelInfoConstructionInfo::~btWheelInfoConstructionInfo()" location="f69:20" file="f69" line="20" endline="20" inline="1">
  </Destructor>
  <OperatorMethod id="_2567" name="=" returns="_9054" artificial="1" throw="" context="_246" access="public" mangled="_ZN27btWheelInfoConstructionInfoaSERKS_" demangled="btWheelInfoConstructionInfo::operator=(btWheelInfoConstructionInfo const&amp;)" location="f69:20" file="f69" line="20" endline="20" inline="1">
    <Argument type="_9055" location="f69:20" file="f69" line="20"/>
  </OperatorMethod>
  <Constructor id="_2568" name="btWheelInfoConstructionInfo" artificial="1" throw="" context="_246" access="public" mangled="_ZN27btWheelInfoConstructionInfoC1ERKS_ *INTERNAL* " demangled="btWheelInfoConstructionInfo::btWheelInfoConstructionInfo(btWheelInfoConstructionInfo const&amp;)" location="f69:20" file="f69" line="20" endline="20" inline="1">
    <Argument type="_9055" location="f69:20" file="f69" line="20"/>
  </Constructor>
  <Constructor id="_2569" name="btWheelInfoConstructionInfo" artificial="1" context="_246" access="public" mangled="_ZN27btWheelInfoConstructionInfoC1Ev *INTERNAL* " demangled="btWheelInfoConstructionInfo::btWheelInfoConstructionInfo()" location="f69:20" file="f69" line="20" endline="20" inline="1"/>
  <PointerType id="_2570" type="_512" size="64" align="64"/>
  <Field id="_2571" name="m_flags" type="_168" offset="0" context="_260" access="public" location="f8:91" file="f8" line="91"/>
  <Field id="_2572" name="m_edgeV0V1Angle" type="_361" offset="32" context="_260" access="public" location="f8:92" file="f8" line="92"/>
  <Field id="_2573" name="m_edgeV1V2Angle" type="_361" offset="64" context="_260" access="public" location="f8:93" file="f8" line="93"/>
  <Field id="_2574" name="m_edgeV2V0Angle" type="_361" offset="96" context="_260" access="public" location="f8:94" file="f8" line="94"/>
  <Destructor id="_2575" name="btTriangleInfoData" artificial="1" throw="" context="_260" access="public" mangled="_ZN18btTriangleInfoDataD1Ev *INTERNAL* " demangled="btTriangleInfoData::~btTriangleInfoData()" location="f8:90" file="f8" line="90" endline="90" inline="1">
  </Destructor>
  <OperatorMethod id="_2576" name="=" returns="_9056" artificial="1" throw="" context="_260" access="public" mangled="_ZN18btTriangleInfoDataaSERKS_" demangled="btTriangleInfoData::operator=(btTriangleInfoData const&amp;)" location="f8:90" file="f8" line="90" endline="90" inline="1">
    <Argument type="_9057" location="f8:90" file="f8" line="90"/>
  </OperatorMethod>
  <Constructor id="_2577" name="btTriangleInfoData" artificial="1" throw="" context="_260" access="public" mangled="_ZN18btTriangleInfoDataC1ERKS_ *INTERNAL* " demangled="btTriangleInfoData::btTriangleInfoData(btTriangleInfoData const&amp;)" location="f8:90" file="f8" line="90" endline="90" inline="1">
    <Argument type="_9057" location="f8:90" file="f8" line="90"/>
  </Constructor>
  <Constructor id="_2578" name="btTriangleInfoData" artificial="1" throw="" context="_260" access="public" mangled="_ZN18btTriangleInfoDataC1Ev *INTERNAL* " demangled="btTriangleInfoData::btTriangleInfoData()" location="f8:90" file="f8" line="90" inline="1"/>
  <Field id="_2579" name="m_collisionShapeData" type="_1301" offset="0" context="_261" access="public" location="f71:122" file="f71" line="122"/>
  <Field id="_2580" name="m_meshInterface" type="_1753" offset="128" context="_261" access="public" location="f71:124" file="f71" line="124"/>
  <Field id="_2581" name="m_quantizedFloatBvh" type="_9058" offset="384" context="_261" access="public" location="f71:126" file="f71" line="126"/>
  <Field id="_2582" name="m_quantizedDoubleBvh" type="_9059" offset="448" context="_261" access="public" location="f71:127" file="f71" line="127"/>
  <Field id="_2583" name="m_triangleInfoMap" type="_9060" offset="512" context="_261" access="public" location="f71:129" file="f71" line="129"/>
  <Field id="_2584" name="m_collisionMargin" type="_361" offset="576" context="_261" access="public" location="f71:131" file="f71" line="131"/>
  <Field id="_2585" name="m_pad3" type="_8881" offset="608" context="_261" access="public" location="f71:133" file="f71" line="133"/>
  <Destructor id="_2586" name="btTriangleMeshShapeData" artificial="1" throw="" context="_261" access="public" mangled="_ZN23btTriangleMeshShapeDataD1Ev *INTERNAL* " demangled="btTriangleMeshShapeData::~btTriangleMeshShapeData()" location="f71:121" file="f71" line="121" endline="121" inline="1">
  </Destructor>
  <OperatorMethod id="_2587" name="=" returns="_9061" artificial="1" throw="" context="_261" access="public" mangled="_ZN23btTriangleMeshShapeDataaSERKS_" demangled="btTriangleMeshShapeData::operator=(btTriangleMeshShapeData const&amp;)" location="f71:121" file="f71" line="121" endline="121" inline="1">
    <Argument type="_9062" location="f71:121" file="f71" line="121"/>
  </OperatorMethod>
  <Constructor id="_2588" name="btTriangleMeshShapeData" artificial="1" throw="" context="_261" access="public" mangled="_ZN23btTriangleMeshShapeDataC1ERKS_ *INTERNAL* " demangled="btTriangleMeshShapeData::btTriangleMeshShapeData(btTriangleMeshShapeData const&amp;)" location="f71:121" file="f71" line="121" endline="121" inline="1">
    <Argument type="_9062" location="f71:121" file="f71" line="121"/>
  </Constructor>
  <Constructor id="_2589" name="btTriangleMeshShapeData" artificial="1" throw="" context="_261" access="public" mangled="_ZN23btTriangleMeshShapeDataC1Ev *INTERNAL* " demangled="btTriangleMeshShapeData::btTriangleMeshShapeData()" location="f71:121" file="f71" line="121" inline="1"/>
  <Field id="_2590" name="m_solverInfo" type="_916" offset="0" context="_268" access="public" location="f72:160" file="f72" line="160"/>
  <Field id="_2591" name="m_gravity" type="_621" offset="704" context="_268" access="public" location="f72:161" file="f72" line="161"/>
  <Destructor id="_2592" name="btDynamicsWorldFloatData" artificial="1" throw="" context="_268" access="public" mangled="_ZN24btDynamicsWorldFloatDataD1Ev *INTERNAL* " demangled="btDynamicsWorldFloatData::~btDynamicsWorldFloatData()" location="f72:159" file="f72" line="159" endline="159" inline="1">
  </Destructor>
  <OperatorMethod id="_2593" name="=" returns="_9063" artificial="1" throw="" context="_268" access="public" mangled="_ZN24btDynamicsWorldFloatDataaSERKS_" demangled="btDynamicsWorldFloatData::operator=(btDynamicsWorldFloatData const&amp;)" location="f72:159" file="f72" line="159" endline="159" inline="1">
    <Argument type="_9064" location="f72:159" file="f72" line="159"/>
  </OperatorMethod>
  <Constructor id="_2594" name="btDynamicsWorldFloatData" artificial="1" throw="" context="_268" access="public" mangled="_ZN24btDynamicsWorldFloatDataC1ERKS_ *INTERNAL* " demangled="btDynamicsWorldFloatData::btDynamicsWorldFloatData(btDynamicsWorldFloatData const&amp;)" location="f72:159" file="f72" line="159" endline="159" inline="1">
    <Argument type="_9064" location="f72:159" file="f72" line="159"/>
  </Constructor>
  <Constructor id="_2595" name="btDynamicsWorldFloatData" artificial="1" throw="" context="_268" access="public" mangled="_ZN24btDynamicsWorldFloatDataC1Ev *INTERNAL* " demangled="btDynamicsWorldFloatData::btDynamicsWorldFloatData()" location="f72:159" file="f72" line="159" inline="1"/>
  <Field id="_2596" name="m_swapped" type="_1834" offset="64" context="_271" access="public" location="f73:28" file="f73" line="28"/>
  <OperatorMethod id="_2597" name="=" returns="_9065" artificial="1" throw="" context="_271" access="public" mangled="_ZN30btCollisionAlgorithmCreateFuncaSERKS_" demangled="btCollisionAlgorithmCreateFunc::operator=(btCollisionAlgorithmCreateFunc const&amp;)" location="f73:27" file="f73" line="27" endline="27" inline="1">
    <Argument type="_9066" location="f73:27" file="f73" line="27"/>
  </OperatorMethod>
  <Constructor id="_2598" name="btCollisionAlgorithmCreateFunc" artificial="1" throw="" context="_271" access="public" mangled="_ZN30btCollisionAlgorithmCreateFuncC1ERKS_ *INTERNAL* " demangled="btCollisionAlgorithmCreateFunc::btCollisionAlgorithmCreateFunc(btCollisionAlgorithmCreateFunc const&amp;)" location="f73:27" file="f73" line="27" endline="27" inline="1">
    <Argument type="_9066" location="f73:27" file="f73" line="27"/>
  </Constructor>
  <Constructor id="_2599" name="btCollisionAlgorithmCreateFunc" explicit="1" context="_271" access="public" mangled="_ZN30btCollisionAlgorithmCreateFuncC1Ev *INTERNAL* " demangled="btCollisionAlgorithmCreateFunc::btCollisionAlgorithmCreateFunc()" location="f73:30" file="f73" line="30" endline="31" inline="1"/>
  <Destructor id="_2600" name="btCollisionAlgorithmCreateFunc" virtual="1" overrides="" context="_271" access="public" mangled="_ZN30btCollisionAlgorithmCreateFuncD1Ev *INTERNAL* " demangled="btCollisionAlgorithmCreateFunc::~btCollisionAlgorithmCreateFunc()" location="f73:34" file="f73" line="34" endline="34" inline="1">
  </Destructor>
  <Method id="_2601" name="CreateCollisionAlgorithm" returns="_9067" virtual="1" overrides="" context="_271" access="public" mangled="_ZN30btCollisionAlgorithmCreateFunc24CreateCollisionAlgorithmER36btCollisionAlgorithmConstructionInfoPK24btCollisionObjectWrapperS4_" demangled="btCollisionAlgorithmCreateFunc::CreateCollisionAlgorithm(btCollisionAlgorithmConstructionInfo&amp;, btCollisionObjectWrapper const*, btCollisionObjectWrapper const*)" location="f73:36" file="f73" line="36" endline="41" inline="1">
    <Argument type="_9068" location="f73:36" file="f73" line="36"/>
    <Argument name="body0Wrap" type="_9020" location="f73:36" file="f73" line="36"/>
    <Argument name="body1Wrap" type="_9020" location="f73:36" file="f73" line="36"/>
  </Method>
  <PointerType id="_2602" type="_684" size="64" align="64"/>
  <PointerType id="_2603" type="_1497" size="64" align="64"/>
  <CvQualifiedType id="_1970r" type="_1970" restrict="1"/>
  <PointerType id="_2605" type="_648" size="64" align="64"/>
  <CvQualifiedType id="_2605r" type="_2605" restrict="1"/>
  <Field id="_2607" name="m_value" type="_168" offset="0" context="_289" access="public" location="f50:106" file="f50" line="106"/>
  <Destructor id="_2608" name="btIntIndexData" artificial="1" throw="" context="_289" access="public" mangled="_ZN14btIntIndexDataD1Ev *INTERNAL* " demangled="btIntIndexData::~btIntIndexData()" location="f50:105" file="f50" line="105" endline="105" inline="1">
  </Destructor>
  <OperatorMethod id="_2609" name="=" returns="_9069" artificial="1" throw="" context="_289" access="public" mangled="_ZN14btIntIndexDataaSERKS_" demangled="btIntIndexData::operator=(btIntIndexData const&amp;)" location="f50:105" file="f50" line="105" endline="105" inline="1">
    <Argument type="_9070" location="f50:105" file="f50" line="105"/>
  </OperatorMethod>
  <Constructor id="_2610" name="btIntIndexData" artificial="1" throw="" context="_289" access="public" mangled="_ZN14btIntIndexDataC1ERKS_ *INTERNAL* " demangled="btIntIndexData::btIntIndexData(btIntIndexData const&amp;)" location="f50:105" file="f50" line="105" endline="105" inline="1">
    <Argument type="_9070" location="f50:105" file="f50" line="105"/>
  </Constructor>
  <Constructor id="_2611" name="btIntIndexData" artificial="1" throw="" context="_289" access="public" mangled="_ZN14btIntIndexDataC1Ev *INTERNAL* " demangled="btIntIndexData::btIntIndexData()" location="f50:105" file="f50" line="105" inline="1"/>
  <Field id="_2612" name="m_broadphaseHandle" type="_1077" offset="0" context="_295" access="public" location="f56:493" file="f56" line="493"/>
  <Field id="_2613" name="m_collisionShape" type="_1077" offset="64" context="_295" access="public" location="f56:494" file="f56" line="494"/>
  <Field id="_2614" name="m_rootCollisionShape" type="_8933" offset="128" context="_295" access="public" location="f56:495" file="f56" line="495"/>
  <Field id="_2615" name="m_name" type="_1071" offset="192" context="_295" access="public" location="f56:496" file="f56" line="496"/>
  <Field id="_2616" name="m_worldTransform" type="_765" offset="256" context="_295" access="public" location="f56:498" file="f56" line="498"/>
  <Field id="_2617" name="m_interpolationWorldTransform" type="_765" offset="1280" context="_295" access="public" location="f56:499" file="f56" line="499"/>
  <Field id="_2618" name="m_interpolationLinearVelocity" type="_1353" offset="2304" context="_295" access="public" location="f56:500" file="f56" line="500"/>
  <Field id="_2619" name="m_interpolationAngularVelocity" type="_1353" offset="2560" context="_295" access="public" location="f56:501" file="f56" line="501"/>
  <Field id="_2620" name="m_anisotropicFriction" type="_1353" offset="2816" context="_295" access="public" location="f56:502" file="f56" line="502"/>
  <Field id="_2621" name="m_contactProcessingThreshold" type="_512" offset="3072" context="_295" access="public" location="f56:503" file="f56" line="503"/>
  <Field id="_2622" name="m_deactivationTime" type="_512" offset="3136" context="_295" access="public" location="f56:504" file="f56" line="504"/>
  <Field id="_2623" name="m_friction" type="_512" offset="3200" context="_295" access="public" location="f56:505" file="f56" line="505"/>
  <Field id="_2624" name="m_rollingFriction" type="_512" offset="3264" context="_295" access="public" location="f56:506" file="f56" line="506"/>
  <Field id="_2625" name="m_restitution" type="_512" offset="3328" context="_295" access="public" location="f56:507" file="f56" line="507"/>
  <Field id="_2626" name="m_hitFraction" type="_512" offset="3392" context="_295" access="public" location="f56:508" file="f56" line="508"/>
  <Field id="_2627" name="m_ccdSweptSphereRadius" type="_512" offset="3456" context="_295" access="public" location="f56:509" file="f56" line="509"/>
  <Field id="_2628" name="m_ccdMotionThreshold" type="_512" offset="3520" context="_295" access="public" location="f56:510" file="f56" line="510"/>
  <Field id="_2629" name="m_hasAnisotropicFriction" type="_168" offset="3584" context="_295" access="public" location="f56:512" file="f56" line="512"/>
  <Field id="_2630" name="m_collisionFlags" type="_168" offset="3616" context="_295" access="public" location="f56:513" file="f56" line="513"/>
  <Field id="_2631" name="m_islandTag1" type="_168" offset="3648" context="_295" access="public" location="f56:514" file="f56" line="514"/>
  <Field id="_2632" name="m_companionId" type="_168" offset="3680" context="_295" access="public" location="f56:515" file="f56" line="515"/>
  <Field id="_2633" name="m_activationState1" type="_168" offset="3712" context="_295" access="public" location="f56:516" file="f56" line="516"/>
  <Field id="_2634" name="m_internalType" type="_168" offset="3744" context="_295" access="public" location="f56:517" file="f56" line="517"/>
  <Field id="_2635" name="m_checkCollideWith" type="_168" offset="3776" context="_295" access="public" location="f56:518" file="f56" line="518"/>
  <Field id="_2636" name="m_padding" type="_8881" offset="3808" context="_295" access="public" location="f56:520" file="f56" line="520"/>
  <Destructor id="_2637" name="btCollisionObjectDoubleData" artificial="1" throw="" context="_295" access="public" mangled="_ZN27btCollisionObjectDoubleDataD1Ev *INTERNAL* " demangled="btCollisionObjectDoubleData::~btCollisionObjectDoubleData()" location="f56:492" file="f56" line="492" endline="492" inline="1">
  </Destructor>
  <OperatorMethod id="_2638" name="=" returns="_9071" artificial="1" throw="" context="_295" access="public" mangled="_ZN27btCollisionObjectDoubleDataaSERKS_" demangled="btCollisionObjectDoubleData::operator=(btCollisionObjectDoubleData const&amp;)" location="f56:492" file="f56" line="492" endline="492" inline="1">
    <Argument type="_9072" location="f56:492" file="f56" line="492"/>
  </OperatorMethod>
  <Constructor id="_2639" name="btCollisionObjectDoubleData" artificial="1" throw="" context="_295" access="public" mangled="_ZN27btCollisionObjectDoubleDataC1ERKS_ *INTERNAL* " demangled="btCollisionObjectDoubleData::btCollisionObjectDoubleData(btCollisionObjectDoubleData const&amp;)" location="f56:492" file="f56" line="492" endline="492" inline="1">
    <Argument type="_9072" location="f56:492" file="f56" line="492"/>
  </Constructor>
  <Constructor id="_2640" name="btCollisionObjectDoubleData" artificial="1" throw="" context="_295" access="public" mangled="_ZN27btCollisionObjectDoubleDataC1Ev *INTERNAL* " demangled="btCollisionObjectDoubleData::btCollisionObjectDoubleData()" location="f56:492" file="f56" line="492" inline="1"/>
  <Field id="_2641" name="m_dispatcherFlags" type="_168" offset="64" context="_298" access="protected" location="f15:48" file="f15" line="48"/>
  <Field id="_2642" name="m_manifoldsPtr" type="_1545" offset="128" context="_298" access="protected" location="f15:50" file="f15" line="50"/>
  <Field id="_2643" name="m_defaultManifoldResult" type="_171" offset="384" context="_298" access="protected" location="f15:52" file="f15" line="52"/>
  <Field id="_2644" name="m_nearCallback" type="_27" offset="768" context="_298" access="protected" location="f15:54" file="f15" line="54"/>
  <Field id="_2645" name="m_collisionAlgorithmPoolAllocator" type="_9047" offset="832" context="_298" access="protected" location="f15:56" file="f15" line="56"/>
  <Field id="_2646" name="m_persistentManifoldPoolAllocator" type="_9047" offset="896" context="_298" access="protected" location="f15:58" file="f15" line="58"/>
  <Field id="_2647" name="m_doubleDispatch" type="_9073" offset="960" context="_298" access="protected" location="f15:60" file="f15" line="60"/>
  <Field id="_2648" name="m_collisionConfiguration" type="_9074" offset="83904" context="_298" access="protected" location="f15:62" file="f15" line="62"/>
  <Enumeration id="_2649" name="DispatcherFlags" context="_298" access="public" location="f15:67" file="f15" line="67" artificial="1" size="32" align="32">
    <EnumValue name="CD_STATIC_STATIC_REPORTED" init="1"/>
    <EnumValue name="CD_USE_RELATIVE_CONTACT_BREAKING_THRESHOLD" init="2"/>
    <EnumValue name="CD_DISABLE_CONTACTPOOL_DYNAMIC_ALLOCATION" init="4"/>
  </Enumeration>
  <OperatorMethod id="_2650" name="=" returns="_9075" artificial="1" context="_298" access="public" mangled="_ZN21btCollisionDispatcheraSERKS_" demangled="btCollisionDispatcher::operator=(btCollisionDispatcher const&amp;)" location="f15:44" file="f15" line="44" endline="44" inline="1">
    <Argument type="_9076" location="f15:44" file="f15" line="44"/>
  </OperatorMethod>
  <Constructor id="_2651" name="btCollisionDispatcher" artificial="1" context="_298" access="public" mangled="_ZN21btCollisionDispatcherC1ERKS_ *INTERNAL* " demangled="btCollisionDispatcher::btCollisionDispatcher(btCollisionDispatcher const&amp;)" location="f15:44" file="f15" line="44" endline="44" inline="1">
    <Argument type="_9076" location="f15:44" file="f15" line="44"/>
  </Constructor>
  <Method id="_2652" name="getDispatcherFlags" returns="_168" const="1" context="_298" access="public" mangled="_ZNK21btCollisionDispatcher18getDispatcherFlagsEv" demangled="btCollisionDispatcher::getDispatcherFlags() const" location="f15:74" file="f15" line="74" endline="76" inline="1"/>
  <Method id="_2653" name="setDispatcherFlags" returns="_635" context="_298" access="public" mangled="_ZN21btCollisionDispatcher18setDispatcherFlagsEi" demangled="btCollisionDispatcher::setDispatcherFlags(int)" location="f15:79" file="f15" line="79" endline="81" inline="1">
    <Argument name="flags" type="_168" location="f15:79" file="f15" line="79"/>
  </Method>
  <Method id="_2654" name="registerCollisionCreateFunc" returns="_635" context="_298" access="public" mangled="_ZN21btCollisionDispatcher27registerCollisionCreateFuncEiiP30btCollisionAlgorithmCreateFunc" demangled="btCollisionDispatcher::registerCollisionCreateFunc(int, int, btCollisionAlgorithmCreateFunc*)" location="f15:85" file="f15" line="85" extern="1">
    <Argument name="proxyType0" type="_168" location="f15:85" file="f15" line="85"/>
    <Argument name="proxyType1" type="_168" location="f15:85" file="f15" line="85"/>
    <Argument name="createFunc" type="_9048" location="f15:85" file="f15" line="85"/>
  </Method>
  <Method id="_2655" name="getNumManifolds" returns="_168" const="1" virtual="1" overrides="_5436 " context="_298" access="public" mangled="_ZNK21btCollisionDispatcher15getNumManifoldsEv" demangled="btCollisionDispatcher::getNumManifolds() const" location="f15:87" file="f15" line="87" endline="89" inline="1"/>
  <Method id="_2656" name="getInternalManifoldPointer" returns="_4404" virtual="1" overrides="_5438 " context="_298" access="public" mangled="_ZN21btCollisionDispatcher26getInternalManifoldPointerEv" demangled="btCollisionDispatcher::getInternalManifoldPointer()" location="f15:92" file="f15" line="92" endline="94" inline="1"/>
  <Method id="_2657" name="getManifoldByIndexInternal" returns="_4408" virtual="1" overrides="_5437 " context="_298" access="public" mangled="_ZN21btCollisionDispatcher26getManifoldByIndexInternalEi" demangled="btCollisionDispatcher::getManifoldByIndexInternal(int)" location="f15:97" file="f15" line="97" endline="99" inline="1">
    <Argument name="index" type="_168" location="f15:97" file="f15" line="97"/>
  </Method>
  <Method id="_2658" name="getManifoldByIndexInternal" returns="_9024" const="1" context="_298" access="public" mangled="_ZNK21btCollisionDispatcher26getManifoldByIndexInternalEi" demangled="btCollisionDispatcher::getManifoldByIndexInternal(int) const" location="f15:102" file="f15" line="102" endline="104" inline="1">
    <Argument name="index" type="_168" location="f15:102" file="f15" line="102"/>
  </Method>
  <Constructor id="_2659" name="btCollisionDispatcher" context="_298" access="public" mangled="_ZN21btCollisionDispatcherC1EP24btCollisionConfiguration *INTERNAL* " demangled="btCollisionDispatcher::btCollisionDispatcher(btCollisionConfiguration*)" location="f15:107" file="f15" line="107" extern="1">
    <Argument name="collisionConfiguration" type="_9074" location="f15:107" file="f15" line="107"/>
  </Constructor>
  <Destructor id="_2660" name="btCollisionDispatcher" virtual="1" overrides="_5428 " context="_298" access="public" mangled="_ZN21btCollisionDispatcherD1Ev *INTERNAL* " demangled="btCollisionDispatcher::~btCollisionDispatcher()" location="f15:109" file="f15" line="109" extern="1">
  </Destructor>
  <Method id="_2661" name="getNewManifold" returns="_4408" virtual="1" overrides="_5430 " context="_298" access="public" mangled="_ZN21btCollisionDispatcher14getNewManifoldEPK17btCollisionObjectS2_" demangled="btCollisionDispatcher::getNewManifold(btCollisionObject const*, btCollisionObject const*)" location="f15:111" file="f15" line="111" extern="1">
    <Argument name="b0" type="_4331" location="f15:111" file="f15" line="111"/>
    <Argument name="b1" type="_4331" location="f15:111" file="f15" line="111"/>
  </Method>
  <Method id="_2662" name="releaseManifold" returns="_635" virtual="1" overrides="_5431 " context="_298" access="public" mangled="_ZN21btCollisionDispatcher15releaseManifoldEP20btPersistentManifold" demangled="btCollisionDispatcher::releaseManifold(btPersistentManifold*)" location="f15:113" file="f15" line="113" extern="1">
    <Argument name="manifold" type="_4408" location="f15:113" file="f15" line="113"/>
  </Method>
  <Method id="_2663" name="clearManifold" returns="_635" virtual="1" overrides="_5432 " context="_298" access="public" mangled="_ZN21btCollisionDispatcher13clearManifoldEP20btPersistentManifold" demangled="btCollisionDispatcher::clearManifold(btPersistentManifold*)" location="f15:116" file="f15" line="116" extern="1">
    <Argument name="manifold" type="_4408" location="f15:116" file="f15" line="116"/>
  </Method>
  <Method id="_2664" name="findAlgorithm" returns="_9067" virtual="1" overrides="_5429 " context="_298" access="public" mangled="_ZN21btCollisionDispatcher13findAlgorithmEPK24btCollisionObjectWrapperS2_P20btPersistentManifold" demangled="btCollisionDispatcher::findAlgorithm(btCollisionObjectWrapper const*, btCollisionObjectWrapper const*, btPersistentManifold*)" location="f15:118" file="f15" line="118" extern="1">
    <Argument name="body0Wrap" type="_9020" location="f15:118" file="f15" line="118"/>
    <Argument name="body1Wrap" type="_9020" location="f15:118" file="f15" line="118"/>
    <Argument name="sharedManifold" type="_4408" location="f15:118" file="f15" line="118" default="0"/>
  </Method>
  <Method id="_2665" name="needsCollision" returns="_1834" virtual="1" overrides="_5433 " context="_298" access="public" mangled="_ZN21btCollisionDispatcher14needsCollisionEPK17btCollisionObjectS2_" demangled="btCollisionDispatcher::needsCollision(btCollisionObject const*, btCollisionObject const*)" location="f15:120" file="f15" line="120" extern="1">
    <Argument name="body0" type="_4331" location="f15:120" file="f15" line="120"/>
    <Argument name="body1" type="_4331" location="f15:120" file="f15" line="120"/>
  </Method>
  <Method id="_2666" name="needsResponse" returns="_1834" virtual="1" overrides="_5434 " context="_298" access="public" mangled="_ZN21btCollisionDispatcher13needsResponseEPK17btCollisionObjectS2_" demangled="btCollisionDispatcher::needsResponse(btCollisionObject const*, btCollisionObject const*)" location="f15:122" file="f15" line="122" extern="1">
    <Argument name="body0" type="_4331" location="f15:122" file="f15" line="122"/>
    <Argument name="body1" type="_4331" location="f15:122" file="f15" line="122"/>
  </Method>
  <Method id="_2667" name="dispatchAllCollisionPairs" returns="_635" virtual="1" overrides="_5435 " context="_298" access="public" mangled="_ZN21btCollisionDispatcher25dispatchAllCollisionPairsEP22btOverlappingPairCacheRK16btDispatcherInfoP12btDispatcher" demangled="btCollisionDispatcher::dispatchAllCollisionPairs(btOverlappingPairCache*, btDispatcherInfo const&amp;, btDispatcher*)" location="f15:124" file="f15" line="124" extern="1">
    <Argument name="pairCache" type="_8940" location="f15:124" file="f15" line="124"/>
    <Argument name="dispatchInfo" type="_9077" location="f15:124" file="f15" line="124"/>
    <Argument name="dispatcher" type="_8928" location="f15:124" file="f15" line="124"/>
  </Method>
  <Method id="_2668" name="setNearCallback" returns="_635" context="_298" access="public" mangled="_ZN21btCollisionDispatcher15setNearCallbackEPFvR16btBroadphasePairRS_RK16btDispatcherInfoE" demangled="btCollisionDispatcher::setNearCallback(void (*)(btBroadphasePair&amp;, btCollisionDispatcher&amp;, btDispatcherInfo const&amp;))" location="f15:126" file="f15" line="126" endline="128" inline="1">
    <Argument name="nearCallback" type="_27" location="f15:126" file="f15" line="126"/>
  </Method>
  <Method id="_2669" name="getNearCallback" returns="_27" const="1" context="_298" access="public" mangled="_ZNK21btCollisionDispatcher15getNearCallbackEv" demangled="btCollisionDispatcher::getNearCallback() const" location="f15:131" file="f15" line="131" endline="133" inline="1"/>
  <Method id="_2670" name="defaultNearCallback" returns="_635" static="1" context="_298" access="public" mangled="_ZN21btCollisionDispatcher19defaultNearCallbackER16btBroadphasePairRS_RK16btDispatcherInfo" demangled="btCollisionDispatcher::defaultNearCallback(btBroadphasePair&amp;, btCollisionDispatcher&amp;, btDispatcherInfo const&amp;)" location="f15:137" file="f15" line="137" extern="1">
    <Argument name="collisionPair" type="_4387" location="f15:137" file="f15" line="137"/>
    <Argument name="dispatcher" type="_9075" location="f15:137" file="f15" line="137"/>
    <Argument name="dispatchInfo" type="_9077" location="f15:137" file="f15" line="137"/>
  </Method>
  <Method id="_2671" name="allocateCollisionAlgorithm" returns="_1077" virtual="1" overrides="_5441 " context="_298" access="public" mangled="_ZN21btCollisionDispatcher26allocateCollisionAlgorithmEi" demangled="btCollisionDispatcher::allocateCollisionAlgorithm(int)" location="f15:139" file="f15" line="139" extern="1">
    <Argument name="size" type="_168" location="f15:139" file="f15" line="139"/>
  </Method>
  <Method id="_2672" name="freeCollisionAlgorithm" returns="_635" virtual="1" overrides="_5442 " context="_298" access="public" mangled="_ZN21btCollisionDispatcher22freeCollisionAlgorithmEPv" demangled="btCollisionDispatcher::freeCollisionAlgorithm(void*)" location="f15:141" file="f15" line="141" extern="1">
    <Argument name="ptr" type="_1077" location="f15:141" file="f15" line="141"/>
  </Method>
  <Method id="_2673" name="getCollisionConfiguration" returns="_9074" context="_298" access="public" mangled="_ZN21btCollisionDispatcher25getCollisionConfigurationEv" demangled="btCollisionDispatcher::getCollisionConfiguration()" location="f15:143" file="f15" line="143" endline="145" inline="1"/>
  <Method id="_2674" name="getCollisionConfiguration" returns="_9078" const="1" context="_298" access="public" mangled="_ZNK21btCollisionDispatcher25getCollisionConfigurationEv" demangled="btCollisionDispatcher::getCollisionConfiguration() const" location="f15:148" file="f15" line="148" endline="150" inline="1"/>
  <Method id="_2675" name="setCollisionConfiguration" returns="_635" context="_298" access="public" mangled="_ZN21btCollisionDispatcher25setCollisionConfigurationEP24btCollisionConfiguration" demangled="btCollisionDispatcher::setCollisionConfiguration(btCollisionConfiguration*)" location="f15:153" file="f15" line="153" endline="155" inline="1">
    <Argument name="config" type="_9074" location="f15:153" file="f15" line="153"/>
  </Method>
  <Method id="_2676" name="getInternalManifoldPool" returns="_9047" virtual="1" overrides="_5439 " context="_298" access="public" mangled="_ZN21btCollisionDispatcher23getInternalManifoldPoolEv" demangled="btCollisionDispatcher::getInternalManifoldPool()" location="f15:158" file="f15" line="158" endline="160" inline="1"/>
  <Method id="_2677" name="getInternalManifoldPool" returns="_9079" const="1" virtual="1" overrides="_5440 " context="_298" access="public" mangled="_ZNK21btCollisionDispatcher23getInternalManifoldPoolEv" demangled="btCollisionDispatcher::getInternalManifoldPool() const" location="f15:163" file="f15" line="163" endline="165" inline="1"/>
  <PointerType id="_2678" type="_356c" size="64" align="64"/>
  <Field id="_2679" name="m_jac" type="_9081" offset="576" context="_307" access="private" location="f78:55" file="f78" line="55"/>
  <Field id="_2680" name="m_jacAng" type="_9081" offset="2592" context="_307" access="private" location="f78:56" file="f78" line="56"/>
  <Field id="_2681" name="m_rbAFrame" type="_485" offset="4608" context="_307" access="private" location="f78:58" file="f78" line="58"/>
  <Field id="_2682" name="m_rbBFrame" type="_485" offset="5120" context="_307" access="private" location="f78:59" file="f78" line="59"/>
  <Field id="_2683" name="m_motorTargetVelocity" type="_362" offset="5632" context="_307" access="private" location="f78:61" file="f78" line="61"/>
  <Field id="_2684" name="m_maxMotorImpulse" type="_362" offset="5664" context="_307" access="private" location="f78:62" file="f78" line="62"/>
  <Field id="_2685" name="m_limit" type="_1705" offset="5696" context="_307" access="private" location="f78:66" file="f78" line="66"/>
  <Field id="_2686" name="m_kHinge" type="_362" offset="5952" context="_307" access="private" location="f78:80" file="f78" line="80"/>
  <Field id="_2687" name="m_accLimitImpulse" type="_362" offset="5984" context="_307" access="private" location="f78:83" file="f78" line="83"/>
  <Field id="_2688" name="m_hingeAngle" type="_362" offset="6016" context="_307" access="private" location="f78:84" file="f78" line="84"/>
  <Field id="_2689" name="m_referenceSign" type="_362" offset="6048" context="_307" access="private" location="f78:85" file="f78" line="85"/>
  <Field id="_2690" name="m_angularOnly" type="_1834" offset="6080" context="_307" access="private" location="f78:87" file="f78" line="87"/>
  <Field id="_2691" name="m_enableAngularMotor" type="_1834" offset="6088" context="_307" access="private" location="f78:88" file="f78" line="88"/>
  <Field id="_2692" name="m_useSolveConstraintObsolete" type="_1834" offset="6096" context="_307" access="private" location="f78:89" file="f78" line="89"/>
  <Field id="_2693" name="m_useOffsetForConstraintFrame" type="_1834" offset="6104" context="_307" access="private" location="f78:90" file="f78" line="90"/>
  <Field id="_2694" name="m_useReferenceFrameA" type="_1834" offset="6112" context="_307" access="private" location="f78:91" file="f78" line="91"/>
  <Field id="_2695" name="m_accMotorImpulse" type="_362" offset="6144" context="_307" access="private" location="f78:93" file="f78" line="93"/>
  <Field id="_2696" name="m_flags" type="_168" offset="6176" context="_307" access="private" location="f78:95" file="f78" line="95"/>
  <Field id="_2697" name="m_normalCFM" type="_362" offset="6208" context="_307" access="private" location="f78:96" file="f78" line="96"/>
  <Field id="_2698" name="m_stopCFM" type="_362" offset="6240" context="_307" access="private" location="f78:97" file="f78" line="97"/>
  <Field id="_2699" name="m_stopERP" type="_362" offset="6272" context="_307" access="private" location="f78:98" file="f78" line="98"/>
  <Constructor id="_2700" name="btHingeConstraint" artificial="1" context="_307" access="public" mangled="_ZN17btHingeConstraintC1ERKS_ *INTERNAL* " demangled="btHingeConstraint::btHingeConstraint(btHingeConstraint const&amp;)" location="f78:51" file="f78" line="51" endline="51" inline="1">
    <Argument type="_9082" location="f78:51" file="f78" line="51"/>
  </Constructor>
  <OperatorMethod id="_2701" name="new" returns="_1077" static="1" context="_307" access="public" mangled="_ZN17btHingeConstraintnwEm" demangled="btHingeConstraint::operator new(unsigned long)" location="f78:103" file="f78" line="103" endline="103" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f78:103" file="f78" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2702" name="delete" returns="_635" static="1" context="_307" access="public" mangled="_ZN17btHingeConstraintdlEPv" demangled="btHingeConstraint::operator delete(void*)" location="f78:103" file="f78" line="103" endline="103" inline="1">
    <Argument name="ptr" type="_1077" location="f78:103" file="f78" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2703" name="new" returns="_1077" static="1" context="_307" access="public" mangled="_ZN17btHingeConstraintnwEmPv" demangled="btHingeConstraint::operator new(unsigned long, void*)" location="f78:103" file="f78" line="103" endline="103" inline="1">
    <Argument type="_1165" location="f78:103" file="f78" line="103"/>
    <Argument name="ptr" type="_1077" location="f78:103" file="f78" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2704" name="delete" returns="_635" static="1" context="_307" access="public" mangled="_ZN17btHingeConstraintdlEPvS0_" demangled="btHingeConstraint::operator delete(void*, void*)" location="f78:103" file="f78" line="103" inline="1">
    <Argument type="_1077" location="f78:103" file="f78" line="103"/>
    <Argument type="_1077" location="f78:103" file="f78" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2705" name="new []" returns="_1077" static="1" context="_307" access="public" mangled="_ZN17btHingeConstraintnaEm" demangled="btHingeConstraint::operator new[](unsigned long)" location="f78:103" file="f78" line="103" endline="103" inline="1">
    <Argument name="sizeInBytes" type="_1165" location="f78:103" file="f78" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2706" name="delete []" returns="_635" static="1" context="_307" access="public" mangled="_ZN17btHingeConstraintdaEPv" demangled="btHingeConstraint::operator delete[](void*)" location="f78:103" file="f78" line="103" endline="103" inline="1">
    <Argument name="ptr" type="_1077" location="f78:103" file="f78" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2707" name="new []" returns="_1077" static="1" context="_307" access="public" mangled="_ZN17btHingeConstraintnaEmPv" demangled="btHingeConstraint::operator new[](unsigned long, void*)" location="f78:103" file="f78" line="103" endline="103" inline="1">
    <Argument type="_1165" location="f78:103" file="f78" line="103"/>
    <Argument name="ptr" type="_1077" location="f78:103" file="f78" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2708" name="delete []" returns="_635" static="1" context="_307" access="public" mangled="_ZN17btHingeConstraintdaEPvS0_" demangled="btHingeConstraint::operator delete[](void*, void*)" location="f78:103" file="f78" line="103" inline="1">
    <Argument type="_1077" location="f78:103" file="f78" line="103"/>
    <Argument type="_1077" location="f78:103" file="f78" line="103"/>
  </OperatorMethod>
  <Constructor id="_2709" name="btHingeConstraint" explicit="1" context="_307" access="public" mangled="_ZN17btHingeConstraintC1ER11btRigidBodyS1_RK9btVector3S4_S4_S4_b *INTERNAL* " demangled="btHingeConstraint::btHingeConstraint(btRigidBody&amp;, btRigidBody&amp;, btVector3 const&amp;, btVector3 const&amp;, btVector3 const&amp;, btVector3 const&amp;, bool)" location="f78:105" file="f78" line="105" extern="1">
    <Argument name="rbA" type="_8891" location="f78:105" file="f78" line="105"/>
    <Argument name="rbB" type="_8891" location="f78:105" file="f78" line="105"/>
    <Argument name="pivotInA" type="_1824" location="f78:105" file="f78" line="105"/>
    <Argument name="pivotInB" type="_1824" location="f78:105" file="f78" line="105"/>
    <Argument name="axisInA" type="_1824" location="f78:105" file="f78" line="105"/>
    <Argument name="axisInB" type="_1824" location="f78:105" file="f78" line="105"/>
    <Argument name="useReferenceFrameA" type="_1834" location="f78:105" file="f78" line="105" default="false"/>
  </Constructor>
  <Constructor id="_2710" name="btHingeConstraint" explicit="1" context="_307" access="public" mangled="_ZN17btHingeConstraintC1ER11btRigidBodyRK9btVector3S4_b *INTERNAL* " demangled="btHingeConstraint::btHingeConstraint(btRigidBody&amp;, btVector3 const&amp;, btVector3 const&amp;, bool)" location="f78:107" file="f78" line="107" extern="1">
    <Argument name="rbA" type="_8891" location="f78:107" file="f78" line="107"/>
    <Argument name="pivotInA" type="_1824" location="f78:107" file="f78" line="107"/>
    <Argument name="axisInA" type="_1824" location="f78:107" file="f78" line="107"/>
    <Argument name="useReferenceFrameA" type="_1834" location="f78:107" file="f78" line="107" default="false"/>
  </Constructor>
  <Constructor id="_2711" name="btHingeConstraint" explicit="1" context="_307" access="public" mangled="_ZN17btHingeConstraintC1ER11btRigidBodyS1_RK11btTransformS4_b *INTERNAL* " demangled="btHingeConstraint::btHingeConstraint(btRigidBody&amp;, btRigidBody&amp;, btTransform const&amp;, btTransform const&amp;, bool)" location="f78:109" file="f78" line="109" extern="1">
    <Argument name="rbA" type="_8891" location="f78:109" file="f78" line="109"/>
    <Argument name="rbB" type="_8891" location="f78:109" file="f78" line="109"/>
    <Argument name="rbAFrame" type="_6975" location="f78:109" file="f78" line="109"/>
    <Argument name="rbBFrame" type="_6975" location="f78:109" file="f78" line="109"/>
    <Argument name="useReferenceFrameA" type="_1834" location="f78:109" file="f78" line="109" default="false"/>
  </Constructor>
  <Constructor id="_2712" name="btHingeConstraint" explicit="1" context="_307" access="public" mangled="_ZN17btHingeConstraintC1ER11btRigidBodyRK11btTransformb *INTERNAL* " demangled="btHingeConstraint::btHingeConstraint(btRigidBody&amp;, btTransform const&amp;, bool)" location="f78:111" file="f78" line="111" extern="1">
    <Argument name="rbA" type="_8891" location="f78:111" file="f78" line="111"/>
    <Argument name="rbAFrame" type="_6975" location="f78:111" file="f78" line="111"/>
    <Argument name="useReferenceFrameA" type="_1834" location="f78:111" file="f78" line="111" default="false"/>
  </Constructor>
  <Method id="_2713" name="buildJacobian" returns="_635" virtual="1" overrides="_1891 " context="_307" access="public" mangled="_ZN17btHingeConstraint13buildJacobianEv" demangled="btHingeConstraint::buildJacobian()" location="f78:114" file="f78" line="114" extern="1"/>
  <Method id="_2714" name="getInfo1" returns="_635" virtual="1" overrides="_1893 " context="_307" access="public" mangled="_ZN17btHingeConstraint8getInfo1EPN17btTypedConstraint17btConstraintInfo1E" demangled="btHingeConstraint::getInfo1(btTypedConstraint::btConstraintInfo1*)" location="f78:116" file="f78" line="116" extern="1">
    <Argument name="info" type="_3699" location="f78:116" file="f78" line="116"/>
  </Method>
  <Method id="_2715" name="getInfo1NonVirtual" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint18getInfo1NonVirtualEPN17btTypedConstraint17btConstraintInfo1E" demangled="btHingeConstraint::getInfo1NonVirtual(btTypedConstraint::btConstraintInfo1*)" location="f78:118" file="f78" line="118" extern="1">
    <Argument name="info" type="_3699" location="f78:118" file="f78" line="118"/>
  </Method>
  <Method id="_2716" name="getInfo2" returns="_635" virtual="1" overrides="_1894 " context="_307" access="public" mangled="_ZN17btHingeConstraint8getInfo2EPN17btTypedConstraint17btConstraintInfo2E" demangled="btHingeConstraint::getInfo2(btTypedConstraint::btConstraintInfo2*)" location="f78:120" file="f78" line="120" extern="1">
    <Argument name="info" type="_8922" location="f78:120" file="f78" line="120"/>
  </Method>
  <Method id="_2717" name="getInfo2NonVirtual" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint18getInfo2NonVirtualEPN17btTypedConstraint17btConstraintInfo2ERK11btTransformS5_RK9btVector3S8_" demangled="btHingeConstraint::getInfo2NonVirtual(btTypedConstraint::btConstraintInfo2*, btTransform const&amp;, btTransform const&amp;, btVector3 const&amp;, btVector3 const&amp;)" location="f78:122" file="f78" line="122" extern="1">
    <Argument name="info" type="_8922" location="f78:122" file="f78" line="122"/>
    <Argument name="transA" type="_6975" location="f78:122" file="f78" line="122"/>
    <Argument name="transB" type="_6975" location="f78:122" file="f78" line="122"/>
    <Argument name="angVelA" type="_1824" location="f78:122" file="f78" line="122"/>
    <Argument name="angVelB" type="_1824" location="f78:122" file="f78" line="122"/>
  </Method>
  <Method id="_2718" name="getInfo2Internal" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint16getInfo2InternalEPN17btTypedConstraint17btConstraintInfo2ERK11btTransformS5_RK9btVector3S8_" demangled="btHingeConstraint::getInfo2Internal(btTypedConstraint::btConstraintInfo2*, btTransform const&amp;, btTransform const&amp;, btVector3 const&amp;, btVector3 const&amp;)" location="f78:124" file="f78" line="124" extern="1">
    <Argument name="info" type="_8922" location="f78:124" file="f78" line="124"/>
    <Argument name="transA" type="_6975" location="f78:124" file="f78" line="124"/>
    <Argument name="transB" type="_6975" location="f78:124" file="f78" line="124"/>
    <Argument name="angVelA" type="_1824" location="f78:124" file="f78" line="124"/>
    <Argument name="angVelB" type="_1824" location="f78:124" file="f78" line="124"/>
  </Method>
  <Method id="_2719" name="getInfo2InternalUsingFrameOffset" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint32getInfo2InternalUsingFrameOffsetEPN17btTypedConstraint17btConstraintInfo2ERK11btTransformS5_RK9btVector3S8_" demangled="btHingeConstraint::getInfo2InternalUsingFrameOffset(btTypedConstraint::btConstraintInfo2*, btTransform const&amp;, btTransform const&amp;, btVector3 const&amp;, btVector3 const&amp;)" location="f78:125" file="f78" line="125" extern="1">
    <Argument name="info" type="_8922" location="f78:125" file="f78" line="125"/>
    <Argument name="transA" type="_6975" location="f78:125" file="f78" line="125"/>
    <Argument name="transB" type="_6975" location="f78:125" file="f78" line="125"/>
    <Argument name="angVelA" type="_1824" location="f78:125" file="f78" line="125"/>
    <Argument name="angVelB" type="_1824" location="f78:125" file="f78" line="125"/>
  </Method>
  <Method id="_2720" name="updateRHS" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint9updateRHSEf" demangled="btHingeConstraint::updateRHS(float)" location="f78:128" file="f78" line="128" extern="1">
    <Argument name="timeStep" type="_362" location="f78:128" file="f78" line="128"/>
  </Method>
  <Method id="_2721" name="getRigidBodyA" returns="_8923" const="1" context="_307" access="public" mangled="_ZNK17btHingeConstraint13getRigidBodyAEv" demangled="btHingeConstraint::getRigidBodyA() const" location="f78:130" file="f78" line="130" endline="132" inline="1"/>
  <Method id="_2722" name="getRigidBodyB" returns="_8923" const="1" context="_307" access="public" mangled="_ZNK17btHingeConstraint13getRigidBodyBEv" demangled="btHingeConstraint::getRigidBodyB() const" location="f78:134" file="f78" line="134" endline="136" inline="1"/>
  <Method id="_2723" name="getRigidBodyA" returns="_8891" context="_307" access="public" mangled="_ZN17btHingeConstraint13getRigidBodyAEv" demangled="btHingeConstraint::getRigidBodyA()" location="f78:139" file="f78" line="139" endline="141" inline="1"/>
  <Method id="_2724" name="getRigidBodyB" returns="_8891" context="_307" access="public" mangled="_ZN17btHingeConstraint13getRigidBodyBEv" demangled="btHingeConstraint::getRigidBodyB()" location="f78:144" file="f78" line="144" endline="146" inline="1"/>
  <Method id="_2725" name="getFrameOffsetA" returns="_8994" context="_307" access="public" mangled="_ZN17btHingeConstraint15getFrameOffsetAEv" demangled="btHingeConstraint::getFrameOffsetA()" location="f78:149" file="f78" line="149" endline="151" inline="1"/>
  <Method id="_2726" name="getFrameOffsetB" returns="_8994" context="_307" access="public" mangled="_ZN17btHingeConstraint15getFrameOffsetBEv" demangled="btHingeConstraint::getFrameOffsetB()" location="f78:154" file="f78" line="154" endline="156" inline="1"/>
  <Method id="_2727" name="setFrames" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint9setFramesERK11btTransformS2_" demangled="btHingeConstraint::setFrames(btTransform const&amp;, btTransform const&amp;)" location="f78:159" file="f78" line="159" extern="1">
    <Argument name="frameA" type="_6975" location="f78:159" file="f78" line="159"/>
    <Argument name="frameB" type="_6975" location="f78:159" file="f78" line="159"/>
  </Method>
  <Method id="_2728" name="setAngularOnly" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint14setAngularOnlyEb" demangled="btHingeConstraint::setAngularOnly(bool)" location="f78:161" file="f78" line="161" endline="163" inline="1">
    <Argument name="angularOnly" type="_1834" location="f78:161" file="f78" line="161"/>
  </Method>
  <Method id="_2729" name="enableAngularMotor" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint18enableAngularMotorEbff" demangled="btHingeConstraint::enableAngularMotor(bool, float, float)" location="f78:166" file="f78" line="166" endline="170" inline="1">
    <Argument name="enableMotor" type="_1834" location="f78:166" file="f78" line="166"/>
    <Argument name="targetVelocity" type="_362" location="f78:166" file="f78" line="166"/>
    <Argument name="maxMotorImpulse" type="_362" location="f78:166" file="f78" line="166"/>
  </Method>
  <Method id="_2730" name="enableMotor" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint11enableMotorEb" demangled="btHingeConstraint::enableMotor(bool)" location="f78:176" file="f78" line="176" endline="176" inline="1">
    <Argument name="enableMotor" type="_1834" location="f78:176" file="f78" line="176"/>
  </Method>
  <Method id="_2731" name="setMaxMotorImpulse" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint18setMaxMotorImpulseEf" demangled="btHingeConstraint::setMaxMotorImpulse(float)" location="f78:177" file="f78" line="177" endline="177" inline="1">
    <Argument name="maxMotorImpulse" type="_362" location="f78:177" file="f78" line="177"/>
  </Method>
  <Method id="_2732" name="setMotorTarget" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint14setMotorTargetERK12btQuaternionf" demangled="btHingeConstraint::setMotorTarget(btQuaternion const&amp;, float)" location="f78:178" file="f78" line="178" extern="1">
    <Argument name="qAinB" type="_3314" location="f78:178" file="f78" line="178"/>
    <Argument name="dt" type="_362" location="f78:178" file="f78" line="178"/>
  </Method>
  <Method id="_2733" name="setMotorTarget" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint14setMotorTargetEff" demangled="btHingeConstraint::setMotorTarget(float, float)" location="f78:179" file="f78" line="179" extern="1">
    <Argument name="targetAngle" type="_362" location="f78:179" file="f78" line="179"/>
    <Argument name="dt" type="_362" location="f78:179" file="f78" line="179"/>
  </Method>
  <Method id="_2734" name="setLimit" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint8setLimitEfffff" demangled="btHingeConstraint::setLimit(float, float, float, float, float)" location="f78:182" file="f78" line="182" endline="185" inline="1">
    <Argument name="low" type="_362" location="f78:182" file="f78" line="182"/>
    <Argument name="high" type="_362" location="f78:182" file="f78" line="182"/>
    <Argument name="_softness" type="_362" location="f78:182" file="f78" line="182" default="8.9999997615814208984375e-1f"/>
    <Argument name="_biasFactor" type="_362" location="f78:182" file="f78" line="182" default="3.00000011920928955078125e-1f"/>
    <Argument name="_relaxationFactor" type="_362" location="f78:182" file="f78" line="182" default="1.0e+0f"/>
  </Method>
  <Method id="_2735" name="setAxis" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint7setAxisER9btVector3" demangled="btHingeConstraint::setAxis(btVector3&amp;)" location="f78:195" file="f78" line="195" endline="216" inline="1">
    <Argument name="axisInA" type="_2535" location="f78:195" file="f78" line="195"/>
  </Method>
  <Method id="_2736" name="getLowerLimit" returns="_362" const="1" context="_307" access="public" mangled="_ZNK17btHingeConstraint13getLowerLimitEv" demangled="btHingeConstraint::getLowerLimit() const" location="f78:220" file="f78" line="220" endline="223" inline="1"/>
  <Method id="_2737" name="getUpperLimit" returns="_362" const="1" context="_307" access="public" mangled="_ZNK17btHingeConstraint13getUpperLimitEv" demangled="btHingeConstraint::getUpperLimit() const" location="f78:229" file="f78" line="229" endline="232" inline="1"/>
  <Method id="_2738" name="getHingeAngle" returns="_362" context="_307" access="public" mangled="_ZN17btHingeConstraint13getHingeAngleEv" demangled="btHingeConstraint::getHingeAngle()" location="f78:239" file="f78" line="239" extern="1"/>
  <Method id="_2739" name="getHingeAngle" returns="_362" context="_307" access="public" mangled="_ZN17btHingeConstraint13getHingeAngleERK11btTransformS2_" demangled="btHingeConstraint::getHingeAngle(btTransform const&amp;, btTransform const&amp;)" location="f78:241" file="f78" line="241" extern="1">
    <Argument name="transA" type="_6975" location="f78:241" file="f78" line="241"/>
    <Argument name="transB" type="_6975" location="f78:241" file="f78" line="241"/>
  </Method>
  <Method id="_2740" name="testLimit" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint9testLimitERK11btTransformS2_" demangled="btHingeConstraint::testLimit(btTransform const&amp;, btTransform const&amp;)" location="f78:243" file="f78" line="243" extern="1">
    <Argument name="transA" type="_6975" location="f78:243" file="f78" line="243"/>
    <Argument name="transB" type="_6975" location="f78:243" file="f78" line="243"/>
  </Method>
  <Method id="_2741" name="getAFrame" returns="_6975" const="1" context="_307" access="public" mangled="_ZNK17btHingeConstraint9getAFrameEv" demangled="btHingeConstraint::getAFrame() const" location="f78:246" file="f78" line="246" endline="246" inline="1"/>
  <Method id="_2742" name="getBFrame" returns="_6975" const="1" context="_307" access="public" mangled="_ZNK17btHingeConstraint9getBFrameEv" demangled="btHingeConstraint::getBFrame() const" location="f78:247" file="f78" line="247" endline="247" inline="1"/>
  <Method id="_2743" name="getAFrame" returns="_8994" context="_307" access="public" mangled="_ZN17btHingeConstraint9getAFrameEv" demangled="btHingeConstraint::getAFrame()" location="f78:249" file="f78" line="249" endline="249" inline="1"/>
  <Method id="_2744" name="getBFrame" returns="_8994" context="_307" access="public" mangled="_ZN17btHingeConstraint9getBFrameEv" demangled="btHingeConstraint::getBFrame()" location="f78:250" file="f78" line="250" endline="250" inline="1"/>
  <Method id="_2745" name="getSolveLimit" returns="_168" context="_307" access="public" mangled="_ZN17btHingeConstraint13getSolveLimitEv" demangled="btHingeConstraint::getSolveLimit()" location="f78:252" file="f78" line="252" endline="255" inline="1"/>
  <Method id="_2746" name="getLimitSign" returns="_362" context="_307" access="public" mangled="_ZN17btHingeConstraint12getLimitSignEv" demangled="btHingeConstraint::getLimitSign()" location="f78:261" file="f78" line="261" endline="264" inline="1"/>
  <Method id="_2747" name="getAngularOnly" returns="_1834" context="_307" access="public" mangled="_ZN17btHingeConstraint14getAngularOnlyEv" demangled="btHingeConstraint::getAngularOnly()" location="f78:270" file="f78" line="270" endline="272" inline="1"/>
  <Method id="_2748" name="getEnableAngularMotor" returns="_1834" context="_307" access="public" mangled="_ZN17btHingeConstraint21getEnableAngularMotorEv" demangled="btHingeConstraint::getEnableAngularMotor()" location="f78:274" file="f78" line="274" endline="276" inline="1"/>
  <Method id="_2749" name="getMotorTargetVelosity" returns="_362" context="_307" access="public" mangled="_ZN17btHingeConstraint22getMotorTargetVelosityEv" demangled="btHingeConstraint::getMotorTargetVelosity()" location="f78:278" file="f78" line="278" endline="280" inline="1"/>
  <Method id="_2750" name="getMaxMotorImpulse" returns="_362" context="_307" access="public" mangled="_ZN17btHingeConstraint18getMaxMotorImpulseEv" demangled="btHingeConstraint::getMaxMotorImpulse()" location="f78:282" file="f78" line="282" endline="284" inline="1"/>
  <Method id="_2751" name="getUseFrameOffset" returns="_1834" context="_307" access="public" mangled="_ZN17btHingeConstraint17getUseFrameOffsetEv" demangled="btHingeConstraint::getUseFrameOffset()" location="f78:287" file="f78" line="287" endline="287" inline="1"/>
  <Method id="_2752" name="setUseFrameOffset" returns="_635" context="_307" access="public" mangled="_ZN17btHingeConstraint17setUseFrameOffsetEb" demangled="btHingeConstraint::setUseFrameOffset(bool)" location="f78:288" file="f78" line="288" endline="288" inline="1">
    <Argument name="frameOffsetOnOff" type="_1834" location="f78:288" file="f78" line="288"/>
  </Method>
  <Method id="_2753" name="setParam" returns="_635" virtual="1" overrides="_1922 " context="_307" access="public" mangled="_ZN17btHingeConstraint8setParamEifi" demangled="btHingeConstraint::setParam(int, float, int)" location="f78:293" file="f78" line="293" extern="1">
    <Argument name="num" type="_168" location="f78:293" file="f78" line="293"/>
    <Argument name="value" type="_362" location="f78:293" file="f78" line="293"/>
    <Argument name="axis" type="_168" location="f78:293" file="f78" line="293" default="-0x00000000000000001"/>
  </Method>
  <Method id="_2754" name="getParam" returns="_362" const="1" virtual="1" overrides="_1923 " context="_307" access="public" mangled="_ZNK17btHingeConstraint8getParamEii" demangled="btHingeConstraint::getParam(int, int) const" location="f78:295" file="f78" line="295" extern="1">
    <Argument name="num" type="_168" location="f78:295" file="f78" line="295"/>
    <Argument name="axis" type="_168" location="f78:295" file="f78" line="295" default="-0x00000000000000001"/>
  </Method>
  <Method id="_2755" name="calculateSerializeBufferSize" returns="_168" const="1" virtual="1" overrides="_1924 " context="_307" access="public" mangled="_ZNK17btHingeConstraint28calculateSerializeBufferSizeEv" demangled="btHingeConstraint::calculateSerializeBufferSize() const" location="f78:376" file="f78" line="376" endline="378" inline="1"/>
  <Method id="_2756" name="serialize" returns="_1823" const="1" virtual="1" overrides="_1925 " context="_307" access="public" mangled="_ZNK17btHingeConstraint9serializeEPvP12btSerializer" demangled="btHingeConstraint::serialize(void*, btSerializer*) const" location="f78:382" file="f78" line="382" endline="409" inline="1">
    <Argument name="dataBuffer" type="_1077" location="f78:382" file="f78" line="382"/>
    <Argument name="serializer" type="_8886" location="f78:382" file="f78" line="382"/>
  </Method>
  <Destructor id="_2757" name="btHingeConstraint" virtual="1" overrides="_1885 " artificial="1" context="_307" access="public" mangled="_ZN17btHingeConstraintD1Ev *INTERNAL* " demangled="btHingeConstraint::~btHingeConstraint()" location="f78:51" file="f78" line="51" endline="51" inline="1">
  </Destructor>
  <Field id="_2758" name="m_typeConstraintData" type="_403" offset="0" context="_313" access="public" location="f49:150" file="f49" line="150"/>
  <Field id="_2759" name="m_pivotInA" type="_1353" offset="512" context="_313" access="public" location="f49:151" file="f49" line="151"/>
  <Field id="_2760" name="m_pivotInB" type="_1353" offset="768" context="_313" access="public" location="f49:152" file="f49" line="152"/>
  <Destructor id="_2761" name="btPoint2PointConstraintDoubleData" artificial="1" throw="" context="_313" access="public" mangled="_ZN33btPoint2PointConstraintDoubleDataD1Ev *INTERNAL* " demangled="btPoint2PointConstraintDoubleData::~btPoint2PointConstraintDoubleData()" location="f49:149" file="f49" line="149" endline="149" inline="1">
  </Destructor>
  <OperatorMethod id="_2762" name="=" returns="_9083" artificial="1" throw="" context="_313" access="public" mangled="_ZN33btPoint2PointConstraintDoubleDataaSERKS_" demangled="btPoint2PointConstraintDoubleData::operator=(btPoint2PointConstraintDoubleData const&amp;)" location="f49:149" file="f49" line="149" endline="149" inline="1">
    <Argument type="_9084" location="f49:149" file="f49" line="149"/>
  </OperatorMethod>
  <Constructor id="_2763" name="btPoint2PointConstraintDoubleData" artificial="1" throw="" context="_313" access="public" mangled="_ZN33btPoint2PointConstraintDoubleDataC1ERKS_ *INTERNAL* " demangled="btPoint2PointConstraintDoubleData::btPoint2PointConstraintDoubleData(btPoint2PointConstraintDoubleData const&amp;)" location="f49:149" file="f49" line="149" endline="149" inline="1">
    <Argument type="_9084" location="f49:149" file="f49" line="149"/>
  </Constructor>
  <Constructor id="_2764" name="btPoint2PointConstraintDoubleData" artificial="1" throw="" context="_313" access="public" mangled="_ZN33btPoint2PointConstraintDoubleDataC1Ev *INTERNAL* " demangled="btPoint2PointConstraintDoubleData::btPoint2PointConstraintDoubleData()" location="f49:149" file="f49" line="149" inline="1"/>
  <PointerType id="_2765" type="_356" size="64" align="64"/>
  <FundamentalType id="_2766" name="long long unsigned int" size="64" align="64"/>
  <Field id="_2767" name="m_useSolveConstraintObsolete" type="_1834" offset="576" context="_330" access="protected" location="f51:73" file="f51" line="73"/>
  <Field id="_2768" name="m_useOffsetForConstraintFrame" type="_1834" offset="584" context="_330" access="protected" location="f51:74" file="f51" line="74"/>
  <Field id="_2769" name="m_frameInA" type="_485" offset="608" context="_330" access="protected" location="f51:75" file="f51" line="75"/>
  <Field id="_2770" name="m_frameInB" type="_485" offset="1120" context="_330" access="protected" location="f51:76" file="f51" line="76"/>
  <Field id="_2771" name="m_useLinearReferenceFrameA" type="_1834" offset="1632" context="_330" access="protected" location="f51:78" file="f51" line="78"/>
  <Field id="_2772" name="m_lowerLinLimit" type="_362" offset="1664" context="_330" access="protected" location="f51:80" file="f51" line="80"/>
  <Field id="_2773" name="m_upperLinLimit" type="_362" offset="1696" context="_330" access="protected" location="f51:81" file="f51" line="81"/>
  <Field id="_2774" name="m_lowerAngLimit" type="_362" offset="1728" context="_330" access="protected" location="f51:83" file="f51" line="83"/>
  <Field id="_2775" name="m_upperAngLimit" type="_362" offset="1760" context="_330" access="protected" location="f51:84" file="f51" line="84"/>
  <Field id="_2776" name="m_softnessDirLin" type="_362" offset="1792" context="_330" access="protected" location="f51:91" file="f51" line="91"/>
  <Field id="_2777" name="m_restitutionDirLin" type="_362" offset="1824" context="_330" access="protected" location="f51:92" file="f51" line="92"/>
  <Field id="_2778" name="m_dampingDirLin" type="_362" offset="1856" context="_330" access="protected" location="f51:93" file="f51" line="93"/>
  <Field id="_2779" name="m_cfmDirLin" type="_362" offset="1888" context="_330" access="protected" location="f51:94" file="f51" line="94"/>
  <Field id="_2780" name="m_softnessDirAng" type="_362" offset="1920" context="_330" access="protected" location="f51:96" file="f51" line="96"/>
  <Field id="_2781" name="m_restitutionDirAng" type="_362" offset="1952" context="_330" access="protected" location="f51:97" file="f51" line="97"/>
  <Field id="_2782" name="m_dampingDirAng" type="_362" offset="1984" context="_330" access="protected" location="f51:98" file="f51" line="98"/>
  <Field id="_2783" name="m_cfmDirAng" type="_362" offset="2016" context="_330" access="protected" location="f51:99" file="f51" line="99"/>
  <Field id="_2784" name="m_softnessLimLin" type="_362" offset="2048" context="_330" access="protected" location="f51:101" file="f51" line="101"/>
  <Field id="_2785" name="m_restitutionLimLin" type="_362" offset="2080" context="_330" access="protected" location="f51:102" file="f51" line="102"/>
  <Field id="_2786" name="m_dampingLimLin" type="_362" offset="2112" context="_330" access="protected" location="f51:103" file="f51" line="103"/>
  <Field id="_2787" name="m_cfmLimLin" type="_362" offset="2144" context="_330" access="protected" location="f51:104" file="f51" line="104"/>
  <Field id="_2788" name="m_softnessLimAng" type="_362" offset="2176" context="_330" access="protected" location="f51:106" file="f51" line="106"/>
  <Field id="_2789" name="m_restitutionLimAng" type="_362" offset="2208" context="_330" access="protected" location="f51:107" file="f51" line="107"/>
  <Field id="_2790" name="m_dampingLimAng" type="_362" offset="2240" context="_330" access="protected" location="f51:108" file="f51" line="108"/>
  <Field id="_2791" name="m_cfmLimAng" type="_362" offset="2272" context="_330" access="protected" location="f51:109" file="f51" line="109"/>
  <Field id="_2792" name="m_softnessOrthoLin" type="_362" offset="2304" context="_330" access="protected" location="f51:111" file="f51" line="111"/>
  <Field id="_2793" name="m_restitutionOrthoLin" type="_362" offset="2336" context="_330" access="protected" location="f51:112" file="f51" line="112"/>
  <Field id="_2794" name="m_dampingOrthoLin" type="_362" offset="2368" context="_330" access="protected" location="f51:113" file="f51" line="113"/>
  <Field id="_2795" name="m_cfmOrthoLin" type="_362" offset="2400" context="_330" access="protected" location="f51:114" file="f51" line="114"/>
  <Field id="_2796" name="m_softnessOrthoAng" type="_362" offset="2432" context="_330" access="protected" location="f51:116" file="f51" line="116"/>
  <Field id="_2797" name="m_restitutionOrthoAng" type="_362" offset="2464" context="_330" access="protected" location="f51:117" file="f51" line="117"/>
  <Field id="_2798" name="m_dampingOrthoAng" type="_362" offset="2496" context="_330" access="protected" location="f51:118" file="f51" line="118"/>
  <Field id="_2799" name="m_cfmOrthoAng" type="_362" offset="2528" context="_330" access="protected" location="f51:119" file="f51" line="119"/>
  <Field id="_2800" name="m_solveLinLim" type="_1834" offset="2560" context="_330" access="protected" location="f51:122" file="f51" line="122"/>
  <Field id="_2801" name="m_solveAngLim" type="_1834" offset="2568" context="_330" access="protected" location="f51:123" file="f51" line="123"/>
  <Field id="_2802" name="m_flags" type="_168" offset="2592" context="_330" access="protected" location="f51:125" file="f51" line="125"/>
  <Field id="_2803" name="m_jacLin" type="_9081" offset="2624" context="_330" access="protected" location="f51:127" file="f51" line="127"/>
  <Field id="_2804" name="m_jacLinDiagABInv" type="_9085" offset="4640" context="_330" access="protected" location="f51:128" file="f51" line="128"/>
  <Field id="_2805" name="m_jacAng" type="_9081" offset="4736" context="_330" access="protected" location="f51:130" file="f51" line="130"/>
  <Field id="_2806" name="m_timeStep" type="_362" offset="6752" context="_330" access="protected" location="f51:132" file="f51" line="132"/>
  <Field id="_2807" name="m_calculatedTransformA" type="_485" offset="6784" context="_330" access="protected" location="f51:133" file="f51" line="133"/>
  <Field id="_2808" name="m_calculatedTransformB" type="_485" offset="7296" context="_330" access="protected" location="f51:134" file="f51" line="134"/>
  <Field id="_2809" name="m_sliderAxis" type="_193" offset="7808" context="_330" access="protected" location="f51:136" file="f51" line="136"/>
  <Field id="_2810" name="m_realPivotAInW" type="_193" offset="7936" context="_330" access="protected" location="f51:137" file="f51" line="137"/>
  <Field id="_2811" name="m_realPivotBInW" type="_193" offset="8064" context="_330" access="protected" location="f51:138" file="f51" line="138"/>
  <Field id="_2812" name="m_projPivotInW" type="_193" offset="8192" context="_330" access="protected" location="f51:139" file="f51" line="139"/>
  <Field id="_2813" name="m_delta" type="_193" offset="8320" context="_330" access="protected" location="f51:140" file="f51" line="140"/>
  <Field id="_2814" name="m_depth" type="_193" offset="8448" context="_330" access="protected" location="f51:141" file="f51" line="141"/>
  <Field id="_2815" name="m_relPosA" type="_193" offset="8576" context="_330" access="protected" location="f51:142" file="f51" line="142"/>
  <Field id="_2816" name="m_relPosB" type="_193" offset="8704" context="_330" access="protected" location="f51:143" file="f51" line="143"/>
  <Field id="_2817" name="m_linPos" type="_362" offset="8832" context="_330" access="protected" location="f51:145" file="f51" line="145"/>
  <Field id="_2818" name="m_angPos" type="_362" offset="8864" context="_330" access="protected" location="f51:146" file="f51" line="146"/>
  <Field id="_2819" name="m_angDepth" type="_362" offset="8896" context="_330" access="protected" location="f51:148" file="f51" line="148"/>
  <Field id="_2820" name="m_kAngle" type="_362" offset="8928" context="_330" access="protected" location="f51:149" file="f51" line="149"/>
  <Field id="_2821" name="m_poweredLinMotor" type="_1834" offset="8960" context="_330" access="protected" location="f51:151" file="f51" line="151"/>
  <Field id="_2822" name="m_targetLinMotorVelocity" type="_362" offset="8992" context="_330" access="protected" location="f51:152" file="f51" line="152"/>
  <Field id="_2823" name="m_maxLinMotorForce" type="_362" offset="9024" context="_330" access="protected" location="f51:153" file="f51" line="153"/>
  <Field id="_2824" name="m_accumulatedLinMotorImpulse" type="_362" offset="9056" context="_330" access="protected" location="f51:154" file="f51" line="154"/>
